[{"id":5071,"question":"Which of the following is the result of calculating the arithmetic expression “B6 – 7C”? Here, all numbers are represented in unsigned hexadecimal.","answer_label":"3A","answer_id":20758},{"id":5156,"question":"When the figure below shows the process flow of a compiler that is used for procedural languages, which of the following is the appropriate combination that should be inserted into blanks A though C?\n![](https://learn.viblo.asia/uploads/0/9/0983f377-66f8-475b-84b1-ffdd725f3094.png)","answer_label":"b","answer_id":21098},{"id":1801,"question":"In a real time system, which of the following is the data structure that is most suitable for the scheduling of multiple tasks with different priority levels?","answer_label":"Linked list","answer_id":8413},{"id":3443,"question":"When the size of a still image is 1 , 600 x 1 , 200 pixels and each pixel has a 256-level gray scale ranging from 0 to 255, approximately how many megabytes are needed at least to store five such still images?","answer_label":"10","answer_id":14696},{"id":13777,"question":"Two operations against a queue are defined below. \nENQ n: adds a number n at the end of the queue. \nDEQ: removes the number at the head of the queue. \n\nFor an empty queue, a sequence of operations, \n“ENQ 1, ENQ 2, ENQ 3, DEQ, ENQ 4, ENQ 5, DEQ, ENQ 6, DEQ, DEQ”, \nis performed in this order. When another DEQ is performed in succession, what is the number to be removed by this operation?","answer_label":"5","answer_id":53360},{"id":4273,"question":"The table below shows a state transition table that checks the input character string. This check starts from the initial state A, and it fails if the state changes to E during the input of the character string. Which of the character strings in the answer group fails this check? Here, the symbol Δ in the answer group represents a space.\n![](https://learn.viblo.asia/uploads/5/b/5bf1772e-6ada-4b84-a6ca-d028f5b61bb7.png)","answer_label":"12.2","answer_id":17961},{"id":1856,"question":"Typical list data type implementations are either array based or pointer based. Which of the following describes a characteristic of array-based implementations?","answer_label":"Regardless of the actual number of elements in a list, some space may remain unused as\nthe space for storing the maximum number of elements is pre-allocated.","answer_id":8634},{"id":6359,"question":"Which of the following is equivalent to the logical expression shown below? Here, “•” is used for the logical product, and “+” is for the logical sum. \n((X + Y) • (X + Z)) + ((X •Y) + (X • Z))","answer_label":"(X + (Y • Z)) + (X • (Y + Z))","answer_id":25562},{"id":709,"question":"For an eight-bit integer x represented in two’s complement format, which of the following yields the value of 5x? Here, the overflow or underflow can be ignored in this multiplication.","answer_label":"Shift x to the left by 2 bits, then add the initial value of x to it.","answer_id":5271},{"id":441,"question":"There are two boxes; the first box contains two green balls and three red balls; the second box contains three green balls and two red balls. A boy randomly selects a box from the two, and then randomly picks a ball from that box. If the ball is red, what is the probability that he selected the first box?","answer_label":"3/20","answer_id":6004},{"id":3314,"question":"Each character in a text file is encoded as a double-byte character, and then the file is\ntransmitted with 4 KB header information through a serial communication interface at a\nspeed of 1,000 bps. When a text file consists of 100,000 characters, how long in\nseconds does it take to continuously transmit the file and its header? Here, 1 KB is\n1,000 bytes.","answer_label":"1632","answer_id":14193},{"id":1800,"question":"As shown below, there is a binary search tree where each node contains a country name and is ordered alphabetically so that Mongolia comes before Philippines, Myanmar comes before Philippines but after Mongolia, and so on. Which of the following is the appropriate order of the country names that can create this binary search tree by inserting each country name in an empty tree?\n![](https://learn.viblo.asia/uploads/9/1/919f9e7e-33bb-464f-a7f8-c0a4aa50117e.png)","answer_label":"Philippines, Vietnam, Mongolia, Thailand, Bangladesh, Myanmar, Malaysia","answer_id":8410},{"id":3254,"question":"![](https://learn.viblo.asia/uploads/4/d/4d5455df-06fb-46fe-9d91-d7c217c9d870.png)","answer_label":"C","answer_id":13975},{"id":4280,"question":"There are two methods to execute byte-code programs written in Java. In the first method, an interpreter is used to execute byte-code. In the second method, native code generated by a compiler is executed. In the second method, how many lines of byte-code are at least required, in order to achieve shorter processing time (including compiling time) than the first method, under the conditions below?\n\n[Conditions]\n\n(1) The execution time is proportional to the number of lines in the program.\n\n(2) If a program consisting of 100 lines of byte-code is executed using an interpreter, it takes 0.2 seconds. If the same program is executed after compiling, it takes 0.003 seconds.\n\n(3) It takes 0.1 seconds to compile 100 lines.\n\n(4) In case of the method using a compiler, an overhead of 0.15 seconds is always required for  file input/output, compiler startup, and so on, regardless of the number of lines in the program.\n\n(5) Other miscellaneous time such as time for downloading the program file may be ignored.","answer_label":"155","answer_id":17989},{"id":6291,"question":"![](https://learn.viblo.asia/uploads/9/a/9abe01df-cb4c-456f-bc77-2f8b04429523.png)","answer_label":"b","answer_id":25316},{"id":1799,"question":"When the condition and inferences are given as shown below, which of the following is the appropriate combination that supports the validity of the two inferences?\nCondition: Inference 1: Inference 2:\nIf it rains, then the street will be wet.\nThe street is not wet, and therefore, it did not rain. It did not rain, and therefore, the street is not wet.\n![](https://learn.viblo.asia/uploads/2/b/2bd3c9b2-44be-4517-b22d-04cd3889b982.png)","answer_label":"c","answer_id":8405},{"id":6042,"question":"Which of the following decimal fractions becomes a finite fraction in an octal representation?","answer_label":"0.5","answer_id":24383},{"id":2771,"question":"Which of the following is the most appropriate description of a queue?","answer_label":"Data that is stored first is retrieved first.","answer_id":12083},{"id":4393,"question":"![](https://learn.viblo.asia/uploads/8/b/8ba63c5e-bd7f-4e27-b235-845383ce46c1.png)","answer_label":"d","answer_id":18408},{"id":6353,"question":"Which of the following is the appropriate way to check whether or not an 8-bit unsigned binary number x is a multiple of 16?","answer_label":"The bit-by-bit logical product between x and the binary number 00001111 is 0.","answer_id":25538},{"id":6053,"question":"In a microprocessor, there are two general registers: GRi and GRj (hereinafter referred to as GRx instead of GRi or GRj). PUSH GRx is used for adding the contents of GRx to the top of a stack. POP GRx is for removing the current top data of the stack and storing it to GRx. Which of the following operations can exchange the contents of GRi and GRj?","answer_label":"PUSH GRi, PUSH GRj, POP GRi, POP GRj","answer_id":24427},{"id":2768,"question":"When 4-bit signed numbers in 2's complement are used, which of the following operations will cause either an overflow or an underflow?","answer_label":"Subtract B from A when A is 0111 and B is 1010.","answer_id":12073},{"id":3194,"question":"The flowchart below shows the algorithm that generates and prints a 4-digit decimal\nnumber where each digit is randomly generated and has a different decimal number.\nWhich of the following is the correct combination of expressions that can be inserted\ninto blanks A and B in the flowchart? Here, the function “random (0, 9)” is used to\ngenerate a random decimal integer from 0 through 9. The one-dimensional array “d”\nconsists of 10 elements d[0] through d[9].\n![](https://learn.viblo.asia/uploads/3/9/39625e64-6ce0-4c0d-97b0-0512b78fc061.png)","answer_label":"d","answer_id":13760},{"id":2918,"question":"In a web environment, which of the following is the name of a program that runs on a web server and achieves dynamic processing?","answer_label":"Java servlet","answer_id":12658},{"id":4264,"question":"Which of the following is the correct value of the quadruple of hexadecimal fraction 0.FEDC?","answer_label":"3.FB70","answer_id":17925},{"id":6057,"question":"Which of the following equations holds well in the postfix notation (or Reverse Polish Notation)? Here, x, y, and z are variables.","answer_label":"x y – z + = x y z – –","answer_id":24443},{"id":4274,"question":"There are two jugs; one is a 4-liter (4L) jug and the other is a 3-liter (3L) jug. Which of the following is the correct sequence to obtain exactly 2 liters of water in the 4L jug under the conditions shown below? Here, (x, y) indicates that the 4L jug contains x liters of water and the 3L jug has y liters of water.\n[Conditions]\nYou can use only the 3L and 4L jugs.\nYou are allowed to fill up or empty either jug.\nYou are allowed to pour water from one jug to the other.\nThe jugs have no scale marks.\nThere is an amply supply of water.","answer_label":"(0,0) → (0,3) → (3,0) → (3,3) → (4,2) → (0,2) → (2,0)","answer_id":17964},{"id":13776,"question":"A list is implemented with two arrays \"box\" and \"next\". Each element in the list corresponds to a pair (box[i], next[i]), where box[i] is the value of the element, and next[i] is the index to the next element in the list. When the element of value \"H\" is inserted between the third and fourth elements in the list shown below, which of the following is the value contained in next[8]? Here, next[0] contains the index of the leading (first) element of the list, the index i whose next[i] is 0 indicates the last element of the list, and each index i whose next[i] is blank indicates that the element is out of the list.\n![](https://learn.viblo.asia/uploads/3/b/3b5c5b09-9966-4676-8782-f22ea76bdb22.png)","answer_label":"7","answer_id":53356},{"id":3226,"question":"Which of the following is an appropriate combination of Boolean expressions that are\nlogically equivalent to the logic circuit shown below? Here, “·” , “+”, and “ ⊕ ”\nrepresent the logical product, logical sum, and exclusive logical sum operations\nrespectively, and “ X ” is the logical negation of “ X ”.\n![](https://learn.viblo.asia/uploads/3/2/328cf30b-ad5c-4407-a550-fcbef421cb34.png)","answer_label":"b","answer_id":13872},{"id":437,"question":"When two unbiased coins are tossed and an unbiased six-sided die is rolled at the same time, what is the probability that at least one coin shows heads and the die shows an even number?","answer_label":"3/8","answer_id":5989},{"id":5076,"question":"Which of the following is the logical expression whose resulting value is zero (0) only when the binary values of “x 1 , x 2 , ..., x n ” are all zeros (0s) or all ones (1s)? Here, “·” and “+” represent the logical product and logical sum operators respectively, and “ x ” is the logical negation of “x”.\n![](https://learn.viblo.asia/uploads/4/6/46443d09-9b06-4a3f-b8a5-bf88c4b7e535.png)","answer_label":"d","answer_id":20780},{"id":6363,"question":"A k-ary tree is a tree in which every node has no more than k children. A binary tree is the special case where k=2. In a k-ary tree with n nodes and height h, which of the following is an upper bound for the number of leaves?\n![](https://learn.viblo.asia/uploads/9/2/923e07bc-0e3a-4caa-8ec5-fd3069a78af0.png)","answer_label":"b","answer_id":25579},{"id":3606,"question":"When the simultaneous equations shown below hold for the Boolean variables w , x , y , and z , which of the following is the correct solution? Here, “+” stands for the logical sum operation, and “·” for the logical product operation.\n![](https://learn.viblo.asia/uploads/7/7/77ad14be-0e5c-429f-8bc9-aeff91ebcbd5.png)","answer_label":"c","answer_id":15341},{"id":3308,"question":"Which of the following is the scatter diagram that shows a “negative correlation”?\n![](https://learn.viblo.asia/uploads/4/9/49c850ee-91b1-4eaa-ab48-faac3a379e1c.png)","answer_label":"b","answer_id":14171},{"id":4747,"question":"In a certain company, there are a total of 400 employees including 100 smokers. The number of male employees is 250, including 75 male smokers. What is the probability that an employee selected at random is a female nonsmoker?\n![](https://learn.viblo.asia/uploads/0/b/0b7e8f88-9337-4fa2-bcd8-78007a1c2f5a.png)","answer_label":"d","answer_id":19626},{"id":3048,"question":"When F (v, w) is defined using standard predicate logic as shown below, which of the\nfollowing is the correct meaning of F (v, w)? Here, P (x, y) means “x is a parent of y ”,\nand W (x) means “x is a female”. In addition, “ ∃ x ∃ y P (x, y) ” means that there exist x\nand y such that P (x, y) is true.\n![](https://learn.viblo.asia/uploads/6/6/66835d07-2392-478b-871f-6616dabb7d5b.png)","answer_label":"v is an aunt of w.","answer_id":13171},{"id":2913,"question":"Which of the following is the computational complexity of the Heapsort algorithm? Here,\nn is the number of elements to be sorted. All comparisons, swaps, and other needed\noperations can proceed in constant time.","answer_label":"O (n log n)","answer_id":12640},{"id":3603,"question":"In the truth table shown below, which of the following is the correct combination of output values ![](https://learn.viblo.asia/uploads/c/6/c6d8d099-43dc-4904-a299-000abdd6ea34.png)\n stands for the logical product, “+” for the logical sum, ![](https://learn.viblo.asia/uploads/8/6/86e9c21d-0caf-4986-89e9-33172ed58b86.png) for the exclusive OR, and ![](https://learn.viblo.asia/uploads/e/2/e2df4516-e355-4b62-88a4-7861f55ba7fc.png) \nfor the logical negation of “ X ”.\n![](https://learn.viblo.asia/uploads/9/f/9fb38c13-3393-40ff-8b69-37e484865a42.png)\n![](https://learn.viblo.asia/uploads/9/2/92dcca16-5be0-4bf0-b824-a211ef9f9f78.png)","answer_label":"c","answer_id":15329},{"id":6356,"question":"A k-string is a character string with a length of k characters. An m-substring is an ordered sequence with a length of m characters, which consists of consecutive elements of the original k-string. An n-subsequence is also an ordered sequence with a length of n characters, which consists of elements of the original k-string, but it does not need to be consecutive. How many m-substrings and n-subsequences are respectively included in the k-string?\n![](https://learn.viblo.asia/uploads/5/a/5a34ccda-4856-4436-ad2a-c45416cc3cec.png)","answer_label":"a","answer_id":25550},{"id":3316,"question":"When a series of data shown below is searched using the binary search algorithm, what\nis the minimum number of comparisons needed to find a value of 5?\n2, 5, 15, 16, 27, 27, 28, 40, 41, 51, 52, 55, 55, 57, 67, 79","answer_label":"3","answer_id":14200},{"id":3609,"question":"When a linked list is used for queue implementation, which of the following structures provides the most efficient and effective way to perform both “insert” and “delete” operations? Here, the number of queue elements is variable, and the arrows shown in the figures represent link pointers.\n![](https://learn.viblo.asia/uploads/6/1/610f52dc-de34-4f25-95dd-011446bc9409.png)","answer_label":"c","answer_id":15353},{"id":4268,"question":"In the Venn Diagrams labeled 1 to 3, which of the following is the result of Boolean “OR” operations for all three to be combined? Each set corresponding to x,y, or z is depicted by a circle.\n![](https://learn.viblo.asia/uploads/b/a/ba9e2942-2f88-4d92-ad0a-b7c31676a5fd.png)","answer_label":"x AND (NOT y) AND (NOT z) OR (NOT x) OR y","answer_id":17941},{"id":5075,"question":"The figure below shows the state transition diagram of an automaton. Which of the following is a bit string for which the automaton stops in the accepting (or final) state after the entire bit string has been read? Here, the double circle marked with “q 3 ” represents the accepting state.\n![](https://learn.viblo.asia/uploads/4/6/46443d09-9b06-4a3f-b8a5-bf88c4b7e535.png)","answer_label":"1101","answer_id":20775},{"id":4749,"question":"Which of the following sets is equivalent to the set ![](https://learn.viblo.asia/uploads/6/9/696f584a-2923-468f-964b-52c7913d0b51.png)\n Here, ![](https://learn.viblo.asia/uploads/f/a/fa98e0dc-894b-49ea-a56b-0a06e87a1737.png) stands for a product set operation, ![](https://learn.viblo.asia/uploads/b/5/b5e653ba-53b3-4d9d-b0eb-f52d290dc7f0.png)\n for a union set operation, and “ - ” for a difference set operation.\n![](https://learn.viblo.asia/uploads/4/e/4e78b466-0f0c-4d9f-9b59-e68f2c72b37e.png)","answer_label":"a","answer_id":19631},{"id":5946,"question":"Which of the following expressions results in a loss of trailing digits when calculated by a computer whose floating-point representation has a 23-bit mantissa? Here, the numbers in “(     $)_2$” are represented in binary.\n![](https://learn.viblo.asia/uploads/0/4/04bbcfb0-2478-4aea-848b-8626cf884990.png)","answer_label":"c","answer_id":23997},{"id":6056,"question":"A depth-first search (DFS) visits all the vertices in a graph. When an edge to be explored next is chosen, this algorithm always chooses to go “deeper” into the graph. That is, it will pick the next adjacent unvisited vertex until reaching a vertex that has no unvisited adjacent vertices. The algorithm will then backtrack to the previous vertex and continue along any as-yet unexplored edges from that vertex. After DFS has visited all the reachable vertices from a particular source vertex, it chooses one of the remaining undiscovered vertices and continues the search. Which of the following is not a valid order in which the vertices of the graph below can be marked as “visited” during a DFS?\n![](https://learn.viblo.asia/uploads/2/7/2766873e-2b0a-455d-aaf0-1ceb204573c4.png)","answer_label":"ABCDEF","answer_id":24437},{"id":6043,"question":"When a certain natural number x is expressed as a 2n-digit binary number “1010…10” consisting of 1 and 0 arranged alternately, which of the following equations can be formulated in terms of the number x?","answer_label":"x + x / 2 = 2^(2n) – 1","answer_id":24386},{"id":4750,"question":"The figure below shows the state transition diagram of an automaton that accepts bit strings with even numbers of 1s. The double circle marked with “Even” represents the accepted state. Which of the following combinations should be inserted in the blank boxes labeled A and B ?\n![](https://learn.viblo.asia/uploads/d/c/dc3c24ee-48a2-43ad-b6bd-d2e5636acde6.png)\n![](https://learn.viblo.asia/uploads/2/9/294588ee-37a0-4be5-b485-ab0aad19c0af.png)","answer_label":"c","answer_id":19637},{"id":3433,"question":"Which of the following is a logical equation that is equivalent to the logic circuit shown below? Here, the “ • ” is the logical product, “+” is the logical sum, and X is the negation of X.\n![](https://learn.viblo.asia/uploads/b/f/bfc81f8f-8d28-40cd-9226-a33e9d02b7e5.png)","answer_label":"c","answer_id":14656},{"id":4586,"question":"When a list of 7 elements shown below is rearranged in ascending order, which of the\nfollowing sorting algorithms is completed with the minimum number of element\nexchanges?\n\n3 | 5 | 12 | 9 | 10 | 7 | 15","answer_label":"Shell sort","answer_id":19062},{"id":6046,"question":"Which of the following is the appropriate statement concerning Newton’s method that is known as an algorithm for obtaining the approximate value of the solution to the formula f(x) = 0?","answer_label":"An approximate value of the solution is obtained geometrically using the tangent lines of y = f(x).","answer_id":24398},{"id":790,"question":"Which of the following is logically equivalent to the expression below? Here A, B, C, and D are integers, ‘<’ is a less-than operator, and ‘≤’ is a less-than-or-equal-to operator.\nnot ((A ≤ B) or (C < D))","answer_label":"(B<A) and (D≤C)","answer_id":4952},{"id":506,"question":"Two stack operations are defined:\nPUSH n: Pushes a data (integer value n) to the stack.\nPOP: Pops a data from the stack.\nFor an empty stack, which of the following is the result of performing stack operations in the sequence below?\nPUSH1 → PUSH5 → POP → PUSH7 → PUSH6 → PUSH4 → POP → POP → PUSH3\n![](https://learn.viblo.asia/uploads/6/0/60cd832c-7cc5-467d-b6bc-4cf431f9624c.png)","answer_label":"c","answer_id":5576},{"id":6085,"question":"Which of the following is the standardized document description language that prescribes methods, as an international standard, for describing the logical structures and attributes of documents using tags and facilitates the management and exchange of electronic documents?","answer_label":"SGML","answer_id":24556},{"id":436,"question":"What is the octal representation of a hexadecimal fraction F1B0.C?","answer_label":"170660.6","answer_id":5984},{"id":3431,"question":"Which of the following is equivalent to the result of the arithmetic expression “753₈ - A6₁₆”? Here, each number is written in radix notation; that is, the radix is represented by a subscript following the number.","answer_label":"325₁₀","answer_id":14648},{"id":3186,"question":"There is a three-dimensional array A starting with A[1, 1, 1] and ending with A[3, 5, 7],\nand consecutive integers starting with 0 are stored in ascending order. What is the\nmaximum value (in hexadecimal) of the integers that can be stored in the array? Here,\neach number in the answer list is written in radix notation.\n![](https://learn.viblo.asia/uploads/9/e/9ecf92eb-647e-47d0-9db9-3331505dd76c.png)","answer_label":"a","answer_id":13726},{"id":6299,"question":"![](https://learn.viblo.asia/uploads/1/5/15f2a7b0-2182-4185-9a6f-697eac5513c8.png)","answer_label":"b","answer_id":25346},{"id":5073,"question":"The distribution of days that are required to complete a certain activity can be approximated by a standard normal distribution with a mean of 500 days and a standard deviation of 12 days. What is the approximate 95% confidence interval in days for the activity?","answer_label":"Between 476 and 524","answer_id":20766},{"id":3437,"question":"A leap year in the Gregorian calendar includes an extra day at the end of February. Any year that is divisible by 4 and does not end in 00 is a leap year. Years ending in 00 are leap years only if they are divisible by 400. How many leap years are there between 1895 and 2011 in the Gregorian calendar?","answer_label":"28","answer_id":14671},{"id":5160,"question":"The flowchart below shows an algorithm that can be used to sort all elements of one-dimensional array X in reverse order and store them in array Y. In order to complete the algorithm, which of the following should be inserted into blanks A and B? Here, the indices of the first and last elements of each array are 1 and n respectively.\n![](https://learn.viblo.asia/uploads/3/2/328c5209-72db-4a34-aefa-37629896331f.png)","answer_label":"b","answer_id":21114},{"id":789,"question":"For an 8-bit binary number, which of the following sets the middle 4 bits to 1s while inverting the remaining bits?","answer_label":"Performing a bitwise NAND operation with 11000011","answer_id":4955},{"id":2774,"question":"Which of the following best describes the characteristics of XML?","answer_label":"XML allows a tag to be defined in order for an easier data exchange between information systems over the network.","answer_id":12096},{"id":6048,"question":"Two players, X and Y play a dice game. A pair of dice is tossed. If the sum of the dice is 2, 4, or 6, X wins the game. Otherwise, Y wins. What is the probability that Y wins the game?","answer_label":"3/4","answer_id":24408},{"id":4267,"question":"By definition of the IEEE754 standard, 32-bit floating point numbers are represented as follows:\n![](https://learn.viblo.asia/uploads/d/a/da8882d2-a0fa-4727-9ab3-766092ef9de0.png)\nWhich of the following is the correct “mask bits” in hexadecimal to be used for extracting only the exponent part of the above format? Here, “mask bits” means a bit pattern which is logically ANDed with the 32-bit floating point value.","answer_label":"7F800000","answer_id":17936},{"id":3442,"question":"In a virtual storage computer system with cache memory, main memory, and disk storage, it takes 2 nanoseconds, 10 nanoseconds, and 10 milliseconds, on average, to access data available in the cache, main memory, and disk storage, respectively. When the cache hit ratio and the main memory hit ratio (after a cache miss) are 0.95 and 0.99 respectively, which of the following is the approximate average time in microseconds to access the necessary data?","answer_label":"5.0","answer_id":14692},{"id":6055,"question":"A binary tree is said to be perfect, if all its leaves are at the same depth and every internal node has two children. Which of the following is correct about the perfect binary tree? Here, n is the number of nodes, and h is the height of the perfect binary tree.","answer_label":"n = 2^(h+1) – 1","answer_id":24435},{"id":1804,"question":"As shown in the table below, there are a total of 86 coins that are composed of five types of coins. Of those 86 coins, 60 coins are picked up so that the total value can be maximized. What is the total value in dollars? Here, 100 cents are equivalent to 1 dollar.\n![](https://learn.viblo.asia/uploads/1/9/19d0dfc5-2ab0-4935-9ed4-61e8c08ee209.png)","answer_label":"13.4","answer_id":8426},{"id":3315,"question":"Which of the following is an appropriate set of sorting algorithms that are based on the\ndivide-and-conquer strategy?","answer_label":"Merge sort, quick sort","answer_id":14196},{"id":731,"question":"Which of the following is a logical expression that is equivalent to the logic circuit shown below?\n\n![](https://learn.viblo.asia/uploads/9/a/9a79966e-fe5f-49c4-8ddc-7a0e9ee0cd39.png)","answer_label":"A OR B","answer_id":5188},{"id":3440,"question":"Which of the following is the characteristic of pipeline control?","answer_label":"The processing of each instruction is divided into multiple stages in the processor, and thus multiple instructions are executed in parallel.","answer_id":14685},{"id":6023,"question":"Which of the following prefix expressions is equivalent to the infix expression “(A + B)*C–(D–E)”?","answer_label":"–* + A B C – D E","answer_id":24304},{"id":13774,"question":"What is the value of the postfix expression below? Here, A, B, C, and D are operands whose values are 4, 3, 5, and 6, respectively. Symbols “+”, “−”, “×”, and “÷” are arithmetic operators for addition, subtraction, multiplication, and division, respectively. \n\nA B 2 × + D B ÷ C × −","answer_label":"0","answer_id":53347},{"id":3602,"question":"When the equation ![](https://learn.viblo.asia/uploads/7/a/7a1aa9df-605e-4a7a-8626-ba2ab0fab34e.png) holds, which of the following represents ![](https://learn.viblo.asia/uploads/f/d/fd030494-2b1e-4ca0-af21-51fd8027f745.png) Here, each number is written in radix. In addition, when there is no subscript, the radix 10 is implied.radix notation; that is, each subscript “n” indicates the","answer_label":"22","answer_id":15325},{"id":4275,"question":"Which of the following is the correct result produced by executing the program shown below? Here, the parameter “x” is called by value, and the parameter “y” is called by reference.\nMain Program\na = 2;\nb = 3;\nsub(b, a);\n\nSubprogram sub(x, y)\nx = x + y;\ny = x + y;\nreturn;","answer_label":"a = 7, b = 3","answer_id":17969},{"id":4333,"question":"![](https://learn.viblo.asia/uploads/a/b/ab8e12cb-8f19-471e-882b-a9cd7e0c1bb2.png)","answer_label":"0071361286","answer_id":18196},{"id":3311,"question":"When the hexadecimal value 2A is stored in an 8-bit register and is logically shifted left\nthree bits, which of the following is the resulting value in decimal? Here, the bit\npositions vacated on the right are filled with zeros, and bits shifted out on the left are\ndiscarded.","answer_label":"80","answer_id":14180},{"id":6026,"question":"When a set of values “5, 4, 3, 2, 8, 6, 0, 1, 9, and 7” is inserted in this order to create a binary search tree, which of the following represents the sequence of node values visited in the post-order traversal of the binary search tree?","answer_label":"1 0 2 3 4 7 6 9 8 5","answer_id":24317},{"id":3264,"question":"As shown in the arrow diagram below, there exists a project consisting of nine activities\nA through I . When the number of days required for activity E is shortened from 9 days\nto 6 days, by how many days can the minimum number of days required for this project\nbe shortened?\n![](https://learn.viblo.asia/uploads/5/3/53a72c5e-fd05-4ad7-869e-7cf1630cbabe.png)","answer_label":"1","answer_id":14014},{"id":793,"question":"The expression shown below is written in postfix (reverse Polish) notation. What is the value of this expression? Here, the numbers are in decimal, and the symbols ‘+’, ‘−’, ‘’, and ‘/’ represent addition, subtraction, multiplication, and division operators.\n100 5 6 2 + * 12 4 / − − 36 −","answer_label":"27","answer_id":4940},{"id":4585,"question":"A singly linked list is implemented using two arrays VALUE and LINK, in which\nLINK(I) points to the successor of VALUE(I). When a new element that does not\nexist initially in the list is assigned to VALUE(J), the program fragment shown below\nis executed.\nprogram?\nLINK(J) <- LINK(I);\nLINK(I) <- J;","answer_label":"VALUE(J) is inserted after VALUE(I) in the list.","answer_id":19056},{"id":5159,"question":"Bubble sort is implemented using a technique that repeatedly compares adjacent pairs of elements from left to right and swaps them if they are in the wrong order. Which of the following is the total number of comparisons for sorting a list of “n” elements?\n![](https://learn.viblo.asia/uploads/2/3/232867af-e399-4522-9b30-d80ee2f0228c.png)","answer_label":"c","answer_id":21111},{"id":2912,"question":"A factory manufactures the same products in two production lines A and B, where 60% of the products are manufactured in A, and the remaining in B. Defective rates of the\nproducts manufactured in A and B are 2% and 1%, respectively. When a product was randomly chosen for inspection, it was found to be defective. What is the percent probability that the product was manufactured in A?","answer_label":"75","answer_id":12636},{"id":2185,"question":"Function F(n) is a recursively defined integer function that calculates the factorial of n for\nany non-negative integer n. Which of the following is an appropriate expression for the\nblank A?\n![](https://learn.viblo.asia/uploads/1/4/14f9e09e-3e13-4619-a112-d448e6581ad8.png)","answer_label":"n × F(n - 1)","answer_id":9855},{"id":3607,"question":"Tic-tac-toe, also known as noughts and crosses, is a popular game for two players, O and X, who take turns marking the spaces in a 3× 3 grid. The player who succeeds in placing three respective marks in a horizontal, vertical, or diagonal row wins the game. For example, the player O wins on the tic-tac-toe board shown below.\n![](https://learn.viblo.asia/uploads/7/1/718aecd0-2abc-418b-84a3-2c29a61a0fa9.png)\nHow many possible combinations of moves are there to fill all of the nine spaces, regardless of wins and losses?\n![](https://learn.viblo.asia/uploads/5/f/5fe48301-799a-4723-8690-125fd9d28fa0.png)","answer_label":"c","answer_id":15345},{"id":4751,"question":"Which of the following is the minimum possible depth of a binary tree with 14 nodes?","answer_label":"3","answer_id":19639},{"id":501,"question":"For logical variables p and q, which of the following is a logical expressions that evaluates to true for any values of p and q?\n![](https://learn.viblo.asia/uploads/a/1/a106f804-1b82-41b3-8bbf-01fae309e342.png)","answer_label":"b","answer_id":5595},{"id":5152,"question":"Which of the following is equivalent to the logical expression below? Here, “AND” has higher precedence than “OR”, and “NOT” has the highest precedence. \n![](https://learn.viblo.asia/uploads/b/b/bb36f44b-b32f-455a-ba42-e1f1cd91bb76.png)","answer_label":"a","answer_id":21081},{"id":4266,"question":"The decimal value “-72” is stored in an 8-bit register using 2’s complement. If the data in the register is logically shifted two bits to the right, which of the following is the correct result that is represented in decimal?","answer_label":"46","answer_id":17934},{"id":6357,"question":"There are 3 white balls and 3 red balls in a box. What is the probability that the two balls taken out at random from the box are one white ball and one red ball?","answer_label":"3/5","answer_id":25557},{"id":6024,"question":"The syntax rules of the field identifier “field ID” are represented in BNF notation as shown below. When each ID is defined as an arbitrary sequence of letters and/or digits, which of the following should be inserted into the blank A?\n![](https://learn.viblo.asia/uploads/e/a/eaa51730-b5b2-40f1-b8f1-07a0c2b508e5.png)","answer_label":"<letter> | <digit> | <ID> <letter> | <ID> <digit>","answer_id":24310},{"id":6022,"question":"When a single-bit “half adder” circuit is used for simply adding two input signals x1 and x2 , which of the following is the appropriate combination of logical expressions for two output signals s (sum) and c (carry)? Here, “ + ” stands for the logical OR operation and “ ・ ” for the logical AND operation.\n![](https://learn.viblo.asia/uploads/d/0/d0557cdb-fd2d-411d-970d-38e601e0d136.png)","answer_label":"c","answer_id":24302},{"id":6054,"question":"Which of the following is the appropriate statement concerning data sorting methods?","answer_label":"The “heap sort” method builds an ordered tree from the unsorted portion of the elements, extracts the maximum or minimum value from this ordered tree, and moves it to the sorted portion. This operational sequence is then repeated to gradually shrink the unsorted portion.","answer_id":24430},{"id":4580,"question":"In what radix does the following equation hold?\n131 − 45 = 53","answer_label":"7","answer_id":19036},{"id":5947,"question":"There is a device consisting of Unit A, Unit B, and Unit C. Each unit can execute the “exclusive OR” operation in units of 4 bits. When an input bit string 1101 is given, an output bit string 0100 is obtained. In this device, if the internal key for Unit B is changed and the output bit string 1111 is generated, which of the following is the newly changed internal key for Unit B?\n![](https://learn.viblo.asia/uploads/a/c/ac4838ba-d8c6-48dc-bbe6-47bad2c175fe.png)","answer_label":"1110","answer_id":24002},{"id":1757,"question":"Which of the following is the output of the flowchart below?![](https://learn.viblo.asia/uploads/7/3/73182557-6486-4860-9476-949295267ed6.png)","answer_label":"10 8 6 4 2 0","answer_id":8237},{"id":5955,"question":"The flowchart below shows an algorithm in which two integers are temporarily entered into two variables x and y at the beginning, and then, after comparison of the two integers, the larger number is stored in the variable x and the smaller is in the variable y. In order to complete the algorithm, which of the following should be inserted in the process box $\\boxed {A}$ in the flowchart?\n![](https://learn.viblo.asia/uploads/f/9/f917381c-f5b6-4f5c-9b65-fa9ee59caa67.png)","answer_label":"c","answer_id":24033},{"id":6027,"question":"There is a queue with eight cells and two pointers as shown below. \n![](https://learn.viblo.asia/uploads/8/e/8ed7980a-9913-4c09-a78c-97b741be828d.png)\nAt this point, three values 6, 8, and 15 are stored in the queue. The start and end pointers indicate the location of the first and last data values respectively. After the series of operations described below is performed, which of the following is the appropriate combination of the two pointers? Here, upon reaching the end of the queue area, the pointers wrap around to the beginning of the queue again. \n[Operations] \n1.One value is enqueued. \n2.Two values are dequeued. \n3.Three values are enqueued. \n4.One value is dequeued. \n![](https://learn.viblo.asia/uploads/5/a/5a6eb8d0-75bc-47b5-bd7f-31ca516035a9.png)","answer_label":"c","answer_id":24322},{"id":3614,"question":"When the expression ![](https://learn.viblo.asia/uploads/d/e/de56441c-da86-4519-960e-79414b81b2bb.png) is calculated, which of the following should be inserted in the process box ![](https://learn.viblo.asia/uploads/6/a/6afa33b7-75d6-4db2-a832-998f7c60e7b1.png) in the flowchart shown below?\n![](https://learn.viblo.asia/uploads/c/6/c60418dc-91f0-4562-ae38-ddeaa96549eb.png)\n![](https://learn.viblo.asia/uploads/1/9/192e94a3-ae80-42da-b0d7-0faf5c25f003.png)","answer_label":"b","answer_id":15372},{"id":3213,"question":"![](https://learn.viblo.asia/uploads/d/5/d55b3ef7-75c3-4f1f-85f2-e585f4bebdb8.png)","answer_label":"d","answer_id":13825},{"id":6049,"question":"There are a total of 1,900 students in a school, 553 of whom are taking a course in computer science, 667 of whom are in mathematics, and 290 of whom are in both computer science and mathematics. How many students are not taking a course in either computer science or in mathematics?","answer_label":"970","answer_id":24411},{"id":4272,"question":"Which of the following is an appropriate description concerning the list and/or array structures?","answer_label":"The list structure allows any data to be inserted or deleted simply by modifying pointers. But, after the data was deleted, the cells that contained the data remain as garbage in memory.","answer_id":17955},{"id":6296,"question":"![](https://learn.viblo.asia/uploads/e/2/e299913e-fa65-4fad-9a05-b148bc4d6b72.png)","answer_label":"b","answer_id":25334},{"id":4582,"question":"The formula shown below is represented in postfix (or reverse Polish) notation.\nWhich of following is the resulting value of this formula?\n5 1 – 3 * 3 1 – 2 * /","answer_label":"3","answer_id":19044},{"id":4746,"question":"Which of the following operations does not change the lower 4 bits of an 8-bit string?","answer_label":"A logical product (i.e. AND) with a bit string 0F in hexadecimal","answer_id":19619},{"id":5158,"question":"Which of the following is an appropriate technique that is used for implementing a queue as a data structure?","answer_label":"FIFO","answer_id":21105},{"id":4754,"question":"When a list of seven elements shown below is rearranged in ascending order, which of the following sorting algorithms is completed with the minimum number of element exchanges?\n![](https://learn.viblo.asia/uploads/4/0/40fab62f-97ea-42aa-9bfe-16612577ae7a.png)","answer_label":"Selection sort","answer_id":19652},{"id":4740,"question":"Which of the following arithmetic expressions is correct? Here, a number is written in radix notation; that is, a decimal subscript following the number ![](https://learn.viblo.asia/uploads/4/c/4c0f5234-e051-40d2-b1e1-e4646a83aa28.png)\n is used to indicate the radix.\n![](https://learn.viblo.asia/uploads/a/8/a8cfec00-486b-484e-a7ae-47e5f82ae06e.png)","answer_label":"b","answer_id":19596},{"id":4584,"question":"A coin is tossed three times. What is the probability that it lands on heads exactly one time?","answer_label":"0.375","answer_id":19054},{"id":5072,"question":"There are several formats for representing an integer in a computer. When a set of unsigned binary integers that are arranged in ascending order is interpreted in different formats and then sorted again in ascending order of their values, which of the following is the format that maintains the same order as the original unsigned binary integers?","answer_label":"Biased (i.e., offset binary) format","answer_id":20761},{"id":3613,"question":"When the binary search algorithm is applied to the list of data sorted in ascending order as shown below, how many comparisons are needed to find the fact that “104” is not in the list?\n![](https://learn.viblo.asia/uploads/f/3/f32f2858-98df-4505-955c-137e5a8a414a.png)","answer_label":"4","answer_id":15368},{"id":5079,"question":"In  the  binary  search  tree  shown  below,  which  of  the  following  is  the  appropriate  sequence of nodes that are visited in an in-order traversal? \n![](https://learn.viblo.asia/uploads/0/d/0d1d7f9d-9a2b-4d6f-a739-5d322d34bf3d.png)","answer_label":"D => B => E => A => C => F","answer_id":20791},{"id":5153,"question":"How many multiplications at a minimum must be performed in order to calculate the polynomial expression “x^4–2x^3+5x^2+x–6”?","answer_label":"3","answer_id":21086},{"id":5943,"question":"The function f(x) has a real-type argument and a real-type return value. The procedure using this function is shown in the steps 1 through 5. When this procedure is executed repeatedly a sufficient number of times and the value of y stops changing in the step 3, which of the following expressions holds? \n[Steps] \n1. x←a \n2. y←f(x) \n3. Display the value of y \n4. x←y \n5. Return to the step 2","answer_label":"f(y) = y","answer_id":23986},{"id":4385,"question":"![](https://learn.viblo.asia/uploads/b/0/b096631f-1f68-4e4c-9390-c1f6c4597535.png)","answer_label":"(x + y) / 2 → m","answer_id":18386},{"id":13775,"question":"In machine learning, which of the following best describes the supervised learning?","answer_label":"It is used to get a correct answer for new input data after being trained on a dataset with answer keys.","answer_id":53352},{"id":2773,"question":"In Java technologies, which of the following is the specification of creating reusable software components that have frequently used functionalities?","answer_label":"JavaBeans","answer_id":12093},{"id":5154,"question":"How many binary numbers can be represented using a 6-bit number that does not have two contiguous 1s? For example, “101010” does not have two contiguous 1s.","answer_label":"21","answer_id":21091},{"id":715,"question":"For a function f(x, y) defined below, what is the value of f(775, 527)? Here, x mod y represents the remainder after division of x by y.\n\nf(x, y): if y = 0 then return x else return f(y, x mod y)","answer_label":"31","answer_id":5247},{"id":455,"question":"Which of the following is used to control the visual styles of HTML documents, such as text sizes, text colors, or page layout?","answer_label":"CSS","answer_id":5973},{"id":4285,"question":"In fixed-point representation that expresses negative numbers by two’s complement, which range of integers can be expressed with n bits? Here, the position of the binary point is to the right of the least significant bit.\n![](https://learn.viblo.asia/uploads/b/2/b237ec14-af8a-4e97-b5af-a966959856cf.png)","answer_label":"c","answer_id":18004},{"id":6029,"question":"The steps below are used to sort a dataset in descending order by using a max heap.\n[Steps] \n1.Extract an element one by one from an unsorted dataset, and insert it into a max heap until all the elements are extracted and inserted. \n2.Delete the root element from the max heap, and store it in a sorted dataset. Stop if all the elements are deleted. Otherwise, go to Step 3. \n3.Move the rightmost element on the deepest level to the root. Go to Step 2 if the remaining elements are in the correct order as a max heap (that is, all the parent elements are greater than or equal to their corresponding child elements). Otherwise, go to Step 4. \n4.Compare the replaced element with its children, and then exchange the element for its larger child. Go to Step 2 if all the elements are in the correct order as a max heap. Otherwise, continue Step 4 toward deeper levels. \nIn the max heap shown below, how many element exchanges in Step 4 are executed to build the next max heap after deletion of the root “5” in Step 2?\n![](https://learn.viblo.asia/uploads/b/6/b625a6d3-5715-4ed2-8a4c-a5d1c92f25c4.png)","answer_label":"2","answer_id":24330},{"id":3233,"question":"![](https://learn.viblo.asia/uploads/e/5/e5d6d13c-0fb1-4cb3-8284-e0b9027b425e.png)","answer_label":"Second normal form","answer_id":13898},{"id":6021,"question":"There is an 8-bit register where integers are represented in binary by using 2’s complement for negative numbers. When the decimal integer “– 24” is stored in the register and then arithmetically shifted 2 bits right, what is the resulting value in decimal? Here, the leftmost bit of the register is used as a sign bit.","answer_label":"-6","answer_id":24298},{"id":4743,"question":"There is an 8-bit numerical value, where a negative number is represented in two’s complement. When this value is represented in decimal, it becomes -100. When this value is regarded as an unsigned number, which of the following is the correct value in decimal?","answer_label":"156","answer_id":19609},{"id":791,"question":"There are 16 cards numbered from 1 to 16. When four cards are randomly chosen at the same time, what is the probability that all of them are even?","answer_label":"1/26","answer_id":4946},{"id":2911,"question":"Among the bit strings of length 4, how many of them either start with 1 or end with 00?","answer_label":"10","answer_id":12631},{"id":3605,"question":"When the resulting value of the expression “13 × 16 + 11 × 16 + 9 × 16+ 3” is represented in binary, how many “1” bits are included in the binary value?","answer_label":"10","answer_id":15336},{"id":1853,"question":"Which of the following decimal values is equivalent to a hexadecimal fraction 0.B1?\n\n![](https://learn.viblo.asia/uploads/e/1/e1270175-06db-4f5b-aa55-ec8c6f84519c.png)","answer_label":"d","answer_id":8622},{"id":507,"question":"In a table search, which of the following is a characteristic of the search technique known as hashing?","answer_label":"The storage locations of data are determined based on the function values of their keys.","answer_id":5572},{"id":5944,"question":"The student scores in a certain examination are shown in the table below. What is the standard deviation of these student scores? Here, the standard deviation δ can be defined as follows: \n$\\delta^2 = \\frac 1 n \\overset{n}{\\sum_{{i=0}}}{(x_i - \\overline{x})}^2$\n“δ” is a positive number, and “$n$” is the number of sample values. “$x_i$” is each sample value, and “$\\overline{x}$”is an arithmetic average of the sample values.\n![](https://learn.viblo.asia/uploads/9/3/93e0b52c-3d39-4316-8507-4d3af2cfab04.png)","answer_label":"20","answer_id":23988},{"id":4277,"question":"In a certain computer, a bubble sort of an array of 200 data elements takes the same time as a quick sort of the array. In case of an array of 40,000 data elements, how many times faster is a quick sort than a bubble sort? Here, a bubble sort and a quick sort take time proportional to $n^2$ and $n\\times log_2 n$ respectively, and “n” is the number of data elements.","answer_label":"100","answer_id":17976},{"id":794,"question":"For a two-dimensional integer array a, whose element a ( i, j) is of value 2i + j, what is the value a(a(1,1) × 2, a(2, 2) + 1)?","answer_label":"19","answer_id":4937},{"id":5945,"question":"There are three different sizes of white balls and three different sizes of green balls. When these six balls are laid out in a line so that the three white balls can be placed in adjacent positions, how many arrangements of all the balls can be made?","answer_label":"144","answer_id":23992},{"id":5954,"question":"When the bubble sort algorithm is used for sorting the dataset (23, 43, 56, 12, 87, 14, 87, 15, 90, 23, 10) in descending order, how many data exchanges occur during the first pass?","answer_label":"8","answer_id":24028},{"id":13772,"question":"For two 8-bit signed integers A and B in 2’s complement format, which of the following will cause an overflow when the addition of A and B is executed?\n\n![](https://learn.viblo.asia/uploads/7/4/748e37d2-6d2d-4bee-98fd-f91e5965a8b2.png)","answer_label":"b","answer_id":53339},{"id":2914,"question":"A regular expression [A-Z]+[0-9]* represents a set of character strings. Which of the following character strings belongs to this set? Here, the regular expression follows the\nrules below. \n\n[A-Z] represents a single uppercase English character.\n[0-9] represents a single decimal digit.\n* indicates zero or more occurrences of the preceding element.\n+ indicates one or more occurrences of the preceding element.","answer_label":"ABCDEF","answer_id":12644},{"id":438,"question":"Which of the following expressions in postfix notation is equivalent to an expression 2+5×3+4 in infix notation? Here, the operator ‘×’ has higher precedence than ‘+’.","answer_label":"2 5 3 × + 4 +","answer_id":5995},{"id":4752,"question":"Which of the following appropriately describes a characteristic of linked lists?","answer_label":"The elements cannot be accessed directly or randomly.","answer_id":19645},{"id":3444,"question":"Which of the following is a self-luminous display that is classified as a kind of light-emitting diode technology?","answer_label":"OLED display","answer_id":14700},{"id":6051,"question":"There are three 7-bit character codes: 30, 3F, and 7A. When an even parity bit is added to the front of each character code, which of the following shows the correct result? Here, the character codes are expressed in hexadecimal.","answer_label":"30, 3F, FA","answer_id":24418},{"id":3438,"question":"There are two one-dimensional arrays A and B of size m and n respectively. Each array contains unique integer values sorted in ascending order. As shown in a sample figure below, these two arrays are merged into a single one-dimensional array C. Which of the following is the appropriate order of the computational complexity of this merge algorithm?\n![](https://learn.viblo.asia/uploads/a/6/a6cd48ac-f67d-4a6c-858e-11abcf64d6e3.png)","answer_label":"O ( m + n )","answer_id":14676},{"id":6361,"question":"There are three stacks A, B, and C where stack A contains the values 1, 2, and 3; 3 is on the top of the stack, and stacks B and C are empty. The stack command format is as follows: \n<stack command> (<stack name>, <temporary variable>) \nWhat is the resulting content of stack A after executing the stack operations shown below? Each rightmost element in the option list represents the value on the top of the stack. \nPop (A, x) → Push (B, x) → Pop (A, x), → Push (C, x) → Pop (A, x) → Push (C, x) → Pop (B, x) → Push (A, x) → Pop (C, x) → Push (B, x) → Pop (C, x) → Push (A, x) → Pop (B, x) → Push (A, x)","answer_label":"3, 2, 1","answer_id":25573},{"id":4753,"question":"There is a two-dimensional array A ( m , n ) with m rows and n columns, and the array in physically contiguous memory addresses is accessed such that rows are stored one after another, in row-major order. Which of the following is the correct memory address of any given element A ( i , j )? Here, both m and n are greater than 0, and the indices i and j range from 1 to m and n respectively. In addition, x is the memory address of the element A (1,1).","answer_label":"x + n × ( i – 1) + ( j – 1)","answer_id":19648},{"id":4741,"question":"When the binary fraction 11101.110 is subtracted from the binary fraction 101101.101, what is the correct result?","answer_label":"1111.111","answer_id":19602},{"id":3225,"question":"In an LED lighting circuit with seven segments and one dot as shown below, when 6D\nin hexadecimal is written out to the output port, which of the following is displayed?\nHere, P7 is the most significant bit, P0 is the least significant bit, and each segment or a\nsmall dot of the LED lights up only when the corresponding bit is 1.\n![](https://learn.viblo.asia/uploads/b/9/b9eeab72-5908-446f-a381-1e92afb48fa9.png)","answer_label":"c","answer_id":13869},{"id":3432,"question":"Which of the following is equivalent to the logical expression “not ( A ⩽ B or C ＜ D )”? Here, A, B, C, and D are variables, and the resulting values of “ A ⩽ B ”\nand “ C ＜ D ” can be either 1 for true or 0 for false.","answer_label":"A ＞ B and C ⩾ D","answer_id":14651},{"id":4279,"question":"Which of the following statements concerning programming languages appropriately describes Java?","answer_label":"It enables the creation of applets and other programs that run in web browsers. The applets can be run on any environment where virtual machines are implemented.","answer_id":17982},{"id":4312,"question":"When the results of the logical operation “x # y” are shown in the table below, which of the following expressions is equivalent to the operation “x # y”? Here, “AND” is used for the logical product, “OR” is for the logical sum, and “NOT” is for the logical negation.\n![](https://learn.viblo.asia/uploads/2/a/2a14d0e1-8da1-40f2-a1d6-7320b271418c.png)","answer_label":"(NOT x) AND (NOT y)","answer_id":18111},{"id":3435,"question":"Among network topologies represented using graphs, which of the following can be regarded as a spanning tree?\n![](https://learn.viblo.asia/uploads/1/b/1bab627f-c747-4907-b5f9-9bab0cd3873b.png)","answer_label":"c","answer_id":14664},{"id":3441,"question":"Which of the following is a method of creating a program that can use the instruction cache effectively?","answer_label":"The frequently executed parts of the program are put together.","answer_id":14686},{"id":3317,"question":"Which of the following is the most appropriate characteristic of XML?","answer_label":"XML can define any tag in order to make it easy to exchange data between\ninformation systems over the network.","answer_id":14202},{"id":1756,"question":"In the binary tree shown below, where is the position for a new node of value 17? Here, each circle represents a node of the tree and the number in the circle represents its value.\n![](https://learn.viblo.asia/uploads/6/f/6f9b03a2-ac43-472a-8122-0e82774394ed.png)","answer_label":"Left child of 18","answer_id":8232},{"id":504,"question":"A vehicle travels along a circle in the figure below. Two sensors L and R are attached to the left and right rear wheels, whose revolution speeds are independently controlled. Sensors L and R are photo reflective sensors, whose values change according to the ratio of black and white regions they pass over. If the ratio increases, the sensor value decreases, and if the ratio decreases, the sensor value increases. Which of the following is an appropriate control for ensuring that the vehicle travels along the black outline of the circle? Here, if the values of the two sensors match, the revolution speeds of the motors return to the initial speed.\n![](https://learn.viblo.asia/uploads/f/9/f95886d1-edda-4b11-a9be-1b1cc9a2ffed.png)","answer_label":"b","answer_id":5583},{"id":3238,"question":"The sales record for salespersons in a certain financial year at a company is shown in the\ntable below. Which of the following is an appropriate SQL statement that retrieves the\nname of the salesperson with average sales of $400,000 or higher for the year from the\n1st quarter (1Q) through the 4th quarter (4Q) and $300,000 or higher in sales for each\nindividual quarter? Here, the unit for the amounts in this table is 1,000 dollars.\n![](https://learn.viblo.asia/uploads/d/6/d64cf6c3-5a21-4c1b-b595-44b4734accec.png)","answer_label":"d","answer_id":13920},{"id":502,"question":"What is the Hamming distance of bit strings 10101 and 11110?","answer_label":"3","answer_id":5592},{"id":6358,"question":"There are n locks and n keys; the keys are mixed and need to specifywhich key belongs to which lock. Which of the following is the maximum number of trials to find the correct key for each lock? Here, one key can open only one lock.","answer_label":"(n^2–n) / 2","answer_id":25561},{"id":508,"question":"The binary search algorithm is used to search for a given item when items are sorted. If the number of items is 1 million, which of the following is the closest to the maximum number of comparisons required to find the item?","answer_label":"20","answer_id":5567},{"id":1854,"question":"Alice and Mary take a math exam. The probability of passing this exam for Alice and Mary is 2/3 and 3/5, respectively. What is the probability that at least one of them will pass the exam?","answer_label":"13/15","answer_id":8626},{"id":5950,"question":"Which of the following is included as an element of a set of character strings represented by a regular expression “[A – Z] + [0 – 9]*”? Here, the regular expression follows the rules described below. \n[A – Z] denotes a single alphabetical letter. \n[0 – 9] denotes a single numeral. \nThe symbol “*” denotes zero or more repetitions of the immediately preceding regular expression. \nThe symbol “+” denotes one or more repetitions of the immediately preceding regular expression.","answer_label":"ABCDEF","answer_id":24014},{"id":3296,"question":"Which of the following is applicable to “ A ” in the comparison table below that shows\nthe characteristics of each production system of continuous production, individual\nproduction, lot production, and process production?\n![](https://learn.viblo.asia/uploads/2/2/22f5eab7-5c63-4d2a-9abc-5ca3b8692952.png)","answer_label":"Individual production","answer_id":14129},{"id":4744,"question":"When multiple values are added arithmetically, it is recommended that the values be added sequentially, starting from the number whose absolute value is the smallest. Which of the following errors can be reduced by means of this method?","answer_label":"Loss of trailing digits","answer_id":19612},{"id":782,"question":"Which of the following is a use case of deep learning to improve the performance of an in-car device?","answer_label":"By the acquisition and processing of numerous images, the driver assistance system can distinguish between a pedestrian and vehicle more reliably.","answer_id":4984},{"id":3608,"question":"When three cards are randomly selected at a time from a standard deck of 52 playing cards, what is the probability that all of these three cards are in the same suit (heart, diamond, spade, or club)?\n![](https://learn.viblo.asia/uploads/c/8/c8e79905-6863-42e6-a247-2261ff13fac0.png)","answer_label":"c","answer_id":15349},{"id":3306,"question":"![](https://learn.viblo.asia/uploads/6/d/6d35cb55-943f-497e-9c91-8d86861b53ed.png)","answer_label":"When at least seven consecutive plots are above or below the center line","answer_id":14166},{"id":4412,"question":"![](https://learn.viblo.asia/uploads/c/8/c81d2390-76be-4b10-a141-1dfdca575160.png)","answer_label":"d","answer_id":18455},{"id":4742,"question":"When a certain natural number x can be represented by a 2n-digit binary number consisting of 1 and 0 arranged alternately, i.e. 1010...10, which of the following equations holds for x?\n![](https://learn.viblo.asia/uploads/2/0/206a9703-aab9-4cc3-8f2f-900da3317a3b.png)","answer_label":"b","answer_id":19604},{"id":4745,"question":"The figure below shows daily changes in the weather for a given district, and each value represents the probability of changes in the following day’s weather. When the weather  is rainy on a given day, what is the probability that the weather is clear two days later?\n![](https://learn.viblo.asia/uploads/d/4/d42c796a-9e3f-4c00-8365-a45b3e1e454e.png)","answer_label":"0.33","answer_id":19618},{"id":6364,"question":"A recursive definition of a factorial function f(n) that calculates “ n ! ” can be represented as follows: \n![](https://learn.viblo.asia/uploads/c/b/cb47ad25-62a0-43cf-bf04-d800378f7f88.png)\nWhich of the following combinations should be inserted in the boxes A and B? Here, “ n ” is a non-negative integer.\n![](https://learn.viblo.asia/uploads/f/e/fef76d77-939a-4147-b2e1-3aaa6e5d6dcc.png)","answer_label":"c","answer_id":25584},{"id":5951,"question":"Which of the following terms is applicable to the binary tree shown below?\n![](https://learn.viblo.asia/uploads/2/4/24892ff0-e596-4281-b617-465c6af651de.png)","answer_label":"AVL tree","answer_id":24015},{"id":6352,"question":"A register stores a numerical value representing a binary number. After a positive integer x is entered in the register, the following operation is performed: “shift the register value two bits to the left and add x.” How many times as large as x is the new value of the register? Here, the shift does not cause an overflow.","answer_label":"5","answer_id":25536},{"id":5949,"question":"A “negative AND” operation “X NAND Y” of X and Y is defined as “NOT (X AND Y)”. Which of the following is the logical expression that represents “X OR Y” by using NAND only?\n![](https://learn.viblo.asia/uploads/5/4/543e36d6-7c8d-4b02-8c48-c23ccba6ef4e.png)","answer_label":"b","answer_id":24008},{"id":2772,"question":"Binary search is used to search for an element from a sorted data of n elements.Which of the following is an expression that represents the order of computational complexity for this process?","answer_label":"log n","answer_id":12087},{"id":6028,"question":"When the series of operations below is performed on an empty stack, which of the following is the data remaining on the stack? Here, “push x” is the operation to save data x to the stack, and “pop” is used to retrieve data from the stack.\n　　　push 1 → push 2 → pop → push 3 → push 4 → pop → push 5 → pop","answer_label":"1 and 3","answer_id":24324},{"id":5077,"question":"When “11” is inserted in the min-heap shown below, which of the following min-heaps is created?    Here, a new node is first placed at the bottom (or last) of the tree, and then it is shifted up to its proper place to maintain the min-heap structure. \n![](https://learn.viblo.asia/uploads/0/e/0e594558-e4cc-4977-9428-824fee5056b1.png)","answer_label":"b","answer_id":20782},{"id":4379,"question":"![](https://learn.viblo.asia/uploads/7/a/7a4fc92d-9ff6-4e8e-8095-22b7bc13d17a.png)","answer_label":"110","answer_id":18366},{"id":505,"question":"What is the result after evaluation of the following postfix expression? Here, symbols +, −, ×, and ÷ represent the arithmetic operators of addition, subtraction, multiplication, and division, respectively.\n5 4 6 + × 493÷ + ×","answer_label":"350","answer_id":5581},{"id":4748,"question":"The decision table shown below is used to determine whether or not an order can be accepted in a sales order processing system. Which of the following logical expressions is equivalent to “Accept order”? Here, “NOT” is used for the logical negation, “AND” for the logical product, and “OR” for the logical sum.\n![](https://learn.viblo.asia/uploads/6/b/6b081d4f-8be2-49a5-85c6-7840eeb8141e.png)","answer_label":"b","answer_id":19628},{"id":1613,"question":"Which of the following is the standard used to describe the look and formatting of markup language documents such as HTML and XHTML?","answer_label":"CSS","answer_id":7580},{"id":6030,"question":"The Fibonacci sequence (0, 1, 1, 2, 3, 5, 8, 13, 21, 34, ...) can be defined recursively as follows: \n![](https://learn.viblo.asia/uploads/1/6/16415f8e-93ab-4bf2-af77-667608562988.png)\nHow many times is the function f(x) called to calculate the Fibonacci number f(5)?","answer_label":"15","answer_id":24335},{"id":4270,"question":"There are two important operations on a stack: PUSH and POP. PUSH adds the new data to the top of the stack leaving previous data below, and POP removes and returns the current top data of the stack. When the operations shown below are sequentially executed, which of the following is the correct combination of the values x and y? Here, the size of the stack is big enough to hold the entire data. “PUSH(a)” inserts the data a into the stack, and “POP(b)” removes the data b from the stack.\n[Operations]\nPUSH (5);\nPUSH (3);\nPUSH (6);\nPUSH (1);\nx = POP ( );\nPUSH (7);\ny = POP ( );","answer_label":"x = 1, y = 7","answer_id":17948},{"id":5151,"question":"Which of the following is the binary fraction that is equivalent to the decimal fraction 115.625?","answer_label":"1110011.101","answer_id":21080},{"id":3201,"question":"Which of the following is the appropriate combination of characteristics of SRAM in\ncomparison with DRAM?\n![](https://learn.viblo.asia/uploads/7/d/7d6d76c5-5235-4de1-9815-2efa0975b98a.png)","answer_label":"c","answer_id":13780},{"id":6050,"question":"Which of the following is equivalent to the logical expression A • B + B • C • (B + C) ? Here, “•” is the logical product, and “+” is the logical sum.","answer_label":"B • (A + C)","answer_id":24415},{"id":5080,"question":"Which of the following is the appropriate description of the “selection sort” algorithm?","answer_label":"The element with the largest value is determined and swapped for the last element, and  then  the  largest  value  of  the  unsorted  elements  is  determined  and  swapped  for  the second-to-the-last element.    This operation is repeated in the same way.","answer_id":20795},{"id":5940,"question":"Which of the following represents the hexadecimal fraction 3A.5C as a decimal fraction?\na) ${\\frac {939} {16}}$\nb) ${\\frac {3735} {64}}$\nc) ${\\frac {14939} {256}}$\nd) ${\\frac {14941} {256}}$","answer_label":"b","answer_id":23972},{"id":4383,"question":"![](https://learn.viblo.asia/uploads/e/c/ec3e71f0-31dc-4fb4-92f6-5e7cc355a1a6.png)","answer_label":"U X W Q Z Y V P","answer_id":18379},{"id":732,"question":"For a given data, the check digit is calculated with the method below and is appended to the original data. When the given data are 7394, what is the result? Here, the weight is 1234 and base number is 11.\n(1) For each digit of the data, calculate the product with the digit at the same radix of the weight; then calculate the sum of the products.\n(2) Calculate the remainder of dividing the sum by the base number.\n(3) Subtract the remainder from the base number; then take the one’s place of the result as\nthe check digit.","answer_label":"73940","answer_id":5182},{"id":4282,"question":"Which of the following is equal to the hexadecimal fraction 2A.4C?\n![](https://learn.viblo.asia/uploads/e/e/eece749f-18ef-46e0-873b-149392ba5910.png)","answer_label":"a","answer_id":17993},{"id":2194,"question":"The half adder in the diagram below adds two (2) single-digit binary numbers x and y,\nand produces z (the first digit of the sum) and c (the carry bit) as output. Which of the\nfollowing is the appropriate combination of gate devices A and B?\n![](https://learn.viblo.asia/uploads/5/8/583eb6e1-d721-40a3-b65c-c4b6dbadf7b4.png)","answer_label":"a","answer_id":9880},{"id":792,"question":"For two sets A and B of cardinalities 3 and 2, how many maps from A to B exist?","answer_label":"8","answer_id":4944},{"id":1855,"question":"What is the distribution of arrival rate in an M/M/1 queuing model","answer_label":"Poisson distribution","answer_id":8630},{"id":1797,"question":"When three apples are removed at random from a box that contains four green apples and eight red apples, what is the probability that the first two apples are green and the third (or last) apple is red? Here, once an apple is removed, it is not put back into the box.","answer_label":"4/55","answer_id":8397},{"id":3439,"question":"Which of the following is the expression that represents the result “x” obtained by the series of three-address instructions below? Here, in a three-address instruction, an instruction using three operands “c = a op b” is represented as “op (a, b, c)”. “op” represents an operator. In the expression that represents the result “x”, priority decreases in order of *, /, +, and -.\n/ (c, d, w1)\n+ (b, w1, w2)\n/ (e, f, w3)\n- (w3, g, w4)\n* (w2, w4, x)","answer_label":"( b + c / d ) * ( e / f - g )","answer_id":14681},{"id":1802,"question":"When the function M(n) is defined as shown below, what is the value of M(97)?\n![](https://learn.viblo.asia/uploads/e/8/e8f0fd93-4dc3-4641-8a03-b9d795faa09f.png)","answer_label":"91","answer_id":8417},{"id":5942,"question":"Which of the following is the appropriate reason why the mantissa is normalized in the floating point representation?","answer_label":"The maximum number of significant digits can be maintained.","answer_id":23980},{"id":3604,"question":"Which of the following expressions can be used to calculate the quarter number (for example, “1” for January through March) for the n-th month of the year? Here, “n” ranges from “1” for January to “12” for December, and each fractional part of the resulting values is truncated.\n![](https://learn.viblo.asia/uploads/3/a/3a5f6a77-d9ea-4c30-83f4-3fb12fc9d0e2.png)","answer_label":"b","answer_id":15332},{"id":452,"question":"Which of the following is an appropriate explanation of optimization in a compiler?","answer_label":"Analyzing the source code and generating an object code with an improved run-time\nprocessing efficiency","answer_id":5960},{"id":5078,"question":"The  figure  below  shows  the  structure  of  a  singly-linked  list.    In  order  to  insert  Philadelphia  between  New  York  and  Washington  DC,  which  of  the  following  is  an  appropriate operation to be performed?    Here,  “null”  indicates the end of the list.\n![](https://learn.viblo.asia/uploads/2/1/21a4d109-d5f9-4ff6-beac-9cd7248ae4ff.png)","answer_label":"The pointers for New York and Philadelphia are set to 110 and 90 respectively.","answer_id":20788},{"id":13778,"question":"Every year that is exactly divisible by four is a leap year, except for years that are exactly divisible by 100, but these centurial years are leap years if they are exactly divisible by 400. For example, the years 1700, 1800, and 1900 are not leap years, but the years 1600 and 2000 are. How many leap years are there between 1895 and 2021?","answer_label":"31","answer_id":53363},{"id":4382,"question":"In the binary tree shown below, which of the following trees is created after conversion into a (max) heap?\n![](https://learn.viblo.asia/uploads/3/c/3c0a28cd-d7f2-48fe-9f06-9d4d64718f1f.png)","answer_label":"b","answer_id":18375},{"id":716,"question":"The flowchart below shows the algorithm of concatenating two character strings in X and Y, with the resulting character string in Z. Which of the following is the appropriate pair of operations to insert in the blanks, A and B? Here, X and Y are character arrays of dimensions m and n, respectively, where the i-th character of each string is stored as the i-th element of the character array.\n\n![](https://learn.viblo.asia/uploads/f/9/f93544e2-305a-4474-8cc3-84a010de92c4.png)","answer_label":"a","answer_id":5242},{"id":5074,"question":"There is a series of project activities to be performed by two staff members, Mr. X and Mr. Y. When each of them works alone, it can be completed by Mr. X in 3 hours and by Mr. Y in 6 hours. When Mr. X starts to work at 9:00 a.m. and then Mr. Y starts to work with Mr. X at 10:00 a.m., which of the following is the time at which all the activities are completed? Here, the activities can be divided and performed in parallel by the two members without any loss of productivity.","answer_label":"11:20 a.m.","answer_id":20771},{"id":6366,"question":"Which of the following is the sorting algorithm that divides the data elements into two groups, in which all those elements less than a particular element (called a pivot value) and all those elements greater than or equal to it are separately included, and then repeats the same operation until all elements are sorted in ascending or descending order?","answer_label":"Quick sort","answer_id":25593},{"id":6058,"question":"The following function f (n, k) exists:\n![](https://learn.viblo.asia/uploads/6/d/6df67b49-6fed-4a5e-9ec6-a805c4f10178.png)\nWhat is the value of f (4, 2)?","answer_label":"6","answer_id":24448},{"id":6045,"question":"Which of the following is the reason why a large number of computer use “complement representation” to simplify arithmetic circuits?","answer_label":"Subtraction can be processed by addition.","answer_id":24396},{"id":4269,"question":"When you flip a coin four times, what is the probability that it will come up heads exactly twice?","answer_label":"0.375","answer_id":17944},{"id":2917,"question":"Which of the following is an explanation of a recursive call?","answer_label":"To allow a function to use itself from within its body","answer_id":12653},{"id":6362,"question":"In a certain examination, the minimum and maximum scores are 31 and 95 respectively. A one-dimensional array shown below is used to display the distribution of scores for all examinees, and each array element indicates the number of examinees whose scores are in the specified ranges. Which of the following is the most appropriate expression to calculate an array index for each score? Here, any digits after the decimal point of the resulting value are truncated to generate an integer as an index.\n![](https://learn.viblo.asia/uploads/8/9/89eeb8ae-c6a9-4d29-b2ee-0458300300eb.png)","answer_label":"(Score–30) / 10 + 1","answer_id":25576},{"id":5157,"question":"Which of the following is an appropriate description concerning a max heap whose node values are 3, 6, 11, 17, 19, 22, and 32?","answer_label":"The root node value is always “32”.","answer_id":21103},{"id":712,"question":"Which of the following is an appropriate explanation of the feedback control?","answer_label":"It performs a control so that the output matches the target.","answer_id":5259},{"id":3303,"question":"As shown in the table below, there are four tours provided by a tour company. The\ntable also shows the expected profit for each tour with accidents or without accidents.\nWhich of the following is the tour that is expected to make the highest profit according\nto the expected value principle?\n![](https://learn.viblo.asia/uploads/6/7/67bd64b0-e554-40b6-aad5-c001b3069c44.png)","answer_label":"Scuba diving","answer_id":14157},{"id":1602,"question":"In order to sort the sequence “98, 12, 4, 56, 34, 23” in ascending order by Bubble Sort algorithm, how many exchange operations are required?","answer_label":"9","answer_id":7537},{"id":3434,"question":"An empty tank can be filled with water in 20 minutes by using Pipe A or in 30 minutes by Pipe B, and the tank filled with water can be emptied of water in 40 minutes by using Pipe C. When the three pipes A, B, and C work together, approximately how long (in minutes) does it take to fill the empty tank with water?","answer_label":"17.1","answer_id":14660},{"id":4271,"question":"Reverse Polish Notation (RPN) is used to represent arithmetic expressions without using brackets to define priorities for evaluation of operators. For example, $3\\times (a+b)$ becomes $3ab+\\times$ in RPN. Which of the following is the best data structure that should be used for implementation of RPN in a computer?","answer_label":"Stack","answer_id":17953},{"id":6365,"question":"A binary search tree is created by inserting the values shown below. \n7     9     11     2     8     10     5     3 \nAfter deletion of the root from the newly created tree, what does it look like?\n![](https://learn.viblo.asia/uploads/e/d/edde2db8-7d19-41be-82fe-fd15decd179b.png)","answer_label":"d","answer_id":25589},{"id":4263,"question":"Which of the following is the correct decimal fraction equal to hexadecimal fraction 0.248?","answer_label":"73/512","answer_id":17922},{"id":6351,"question":"Which of the following decimal fractions becomes a finite fraction when converted to an octal number?","answer_label":"0.5","answer_id":25532},{"id":2770,"question":"A leap year is either a multiple of 4 but not a multiple of 100, or a multiple of 400. How many leap years are there from 1998 to 2110?","answer_label":"27","answer_id":12080},{"id":3610,"question":"Which of the following is an appropriate description concerning a binary search tree whose node values are 17, 6, 19, 3, 22, and 32?","answer_label":"No matter which value is placed at the root node, “3” cannot have a left child.","answer_id":15356},{"id":2170,"question":"There is a register where an integer value is stored in binary. Let x be a positive integer\nwhich is stored into the register, then perform the operations below.\n(1) Shift the content of the register to the left by 2 bits\n(2) Add x to the register.\nHow many times larger than the integer x is the content of the register?","answer_label":"5","answer_id":9801},{"id":5941,"question":"Which of the following hexadecimal numbers, representing signed 16-bit binary numbers, results in overflow when multiplied by 4? Here, a negative number is represented in 2’s complement.","answer_label":"DFFF","answer_id":23976},{"id":804,"question":"The methods for representing the results of syntactic analysis in a compiler include quadruplet format.\n(Operator, Operand 1, Operand 2, Result)\nThis format indicates that the application of the operator to operand 1 and operand 2 outputs the result. For which of the following expressions does the series of quadruplets below represent the syntactic analysis? Here, T1, T2, and T3 indicate temporary variables.\n\n(*,B,C,T1 )\n(/,T1 ,D,T2 )\n(+,A,T2 ,T3 )","answer_label":"A+B*C/D","answer_id":4894},{"id":3313,"question":"A chemical manufacturer has a plan to deliver 500 liters of a 24% acid solution.\nHowever, the manufacturer has only two types of acid solutions available in its stock,\nwhich are 40% (Type A) and 20% (Type B). How many liters of each acid solution\nmust be mixed to make 500 liters of a 24% acid solution? UNIT: liter","answer_label":"Type A: 100, Type B: 400","answer_id":14186},{"id":1798,"question":"For a balanced binary search tree, which of the following is the asymptotic time complexity of the search operation for a set of “n2n” data elements? Here, “O( )” denotes the order of the algorithm’s running time, and “n ” is sufficiently large.\n![](https://learn.viblo.asia/uploads/2/b/2b94f266-174a-41cf-bb7c-95f1a2dc9788.png)","answer_label":"a","answer_id":8399},{"id":4399,"question":"![](https://learn.viblo.asia/uploads/7/d/7d96f86b-e462-4ae4-8263-64f1784641ba.png)","answer_label":"d","answer_id":18426},{"id":2174,"question":"When three sets A, B and C are given, which of the following equalities holds? Here,  ∪\nand ∩  are union and intersection symbols, respectively.","answer_label":"(A∩C)∪(B∩C) = (A∪B)∩C","answer_id":9816},{"id":4390,"question":"![](https://learn.viblo.asia/uploads/1/a/1afaf29d-6349-428c-a325-bed5d7b55ad8.png)","answer_label":"b","answer_id":18398},{"id":2180,"question":"Which of the following bit strings is accepted by the automaton described in the state\ntransition diagram below? Here, each string is processed one bit at a time in sequence from\nthe left.\n![](https://learn.viblo.asia/uploads/8/5/854bb0a1-98aa-4d51-a48b-cc5af7128a01.png)","answer_label":"1010","answer_id":9837},{"id":1758,"question":"A recursive function f (n) is defined as follows for any natural number n. What is the value f (5)?","answer_label":"15","answer_id":8241},{"id":453,"question":"Which of the following is a logic gate combination that provides an output 1 when both inputs are 0?","answer_label":"NOR or XNOR","answer_id":5966},{"id":4278,"question":"Integers are stored in the 1st to N-th elements of an array A (N > 1). The flowchart below shows the process to check which element of the array contains the same value as X. Which of the following correctly describes the execution result of this process?\n![](https://learn.viblo.asia/uploads/b/6/b6dee3e2-c13c-463f-b153-4ad3fb82240c.png)","answer_label":"If the same value as X exists in two places of the array, the 1st and N-th elements, k is set to 1.","answer_id":17978},{"id":2767,"question":"If a given bit string contains at least one 1-bit, the algorithm below leaves the rightmost 1-bit unchanged but makes all the others 0. For example, if the given bit string is 00101000, the result will be 00001000. Which of the following is the appropriate logical peration to be filled in D?\nStep 1: By regarding the given bit string A as an unsigned binary number, let B be the result of subtracting 1 from A.\nStep 2: Calculate the XOR (exclusive logical sum) of A and B, and let C be the result.\nStep 3: Calculate the ![](https://learn.viblo.asia/uploads/a/d/adf5a3db-5be1-4286-b76e-2239efca27bc.png) of A and C, then set the result back to A.","answer_label":"AND (logical product)","answer_id":12067},{"id":713,"question":"Which of the following is a binary search tree?\n\n![](https://learn.viblo.asia/uploads/4/b/4bf46fb7-5dc2-404e-8d61-91f3287a7409.png)","answer_label":"b","answer_id":5255},{"id":6360,"question":"Which of the following Boolean expressions is equivalent to the sentence below? \n“The output z is true if at least two of the three inputs x1, x2, and x3 are true.” \nHere, “$\\overline{x}_n$” is used for the logical negation of $x_n$, “+” for the logical sum, “.” for the logical product, and “⊕” for the exclusive disjunction (or exclusive OR).\n![](https://learn.viblo.asia/uploads/9/6/9626cfff-c305-4edb-af11-5ad26d0373e4.png)","answer_label":"d","answer_id":25569},{"id":2183,"question":"Which of the following is a binary search tree whose keys are numbers assigned to nodes in\nnatural order?\n![](https://learn.viblo.asia/uploads/e/d/ed8b8ff0-5858-4d06-8d24-05f60b4ac067.png)","answer_label":"b","answer_id":9848},{"id":4583,"question":"There are five different sizes of white balls and five different sizes of green balls.\nWhen these ten balls are laid out in a line so that adjacent balls can have different\ncolors, how many arrangements of the balls can be made?","answer_label":"28,800","answer_id":19049},{"id":6092,"question":"Which of the following is the appropriate statement concerning how to illustrate data flows (arrows) in DFD?","answer_label":"d) Each process must have at least one data flow in and one data flow out.","answer_id":24585},{"id":3170,"question":"Which of the following is the graph that is represented by the adjacency matrix A shown\nbelow? Here, an adjacency matrix is an n × n matrix in which both the element of row\ni and column j and another element of row j and column i become “1” when an edge\njoining the vertices V i and V j of a graph consisting of the “n ” number of vertices is\npresent, and “0” when the edge is not present.\n![](https://learn.viblo.asia/uploads/8/2/82139b5c-690e-45c6-b717-02af09845714.png)","answer_label":"d","answer_id":13674},{"id":6052,"question":"Which of the following data structures uses the LIFO (Last In First Out) method in order to manage data?","answer_label":"Stack","answer_id":24424},{"id":3436,"question":"There is a two-dimensional array A with ten rows and ten columns. Each element in the array is two bytes long and is stored sequentially in memory in the customary “horizontal row first and vertical column second” order. When the first element A(1,1) is stored in memory address 500 that is represented in hexadecimal, what is the memory address of A(3,5) in hexadecimal?","answer_label":"530","answer_id":14667},{"id":2776,"question":"Which of the following is classified as an internal interrupt?","answer_label":"An interrupt because of the operation of division by zero (0)","answer_id":12104},{"id":710,"question":"How many four-digit decimal numbers are made from four (4) different digits between 0 and 9? Here, a four-digit decimal number has a non-zero leading digit.","answer_label":"4536","answer_id":5268},{"id":4265,"question":"In a floating-point number format, which of the following is the correct operation for adjusting the radix point and the exponent so that the most significant digit of the mantissa can be a non-zero value? Here, an absolute value is used for the mantissa.","answer_label":"Normalize","answer_id":17928},{"id":714,"question":"When the procedure described below is executed in sequence for an empty stack and empty queue, what is the value assigned to variable x? Here, the functions used in the procedure are defined as follows:\n(Function definitions)\npush(y): pushes data y onto the top of the stack.\npop(): removes the data from the top of the stack and returns it as the function value. enq(y): inserts data y at the tail of the queue.\ndeq(): removes the data from the head of the queue and returns it as the function value.\n\n(Procedure)\n\t\t\tpush(a)\n\t\t\tpush(b)\n\t\t\tenq(pop())\n\t\t\tenq(c)\n\t\t\tpush(d)\n\t\t\tpush(deq())\n\t\t\tx ← pop()","answer_label":"b","answer_id":5251},{"id":3210,"question":"Which of the following is the appropriate combination of indexes or indicators\nconcerning RAS (Reliability, Availability, and Serviceability)?\n![](https://learn.viblo.asia/uploads/f/f/ff3c41b7-0eb0-457a-970b-12903879b263.png)","answer_label":"b","answer_id":13813},{"id":2915,"question":"Data A, B, C and D are entered as an input sequence. Which of the following is a possible output sequence by only using a single stack?","answer_label":"C, B, D, A","answer_id":12647},{"id":6298,"question":"![](https://learn.viblo.asia/uploads/e/9/e9b3c2c9-934b-40fc-b434-22a18e1dd57d.png)","answer_label":"d","answer_id":25344},{"id":3217,"question":"A certain computer system runs in a multi-programming environment using a\nnon-preemptive “shortest job first” algorithm. In this system, when four CPU-bound\njobs P 1 through P 4 arrive at the job queue as shown in the table below, what is the\naverage waiting time (in minutes) of the four jobs in the queue? Here, the job queue is\nempty at the beginning, so the first job can be executed immediately after its arrival.\n![](https://learn.viblo.asia/uploads/3/c/3c2c7036-17e0-40b5-abc2-128dad3d5cb3.png)","answer_label":"4.0","answer_id":13836},{"id":6354,"question":"In the single precision of “IEEE Standard for Binary Floating-Point Arithmetic” (IEEE 754), the value “V ” is represented as follows: \n![](https://learn.viblo.asia/uploads/7/f/7fba8576-5ac3-4cda-9659-26864924ba38.png)\nwhere “1.F ” is intended to represent the binary number created by prefixing F with an implicit leading 1 and a binary point. \nWhen the hexadecimal value C1E00000 is represented in IEEE 754, what is the correct value converted to decimal?","answer_label":"–28","answer_id":25544},{"id":2769,"question":"When two unbiased dice are rolled one by one, what is the probability that either the first one is 2 or the sum of the two is less than 5?","answer_label":"5/18","answer_id":12077},{"id":5952,"question":"In a unidirectional list shown below, $Blue$ is the top of the list, and its pointer indicates the next data address 110. In addition, $Yellow$ is the end of the list, and its pointer is 0. Which of the following operations can replace $Green$ with $Red$ in the list?\n![](https://learn.viblo.asia/uploads/6/3/63200281-50bf-4c1e-9af1-84a676cf28aa.png)","answer_label":"Set the pointers of *Red* and *Blue* to 100 and 140 respectively.","answer_id":24019},{"id":5948,"question":"As shown in the truth table below, when an output signal is generated using three input signals A, B, and C, which of the following Boolean expressions can be applied to the output signal? Here, “$\\bigcap$” stands for the logical product, “$\\bigcup$\" for the logical sum, and “$\\overline{X}$” for the logical negation of “$X$”.\n![](https://learn.viblo.asia/uploads/f/3/f3ef1369-9a35-4054-a55f-46757295f84b.png)","answer_label":"b","answer_id":24004},{"id":4276,"question":"The “prime number division remainder” method is a well-known hashing algorithm. In this method, a key value is divided by a number N, and the remainder which is also called a hash value is used directly as an index into the hash table. N is the largest prime number less than or equal to the size of the available addressable spaces. When the 20 addressable spaces are available, which of the following is the correct hash value calculated from the key value 136? Here, a prime number is one that cannot be divided evenly by any other number except one (1). 2, 3, 5, 7, 11, and 13 are the first few prime numbers.","answer_label":"3","answer_id":17972},{"id":711,"question":"What is the value of the postfix expression below when variables A, B, C, and D have values 4, 3, 5, and 6, respectively? Here, symbols ‘+’, ‘-’, ‘x’, and ‘÷’ represent the arithmetic operators of addition, subtraction, multiplication, and division, respectively.\nA B 2 x + D B ÷ C x -","answer_label":"0","answer_id":5263},{"id":6059,"question":"Which of the following logic circuits generates the same output as the logic circuit\nshown in the figure below? Here ![](https://learn.viblo.asia/uploads/c/e/cefdbf61-bf76-4557-bdaf-a7db5b972f69.png)\nand represent the logical product, the logical sum, and the logical negation respectively.\n![](https://learn.viblo.asia/uploads/4/c/4c84eeef-4dc3-4298-b5d1-66929b484dae.png)","answer_label":"4","answer_id":24450},{"id":6294,"question":"![](https://learn.viblo.asia/uploads/1/c/1c9c7149-d40b-4fd7-b53e-a856df17dc22.png)","answer_label":"2","answer_id":25327},{"id":13773,"question":"What is the probability of getting at least two heads when a fair coin is flipped five times?","answer_label":"0.8125","answer_id":53343},{"id":6355,"question":"There are a total of N values observed. The sum S (S> 0) of these values is obtained, and then the average value is calculated. Which of the following is the correct expression when the average value is rounded off to the nearest integer value? Here, “/ ” indicates division, and [X] is the maximum integer equal to X or less.","answer_label":"[S/N+ 0.5 ]","answer_id":25548},{"id":2186,"question":"What is the result of the procedure in the flowchart below, when x and y are positive\nintegers?\n![](https://learn.viblo.asia/uploads/f/3/f3fab9cb-45b3-4bed-9e34-2dccc9976c7a.png)","answer_label":"b","answer_id":9858},{"id":3312,"question":"When two logical variables “p” and “q” are given, which of the following is a logical\nexpression that is equivalent to the XOR (exclusive OR) operation? Here, “∨”, “∧”,\nand “¬” represent the logical “OR”, “AND”, and “NOT” operations respectively.","answer_label":"(p ∨ q) ∧ ¬ (p ∧ q)","answer_id":14183},{"id":3292,"question":"As shown in the tables below, the 5-year investment effects of IT investment plans A\nthrough D are evaluated on the basis of ROI (Return on Investment). Which of the\nfollowing has the highest effect? Here, the internal rate of return (IRR) is 0, and ROI\nis calculated by dividing the total profit for the period by the amount of investment.\n![](https://learn.viblo.asia/uploads/b/5/b55329e3-b7d6-4577-b1a3-4beeb2875104.png)","answer_label":"A","answer_id":14113},{"id":5953,"question":"In the graph shown below, which of the following is an appropriate description concerning the shortest path from the node “A” to another node? Here, the number shown beside the line indicates the distance between the two adjacent nodes.\n![](https://learn.viblo.asia/uploads/d/8/d89d0e36-312d-4061-811c-e33e73b49745.png)","answer_label":"The shortest distance from A to F is 9.","answer_id":24026},{"id":5155,"question":"When the expression ![](https://learn.viblo.asia/uploads/6/b/6b527bf1-113d-40b9-97e5-fc75f5125d86.png) in conventional infix notation is converted to the prefix expression, which of the following represents the resulting expression? \n![](https://learn.viblo.asia/uploads/5/7/5717d419-be00-47fb-ba6c-e828eef588f8.png)","answer_label":"d","answer_id":21096},{"id":2195,"question":"Which of the following is equivalent to the logic circuit shown below?\n![](https://learn.viblo.asia/uploads/0/5/05ebca0e-5758-4e34-827b-64c66fa7e3c8.png)","answer_label":"c","answer_id":9886},{"id":6025,"question":"As shown in the figure below, there is a binary tree which is created in accordance with a specific rule that the value of a parent node is greater than that of a child element. \n![](https://learn.viblo.asia/uploads/d/3/d39e0277-7748-49cc-acd1-17ec74a7ea03.png)\nWhen a new element with the value 12 is inserted in the places marked by A, B, C, or Din the tree according to the steps defined below, where should it be inserted in order to maintain the specific rule and minimize the number of exchanges? \n[Steps] \n1. Add the element to a leaf node of the tree. \n2. Compare the added element with its parent; if the result is in the correct order, stop. If not, go to Step 3. \n3. Exchange the element for its parent and return to Step 2.","answer_label":"D","answer_id":24315},{"id":2919,"question":"Which of the following is a special purpose register that stores the result of a comparison or the sign of the result of an arithmetic operation?","answer_label":"Flags register","answer_id":12662},{"id":439,"question":"Analog audio data is being sampled and converted to 8-bit digital audio data using the PCM method, then transmitted in 64,000 bits per second. What is the sampling interval in microseconds?","answer_label":"125","answer_id":5998},{"id":6041,"question":"What range of decimal numbers can be represented with an 11-bit two’s complement number?","answer_label":"-1024 to 1023","answer_id":24379},{"id":2775,"question":"Which of the following is the addressing method that references data in the main memory as shown in the figure below?\n![](https://learn.viblo.asia/uploads/8/c/8cb1370c-37f4-479c-830f-0e73fc1171c7.png)","answer_label":"Indirect addressing","answer_id":12101},{"id":2910,"question":"Which of the following is a logical expression equivalent to the exclusive-OR operation\nof logical variables p and q? Here, “∨”, “∧”, and “¬” are OR, AND, and NOT operators,\nrespectively .","answer_label":"(p ∨ q) ∧ ¬(p ∧ q)","answer_id":12626},{"id":2777,"question":"ECC is used for error detection and correction in memory. If n + 2 redundant bits are required for a data bus with a width of 2 bits, how many redundant bits are required for a data bus with a width of 128 bits?","answer_label":"9","answer_id":12109},{"id":503,"question":"A candy box contains four flavors of candies: 6 lemon-flavored, 12 strawberry-flavored, 8 orange-flavored, and 4 grape-flavored. When a candy is randomly chosen from the box, what is the probability that it is either lemon- or orange-flavored?","answer_label":"7/15","answer_id":5587},{"id":6047,"question":"There is a four-digit number $N_1N_2N_3C$ that is used for Customer Account Number (CAN). The right most digit “C” can be calculated as follows:\n\n$$C = (N_1*3 + N_2*5 + N_3*7) \\bmod 10$$\n\nWhich of the following is a correct CAN? Here, x mod y returns the remainder when x is divided by y.","answer_label":"9690","answer_id":24403},{"id":4755,"question":"When a program (or a function) calls itself recursively, which of the following data structures is suitable for storing the data that is currently used in the program?","answer_label":"Stack","answer_id":19656},{"id":440,"question":"When Bubble sort algorithm is used, how many exchange operations are required to sort the following numbers in ascending order? 9, 2, 13, 21, 3, 0","answer_label":"9","answer_id":6002},{"id":3611,"question":"In a binary tree,\n• any node that has two null children is called a leaf node, and\n• the other nodes except leaf nodes have one or two non-null children.\nWhen the number of nodes including leaf nodes is n , how many null children are included in the binary tree?","answer_label":"n + 1","answer_id":15362},{"id":4581,"question":"In a certain program, in order to stay in a loop, variable X must be in the range from 1\nthrough 10 (X >= 1 AND X <= 10). In this program, which of the following is the\ncondition of exiting the loop? Here, “AND” and “OR” are the logical product and\nlogical sum operations respectively. In addition, comparison operators <, <=, >, and\n>= are less than, less than or equal to, greater than, and greater than or equal to,\nrespectively.","answer_label":"X < 1 OR X > 10","answer_id":19042},{"id":2028,"question":"What is the value of the arithmetic expression resulting from an in-order traversal of the binary tree below?\n\n![](https://learn.viblo.asia/uploads/0/3/038c90ac-cdf2-4f9a-b159-d47418b191df.png)","answer_label":"20","answer_id":9271},{"id":3612,"question":"Which of the following data structures can be referred to as a “last-in first-out” operation?","answer_label":"Stack","answer_id":15366},{"id":2916,"question":"For integers x and y (x > y ≥ 0), a function F(x, y) is defined as follows. What is the value F(231, 15)? Here, x mod y represents the remainder after division of x by y.\n![](https://learn.viblo.asia/uploads/f/0/f0628828-0f92-4b74-82aa-6ac175665197.png)","answer_label":"3","answer_id":12650},{"id":3823,"question":"Which of the following is a mechanism that is used for defining the style of a Web page?","answer_label":"CSS","answer_id":16180},{"id":1803,"question":"As shown in the table below, there are five items A through E. Each item cannot be divided into smaller pieces. When a knapsack with a maximum volume of 7 units is available for carrying the items, which of the following is a set of items to be packed in the knapsack so that the total price can be maximized?\n![](https://learn.viblo.asia/uploads/5/3/537e79ce-57b1-456a-b2c4-43ffdecade58.png)","answer_label":"B,E","answer_id":8421},{"id":1796,"question":"Which of the following is the appropriate binary fraction that is equivalent to the decimal value 5.525? Here, the binary string enclosed in parentheses is repeated infinitely.","answer_label":"101.100(0011)","answer_id":8394}]