[{"id":13848,"question":"Với một số nhị phân 8-bit, phương án nào sau đây sẽ biến đổi 4 bit ở giữa thành 1 và đảo ngược các bit còn lại?","answer_label":"Thực hiện phép NAND trên từng bit với 11000011","answer_id":53643},{"id":13327,"question":"Lựa chọn nào sau đây là lời giải cho biểu thức logic với biến X bên dưới? Ở đây, A, B và C là các hằng số logic; các toán tử “+”, “∙”, và “¯” biểu thị tương ứng OR logic, AND logic, và NEGATION.\n![](https://learn.viblo.asia/uploads/c/a/ca5adfde-024e-4e2f-aa63-598435be1171.jpg)","answer_label":"![](https://learn.viblo.asia/uploads/3/a/3ae04185-a36d-48ba-b85a-011421fe5bc7.jpg)","answer_id":51564},{"id":13438,"question":"Lựa chọn nào sau đây là cây tìm kiếm nhị phân có các khóa được gán cho các nút theo thứ tự tự nhiên?","answer_label":"![](https://learn.viblo.asia/uploads/2/3/234ea6eb-3aa2-499c-8e53-7c5d87073b86.jpg)","answer_id":52003},{"id":13436,"question":"Đối với hai biến logic X và Y, phép toán logic X NAND Y được định nghĩa là một phép toán tổng hợp NOT (X AND Y). Câu nào sau đây tương đương với phép toán logic X OR Y?","answer_label":"(X NAND X) NAND (Y NAND Y)","answer_id":51995},{"id":13851,"question":"Khi hai tập hợp A và B có lực lượng 3 và 2, có bao nhiêu ánh xạ từ A sang B?","answer_label":"6","answer_id":53656},{"id":13435,"question":"![](https://learn.viblo.asia/uploads/1/c/1c0fb16d-1713-44d5-a357-2cb7b7969e86.jpg)","answer_label":"![](https://learn.viblo.asia/uploads/9/9/99002dad-9fdb-4f3b-9757-b389bd0eb4b3.jpg)","answer_id":51993},{"id":13852,"question":"Biểu thức dưới đây được ghi bằng ký hiệu tiền tố (ký pháp Ba Lan đảo ngược). Đâu là giá trị của biểu thức?  Ở đây, các số được biểu diễn trong hệ thập phân, các ký hiệu ‘+’, ‘−’, ‘*’, và ‘/’ biểu diễn phép công, trừ, nhân và chia.\n\n    100 5 6 2 + * 12 4 / − − 36 −","answer_label":"27","answer_id":53660},{"id":13440,"question":"Hàm F(n) là một hàm số nguyên được định nghĩa đệ quy để tính toán giai thừa của n cho bất kỳ số nguyên âm không n. Đáp án nào sau đây là một biểu thức thích hợp cho khoảng trắng A?\n![](https://learn.viblo.asia/uploads/c/8/c863db3f-3b0a-42d6-8b38-fe22105ba04a.jpg)","answer_label":"n × F(n - 1)","answer_id":52012},{"id":13439,"question":"Có một mảng số nguyên hai chiều A có phần tử (i, j) A[i, j] là 2 × i + j. Giá trị của phần tử     A[A[1, 1] × 2, A[2, 2] + 1] là gì?","answer_label":"19","answer_id":52009},{"id":13849,"question":"Phương án nào dưới đây tương ứng logic với biểu thức sau? Ở đây A, B, C, và D là các số nguyên, ‘<’ là phép so sánh nhỏ hơn, và ‘≤’ là phép so sánh nhỏ hơn hoặc bằng.\n\nnot ((A ≤ B) or (C < D))","answer_label":"(B < A) and (D ≤ C)","answer_id":53648},{"id":13855,"question":"Với một mảng số nguyên hai chiều a, với a(i, j) có giá trị 2i + j, phương án nào là giá trị của a(a(1,1) × 2, a(2, 2) + 1)?","answer_label":"15","answer_id":53673},{"id":13850,"question":"Có 16 tấm thẻ được đánh số từ 1 đến 16. Khi lựa chọn ra 4 tấm thẻ bất kỳ, phương án nào dưới đây là xác suất để cả 4 tấm thẻ là số lẻ?","answer_label":"1/26","answer_id":53650},{"id":13854,"question":"Phương án nào dưới đây là kết quả của lưu đồ thuật toán phía dưới?\n![](https://learn.viblo.asia/uploads/7/3/73182557-6486-4860-9476-949295267ed6.png)","answer_label":"10  8  6  4  2  0","answer_id":53668},{"id":13335,"question":"Để các lưu đồ dưới đây là tương đương, sự kết hợp nào sau đây là thích hợp với các nhãn A và B? Ở đây, biểu thị phủ định của P.\n![](https://learn.viblo.asia/uploads/9/0/901b3dfc-f20f-4d8c-93f4-cc9fe7cb566c.jpg)","answer_label":"![](https://learn.viblo.asia/uploads/7/5/75cccb3f-c64b-402d-9e0b-3a1f2269604c.jpg)","answer_id":51594},{"id":13853,"question":"Trong cây nhị phân phía dưới, đâu là vị trí của nút mới có giá trị 17? Ở đây, mỗi vòng tròn biểu hiện một nút của cây và con số bên trong biểu thị giá trị của chúng.\n![](https://learn.viblo.asia/uploads/6/f/6f9b03a2-ac43-472a-8122-0e82774394ed.png)","answer_label":"Nút con bên trái của 18","answer_id":53663},{"id":13328,"question":"Alice và Mary có một buổi thi toán. Xác suất đỗ tương ứng của Alice và Mary là 2/3 và 3/5. Đâu là xác suất để ít nhất một trong hai người đỗ?","answer_label":"13/15","answer_id":51568},{"id":13324,"question":"Một thanh ghi lưu một giá trị số nguyên dưới dạng nhị phân. Cho x là số nguyên dương được lưu trữ trong thanh ghi, sau đó thực hiện các phép toán dưới đây.\n\n(1) Dịch chuyển nội dung của thanh ghi sang bên trái 2 bit\n\n(2) Cộng x vào thanh ghi\n\nGiá trị của thanh ghi lớn hơn bao nhiêu lần so với số nguyên x?","answer_label":"5","answer_id":51551},{"id":13334,"question":"Đặc trưng của kiểu dữ liệu danh sách thường được biểu diễn theo hai cách là bằng mảng hoặc bằng con trỏ. Lựa chọn nào sau đây mô tả một đặc điểm của cách biểu diễn bằng mảng?","answer_label":"Bất kể số lượng thực sự các phần tử có trong danh sách, sẽ có một vài khoảng trống không được sử dụng mặc dù các khoảng trống này đã được cấp phát tối đa cho các phần tử","answer_id":51593},{"id":13326,"question":"Lựa chọn nào sau đây là giá trị thập phân tương đương với phân số thập lục phân 0.B1?!","answer_label":"![](https://learn.viblo.asia/uploads/1/1/11e26150-9030-4e80-983c-2942d1e25543.jpg)","answer_id":51560},{"id":13330,"question":"Với phiên bản ngẫu nhiên của thuật toán sắp xếp nhanh, ở đó phần tử chốt được chọn ngẫu nhiên, lựa chọn nào sau đây cho biết các độ phức tạp trung bình và xấu nhất? Ở đây O( ) được dùng để biểu thị thứ tự của mức độ phức tạp.","answer_label":"![](https://learn.viblo.asia/uploads/3/d/3d2f77ff-e068-4a17-99f3-421e16ad736b.jpg)","answer_id":51574},{"id":13856,"question":"Một hàm đệ quy f (n) được định nghĩa phía dưới cho mọi số tự nhiên n. Phương án nào là giá trị của f (5)?\n![](https://learn.viblo.asia/uploads/e/1/e1302a80-94f6-4b82-999a-734ae32bff85.png)","answer_label":"15","answer_id":53676},{"id":13342,"question":"Giá trị nào là kết quả biểu thức toán học của việc duyệt trung-thứ-tự cây nhị phân bên dưới?\n![](https://learn.viblo.asia/uploads/a/e/ae4beb94-588d-44c7-b6d6-8dcb4387d5f3.jpg)","answer_label":"20","answer_id":51619},{"id":13333,"question":"Cho A là một mảng số nguyên kích thước 10, có phần tử thứ i được biểu diễn bởi A[i] với i=0 cho tới 9, và giá trị khởi tạo của mảng là 0. Đối với một số nguyên dương k, các luật bên dưới xác định phần tử lưu giá trị k. Khi các số nguyên 16, 43, 73, 24, và 85 được xử lý theo thứ tự này, giá trị cuối cùng 85 được lưu trong phần \r\ntử nào? Ở đây, x mod y là phần dư sau khi chia x cho y.\r\n[Các luật]\r\n(1) Nếu A[k mod 10] = 0, thì lưu k trong A[k mod 10].\r\n(2) Ngược lại, nếu A[(k + 1) mod 10] = 0, thì lưu k trong A[(k + 1) mod 10].\r\n(3) Ngược lại, Nếu A[(k + 4) mod 10] = 0, thì lưu k trong A[(k + 4) mod 10].\r\n(4) Ngược lại, loại bỏ k.","answer_label":"A[9]","answer_id":51589},{"id":13329,"question":"Tần suất tới trong mô hình hàng đợi M/M/1 là phân bố gì?","answer_label":"Phân bố Poisson","answer_id":51572},{"id":13332,"question":"Có một ngôn ngữ được định nghĩa bởi ngữ pháp phi-ngữ cảnh với các luật sinh như sau: \n![](https://learn.viblo.asia/uploads/a/d/ad47b73a-dc37-4c9d-9470-dc2f829d8873.jpg)\nTrong ngữ pháp này, các ký hiệu chưa kết thúc là E, T, F, và C; các ký hiệu kết thúc là dấu ngoặc, dấu cộng, dấu hoa thị, và các số; E là dấu hiệu bắt đầu. Lựa chọn nào sau đây cho biết rằng biểu thức 7 + 3 * (6 + 4) là một câu của ngôn ngữ này.","answer_label":"![](https://learn.viblo.asia/uploads/c/6/c6b0646f-e4c3-4ec8-8436-64196e174893.jpg)","answer_id":51582},{"id":13441,"question":"Kết quả của thủ tục trong biểu đồ luồng dưới đây là gì, biết rằng x và y là số nguyên dương?\n![](https://learn.viblo.asia/uploads/b/a/ba4adb39-a2a8-472b-9ec0-a3efe09610a9.jpg)","answer_label":"Giá trị của s: Thương của x ÷ y\n\nGiá trị của t: Số dư của x ÷ y","answer_id":52015},{"id":13437,"question":"Chuỗi bit nào dưới đây được chấp nhận bởi máy tự động được mô tả trong sơ đồ chuyển trạng thái dưới đây? Ở đây, mỗi chuỗi được xử lý mỗi lần một bit theo thứ tự từ bên trái.\n![](https://learn.viblo.asia/uploads/0/f/0ff32049-e45f-49c8-9266-eda336ff39f5.jpg)","answer_label":"1010","answer_id":52000}]