[{"id":13912,"question":"Lựa chọn nào sau đây là một lời giải thích thích hợp của EMS?","answer_label":"Nó đề cập đến việc sản xuất các thiết bị điện tử,... theo hợp đồng do các nhà sản xuất khác đặt hàng.","answer_id":53900},{"id":13559,"question":"Lựa chọn nào sau đây giải thích về năng lực cốt lõi?","answer_label":"Khả năng vượt trội mà không thể bắt chước bởi các đối thủ cạnh tranh trong một lĩnh vực hoạt động của công ty","answer_id":52488},{"id":13910,"question":"Lựa chọn nào sau đây là một kịch bản thông dụng để áp dụng UML, một kỹ thuật để trực quan hóa các quy trình nghiệp vụ?","answer_label":"Để thể hiện các quy trình theo nhiều quan điểm, một số phương pháp mô hình hóa theo mục đích cụ thể được sử dụng, và mỗi mô hình được mô tả bằng cách sử dụng quy tắc ký hiệu tiêu chuẩn cho việc mô hình hóa đối tượng.","answer_id":53892},{"id":13913,"question":"Lựa chọn nào sau đây là giải thích về mua sắm xanh?","answer_label":"Nó không chỉ đề cập đến việc thực hiện các yêu cầu về chất lượng và giá cả, mà còn về việc mua ưu đãi các sản phẩm và dịch vụ ít gây tổn hại tới môi trường của các công ty làm việc hướng tới việc giảm gánh nặng về môi trường.","answer_id":53902},{"id":13526,"question":"Lựa chọn nào sau đây là phương pháp thiết lập giá dựa trên việc định giá cộng thêm vào chi phí?","answer_label":"Trên cơ sở chi phí sản xuất và chi phí vận hành, giá cả được thiết lập bằng cách kết hợp biên lợi nhuận mong muốn.","answer_id":52355},{"id":13524,"question":"Lựa chọn nào sau đây là một lời giải thích hợp lý về sản phẩm dấu hỏi (?) trong ma trận quản lý danh mục sản phẩm (PPM)?","answer_label":"Nó cần đầu tư đáng kể để nuôi dưỡng do tỷ lệ thị phần nhỏ và tốc độ tăng trưởng thị trường cao","answer_id":52348},{"id":13919,"question":"Lựa chọn nào sau đây là giải thích về kỹ thuật benchmarking được sử dụng để quản lý doanh nghiệp?","answer_label":"Nó đề cập tới sự hiểu biết về mặt định lượng và chất lượng các sản phẩm, dịch vụ và hoạt động của công ty qua so sánh những điều đó với những đối thủ cạnh tranh hoặc các công ty tiên tiến.","answer_id":53926},{"id":13558,"question":"Lựa chọn nào sau đây là mục đích phân tích kế hoạch kinh doanh và lợi thế cạnh tranh thông qua quản lý danh mục đầu tư sử dụng ma trận thể hiện trong hình?\n![](https://learn.viblo.asia/uploads/d/6/d6f0a943-0358-4d18-a08b-d3f7c98b800c.jpg)","answer_label":"Để đánh giá vị trí kinh doanh của công ty làm cơ sở cho việc đặt ra một mục tiêu và ưu tiên phân bổ nguồn lực","answer_id":52485},{"id":13917,"question":"Phân tích PEST được sử dụng để phân tích môi trường bên ngoài trong quá trình xác định chiến lược kinh doanh. Các yếu tố môi trường bên ngoài mà PEST phân tích là gì?","answer_label":"Chính trị, Kinh tế, Xã hội, Công nghệ","answer_id":53918},{"id":13921,"question":"Lựa chọn nào sau đây sẽ thực hiện việc xử lý theo các bước từ (1) đến (3)?\n\n    (1) Căn cứ vào kiểu loại và số lượng cũng như danh mục chi tiết những sản phẩm dự kiến sản xuất trong một giai đoạn cố định trong tương lai, tính ra số lượng thành phần yêu cầu.\n\n    (2) Số lượng đặt hàng thuần của từng thành phần được tính từ số tồn kho có thể phân bổ.\n\n    (3) Thời gian đặt hàng các thành phần được xác định khi xem xét thời gian sản xuất và thời gian mua sắm.","answer_label":"MRP (Hoạch định yêu cầu vật liệu","answer_id":53937},{"id":13922,"question":"Lựa chọn nào sau đây là quy trình mua sắm cho phép các nhà cung cấp chào giá cạnh tranh với nhau trên Internet để bán sản phẩm hay dịch vụ của họ theo những điều kiện do khách hàng xác định ?","answer_label":"Đấu giá ngược","answer_id":53940},{"id":13529,"question":"Lựa chọn nào sau đây là lời giải thích về lưới thông minh?","answer_label":"Đó là một hệ thống nhằm sử dụng năng lượng có thể tái chế, cung ứng nguồn điện ổn định, và điều chỉnh nhu cầu tối ưu thông qua kiểm soát tích hợp việc phát điện và tiêu thụ điện dựa trên công nghệ truyền thông và xử lý thông tin.","answer_id":52366},{"id":13562,"question":"Lựa chọn nào sau đây mô tả một hệ thống RFID?","answer_label":"Đầu đọc/ghi RF tạo ra một trường điện từ cấp điện cho thẻ RF trong phạm vi cho phép truyền tải thông tin","answer_id":52499},{"id":13920,"question":"Lựa chọn nào sau đây là giải thích về long tail?","answer_label":"Nó hiệu quả trong việc làm giảm nguy cơ mất cơ hội trong một cửa hàng trực tuyến trên  Internet bằng cách sắp xếp một loạt mặt hàng, bao gồm cả những sản phẩm ít có cơ hội bán được.","answer_id":53933},{"id":13527,"question":"Lựa chọn nào sau đây là giải thích về phương tiện huy động thông tin từ khách hàng (CGM)?","answer_label":"Nó cho phép phân phối nội dung số do cá nhân người đọc tạo ra, và chia sẻ nội dung đó giữa các người dùng.","answer_id":52359},{"id":13525,"question":"Một công ty may mặc và bán hàng được đánh giá bằng cách phân tích chuỗi giá trị. Khi phân loại các hoạt động trong công ty thành nội vụ, sản xuất, ngoại vụ, bán hàng/ tiếp thị, và các dịch vụ, lựa chọn nào sau đây được phân loại như là các hoạt động nội vụ?","answer_label":"Hoạt động đặt hàng nguyên liệu, thanh tra và quản lý hàng tồn kho","answer_id":52351},{"id":13528,"question":"Lựa chọn nào sau đây là lời giải thích về sàn giao dịch điện tử?","answer_label":"Đó là một phương pháp mà trong đó nhiều người bán và người mua gặp nhau ở chợ được thiết lập trên Internet và mua bán trực tiếp không qua phân phối trung gian","answer_id":52362},{"id":13916,"question":"Lựa chọn nào sau đây là một kỹ thuật marketing để tạo ra nhu cầu của người tiêu dùng bằng cách sử dụng quảng cáo nâng cao hình ảnh thương hiệu của công ty hoặc sản phẩm?","answer_label":"Chiến lược kéo","answer_id":53916},{"id":13557,"question":"Lựa chọn nào sau đây giải thích về khoảng cách số?","answer_label":"Nó đề cập đến khoảng cách kinh tế hoặc xã hội xảy ra do sự khác biệt về khả năng và cơ hội khi sử dụng máy tính và mạng truyền thông.","answer_id":52478},{"id":13918,"question":"Lựa chọn nào sau đây là giải thích về IoT (Internet vạn vật)?","answer_label":"Nó chỉ việc cài đặt tính năng giao tiếp tới các đối tượng khác nhau, ngoài các thông tin và thiết bị liên lạc, và cho phép tự động nhận dạng hoặc đo đạc từ xa bằng cách kết nối đối tượng này với Internet, để đạt được các dịch vụ ra quyết định cao cấp và tự động kiểm soát thông qua việc thu thập và phân tích khối lượng dữ liệu lớn.","answer_id":53925},{"id":13911,"question":"Trong “bốn loại’ cấu trúc doanh nghiệp, loại nào dưới đây hợp thành danh sách đầy đủ cùng với cấu trúc nghiệp vụ, cấu trúc công nghệ và cấu trúc ứng dụng?","answer_label":"Cấu trúc dữ liệu","answer_id":53895},{"id":13560,"question":"Lựa chọn nào sau đây là chiến lược cơ bản của một ngách trong vị thế cạnh tranh?","answer_label":"Chiến lược chuyên môn nhằm vào sự chuyên môn hóa của sản phẩm và thị trường","answer_id":52493},{"id":13561,"question":"Hình dưới đây là thủ tục làm việc của MRP (Material Requirements Planning), một kỹ thuật của một hệ thống quản lý sản xuất. Những thông tin nào sau đây được chèn vào A trong hình bên dưới là cần thiết để tính các yêu cầu ròng?\n\n![](https://learn.viblo.asia/uploads/b/6/b601609d-5998-4bac-a152-ad8011f0d396.jpg)","answer_label":"Trạng thái tồn kho (lượng hàng tồn kho, đơn hàng còn lại, số lượng trong quá trình sản xuất)","answer_id":52495},{"id":13915,"question":"Các công ty được phân loại dựa trên vị thế cạnh tranh của họ trên thị trường. Thường có bốn loại: dẫn đầu, thách thức, đi theo, và ngách. Lựa chọn nào sau đây là đặc tính thích hợp của chiến lược dẫn đầu?","answer_label":"Đề xuất sản phẩm mới và phương pháp sử dụng nó với người tiêu dùng để mở rộng nhu cầu tổng thể trong khi vẫn duy trì hoặc mở rộng thị phần","answer_id":53913},{"id":13914,"question":"Lựa chọn nào sau đây là mô tả thích hợp của RFI?","answer_label":"Đó là một tài liệu dùng để yêu cầu thông tin liên quan đến việc tin học hóa từ các nhà cung cấp tiềm năng, ví dụ như các nhà cung cấp hệ thống.","answer_id":53909}]