[{"id":13842,"question":"Which of the following is an explanation of a matrix organization","answer_label":"An organization in which members usually belong both to a functional department and to a department that executes specified business","answer_id":53620},{"id":2842,"question":"Which of the following can secure employment and create employment opportunities in an entire society by shortening the work hours per employee?","answer_label":"Work sharing","answer_id":12369},{"id":5226,"question":"A trucking company has two types of trucks, A-type and B-type, as shown in the table below, and the company has a contract to deliver 900 boxes at a time by using the company’s own trucks. However, because of the limited availability of truck drivers, only a total of 10 trucks can be dispatched at a time. Which of the following is the set of expressions that can determine the number of trucks so as to minimize the delivery cost? Here, x and y are the number of A-type trucks and the number of B-type trucks, respectively.\n![](https://learn.viblo.asia/uploads/9/0/907d4a53-f195-41c5-bd00-a74b210f11ab.png)","answer_label":"c","answer_id":21379},{"id":2984,"question":"Which of the following corresponds to (5) in an example of a model of an affiliate program shown below in Internet advertising? Here, (1) through (5) indicate the order of operations in the model, and each of (1), (2), (4), and (5) corresponds to one of a) through d).\n![](https://learn.viblo.asia/uploads/2/a/2ae7a9ca-122f-454b-9f58-64c8fb00e1b8.png)","answer_label":"Pay a contingency fee in accordance with the sales of the product","answer_id":12923},{"id":6167,"question":"Which of the following is a mechanism used in electronic commerce to exchange data between companies?","answer_label":"EDI","answer_id":24883},{"id":4690,"question":"Which of the following is an appropriate explanation of demographic segment that is one of the market segments?","answer_label":"A group of a population segmented by factors such as age, gender, family size, income, occupation, education, religion, race, generation, and nationality","answer_id":19442},{"id":2085,"question":"Which of the following is an explanation concerning the accountability at an executive managerial level?","answer_label":"A management executive has responsibility for explaining the content and performance of business activities to shareholders and other interested parties.","answer_id":9499},{"id":13832,"question":"Which of the following descriptions corresponds to CSR procurement?","answer_label":"Indicating procurement standards that take the environment, human rights, etc. into account, and requiring suppliers to comply with these","answer_id":53580},{"id":4446,"question":"Which of the following is the procurement process that enables suppliers to bid against one another on the Internet in order to sell their products or services under the conditions specified by a general customer?","answer_label":"Reverse auction","answer_id":18587},{"id":3368,"question":"Which of the following is the appropriate term applicable to the description below?\n\nIt is used to describe the economic concept or strategy of a certain Internet-based\nbusiness targeting less-competitive niche markets, which enables the business to gain\nsignificant profit in selling small volumes of hard-to-find items to many customers,\ninstead of selling large volumes of reduced number of popular items.","answer_label":"Long tail","answer_id":14408},{"id":4689,"question":"Which of the following is an explanation of marketing mix?","answer_label":"A company’s products are effectively sold by combining product strategy, price strategy, channel strategy, promotion strategy, and others appropriately.","answer_id":19436},{"id":2083,"question":"Which of the following is an explanation concerning EDI?","answer_label":"The exchange of business transaction data between computers over the Internet or other dedicated communication lines, in accordance with standard protocols","answer_id":9493},{"id":3501,"question":"The product life cycle is a concept based on the idea that all products pass through four stages: introduction, growth, maturity, and decline. Which of the following is the characteristic of the maturity stage in the product life cycle?","answer_label":"As demand increases, product differentiation and market segmentation become evident. Competition between competitors increases, and addition of new models and reduction of costs become important.","answer_id":14927},{"id":4441,"question":"Which of the following corresponds to an example of “ non-functional ” requirements?","answer_label":"Selecting development standards based on the language used in system development","answer_id":18567},{"id":1782,"question":"Which of the following is a marketing technique to create demands from consumers by using advertisements that improve the brand image of a company or a product?","answer_label":"Pull strategy","answer_id":8337},{"id":4697,"question":"Which of the following is a method which can be used to calculate a predicted value based on actual values of the previous time period and in which each of the actual values is equally weighted?","answer_label":"Moving average method","answer_id":19471},{"id":5142,"question":"Product  Portfolio  Management  (PPM)  is  a  method  for  analyzing  the  positioning  of  a  product  within  the  market  and  reviewing  the  resource  allocation.      As  shown  below,  PPM  uses  a  matrix  chart  divided  into  four  quadrants,  with  the  market  growth  rate  on  the vertical axis, and the market share on the horizontal axis.    Which of the following is the appropriate quadrant in which a product referred to as “cash cow” is categorized? \n![](https://learn.viblo.asia/uploads/d/2/d265e9b4-1cdc-4e5a-a1aa-52fb1c8b7f04.png)","answer_label":"C","answer_id":21043},{"id":13838,"question":"Which of the following is an appropriate explanation of the technology S curve","answer_label":"It represents the process of technological progress. It shows that technology advances slowly at the beginning and then advances rapidly, and thereafter, slowly stagnates.","answer_id":53604},{"id":4449,"question":"Which of the following is an explanation of an affinity diagram?","answer_label":"It is a method by which the collected information is grouped according to the mutual relationship, and the problems to be resolved are clarified.","answer_id":18598},{"id":642,"question":"Which of the following is an explanation of EDI?","answer_label":"The exchange of business transaction data between computers (including terminals) over the Internet on the basis of standard protocols","answer_id":5301},{"id":3672,"question":"Which of the following is a document that asks to provide the information necessary for the preparation of a document that asks for proposals?","answer_label":"RFI","answer_id":15604},{"id":5221,"question":"Which of the following is an appropriate explanation of a franchise chain in the retail industry?","answer_label":"A form of organization in which a head office provides to its members usage rights of its trademarks and signs, and also provides managerial training and assistance in exchange for a fixed rate of compensation","answer_id":21359},{"id":4444,"question":"Which of the following is an explanation of social media?","answer_label":"It provides a mechanism that promotes the connection between users so that the information posted by a user over the Internet is widely transmitted to a large number of users.","answer_id":18578},{"id":1787,"question":"Which of the following performs processing according to steps (1) through (3)?\n\n(1) Based on the types and quantities as well as the parts list of the product planned to be manufactured in a fixed period of time in the future, the required quantity of components is calculated.\n\n(2) The net order quantity of each component is calculated from the amount of inventory that can be allocated.\n\n(3) The ordering time of the components is determined while considering the manufacturing and procurement lead time.","answer_label":"MRP (Material Requirements Planning)","answer_id":8358},{"id":2079,"question":"Which of the following is an explanation concerning a franchise chain in the retail industry?","answer_label":"A form of organization where a head office allows its members to use the trademarks and signs, and also provides managerial training and assistance, at a fixed rate of compensation","answer_id":9475},{"id":3675,"question":"Which of the following is not an appropriate usage for embedded systems?","answer_label":"A host system for managing train ticket reservations","answer_id":15615},{"id":1652,"question":"Among the different business systems supported by technology, which of the following analyzes routes of distribution, tracking and load tendency?","answer_label":"TMS","answer_id":7737},{"id":2835,"question":"Which of the following is an explanation of knowledge management?","answer_label":"Management which improves the overall problem-solving capability by sharing knowledge that is scattered across the enterprise","answer_id":12341},{"id":1649,"question":"Which of the following is a technique for classifying company activities into primary activities and support activities, and analyzing which activities generate the profit of the products or services provided to customers?","answer_label":"Value chain analysis","answer_id":7726},{"id":1781,"question":"Companies are classified based on their competitive position in the market. There are typically four types: leader, challenger, follower, and nicher. Which of the following is an appropriate characteristic of the strategy of a leader?","answer_label":"Proposing a new product and its usage method to the consumer to expand the total demand while maintaining or expanding the market share","answer_id":8334},{"id":2983,"question":"Which of the following is a characteristic of MRP?","answer_label":"The number of required components is calculated based on the standard production plan of a product.","answer_id":12918},{"id":6168,"question":"Which of the following is the most appropriate position that is primarily responsible for centralized oversight of enterprise IT strategic planning?","answer_label":"CIO (Chief Information Officer)","answer_id":24888},{"id":2843,"question":"Which of the following is an explanation of an ABC analysis method?","answer_label":"Products are arranged in order of high sales or high gross margins, and then products are divided into various levels by using the cumulative ratio. Following this, an increase in sales volume is planned for the products at the high levels.","answer_id":12372},{"id":1648,"question":"Which of the following is a technique that is used to identify and evaluate the internal and external factors that are helpful or harmful to the objectives of business organizations or projects?","answer_label":"SWOT analysis","answer_id":7721},{"id":5136,"question":"Which of the following is provided by an ASP (Application Service Provider)?","answer_label":"A service in which the functions of a general-purpose application system are provided to several customers via a network","answer_id":21020},{"id":6430,"question":"Which of the following is the situation that is expected to be improved by the introduction of an MRP (Material Requirements Planning) system?","answer_label":"Information concerning materials necessary for manufacturing and their required quantities is complex, so errors can occur repeatedly in the estimated quantity of order and thereby bring about problems to production.","answer_id":25848},{"id":3414,"question":"The figure below shows the transaction model of an escrow service that is used on an Internet auction site or such other transaction. Which of the following is the action that corresponds to (5) in this figure? Here, (1) through (6) indicate the sequence of transactions, and each of (3) through (6) corresponds to one of a) through d).\n\n![](https://learn.viblo.asia/uploads/3/f/3f06e8a2-ff93-449f-a004-228bdbf90ac4.png)","answer_label":"Notice of receipt of product","answer_id":14580},{"id":775,"question":"In a growth matrix proposed by Ansoff, which of the following is a strategy for expanding a business with an existing product in an existing market?","answer_label":"Market penetration","answer_id":5012},{"id":5146,"question":"Which of the following is an explanation of a CIO?","answer_label":"An executive who is positioned to plan and execute strategies including information management and information system control","answer_id":21058},{"id":776,"question":"Which of the following is a characteristic of the growth stage in a product life cycle?","answer_label":"The market starts to understand the worth of the product. Both the product line and channel need to be expanded. This stage sees an increase in the sales and also requires investment.","answer_id":5009},{"id":1892,"question":"A company is creating a development plan for job A. The first developer can perform this job alone in 10 days. Moreover, the first developer can perform this job in 6 days with the second developer. How many days will be required for the second developer to perform this job alone? Here, owing to communication, the work efficiency for each developer is reduced by 10% and the decimal needs to be rounded up.","answer_label":"12","answer_id":8777},{"id":2838,"question":"Which of the following is an example of the use of social media in business?","answer_label":"A company sets up a site on the Internet for sharing opinions on matters such as the usage status of its products, which leads to improvement of the product.","answer_id":12352},{"id":1788,"question":"Which of the following is the procurement process that enables suppliers to bid against one another on the Internet to sell their products or services under the conditions specified by a general customer?","answer_label":"Reverse auction","answer_id":8361},{"id":1653,"question":"Which of the following is an explanation of the strategy map that is used in the balanced score card?","answer_label":"It shows the cause-and-effect relationship between issues, countermeasures, and goals,\r\non the basis of the four perspectives that consist of finance, customer, internal business\r\nprocess, and learning and growth.","answer_id":7740},{"id":2035,"question":"With the carryover from the previous month and the quantity of inventory transactions for a product shown in the table below, what is the unit price of the product for the succeeding period using the periodic average method? \n\n![](https://learn.viblo.asia/uploads/6/6/667717f9-b867-419c-9aef-f1d9170f83de.png)","answer_label":"65.00","answer_id":9299},{"id":3369,"question":"Which of the following is the methodology that performs both production scheduling\nand inventory control on the basis of steps (1) through (3) described below?\n\n(1) Based on the types and quantities as well as the component list of the product\nplanned to be manufactured during a fixed period of time in the future, the required\nquantity of components is calculated.\n(2) The net order quantity of each component is calculated from the amount of\ninventory that can be allocated.\n(3) The ordering point of each component is determined in consideration of the\nmanufacturing or procurement lead time.","answer_label":"MRP","answer_id":14413},{"id":781,"question":"Which of the following is a description of the long tail?","answer_label":"The accumulated sales of the product groups that are not selling well account for a percentage that cannot be ignored against the total sales in Internet shopping.","answer_id":4989},{"id":2978,"question":"Which of the following is a leader strategy among the competitive strategies of a company?","answer_label":"Employing an omnidirectional strategy targeting all market customers with the aim of maintaining or improving profit and reputation, and securing optimum market share","answer_id":12899},{"id":787,"question":"Which of the following is a method for making decisions on the basis of the sum of the future cashflows discounted by a discount rate?","answer_label":"Net Present Value Method (NPV)","answer_id":4963},{"id":4443,"question":"Which of the following is the purpose of CRM?","answer_label":"To acquire customer loyalty and maximize customer lifetime value","answer_id":18573},{"id":1650,"question":"Which of the following is an explanation of the core competence?","answer_label":"It refers to the predominant abilities in the business area of the company, which cannot\r\nbe imitated by competitors.","answer_id":7730},{"id":2981,"question":"When trial production is performed for components to be loaded into electrical appliances, which of the following is the development method with the least overall cost? Here, the construction time of each process is six (6) months for the creation process, three (3) months for the modification process, and two (2) months for the evaluation process. Moreover, the cost per one (1) person-month is 6,000 dollars for the creation process, and 10,000 dollars for each of the modification process and evaluation process. However, costs other than the three (3) costs of the person-month cost, purchase cost, and outsourcing cost are not taken into consideration.\n![](https://learn.viblo.asia/uploads/9/4/9413df93-4ec4-4a1c-84bd-a7e827f76ee3.png)","answer_label":"a","answer_id":12909},{"id":643,"question":"Which of the following is the procurement process that enables suppliers to bid against one another on the Internet in order to sell their products or services under the conditions specified by a general customer?","answer_label":"Reverse auction","answer_id":5296},{"id":3419,"question":"As shown in the table below, a factory manufactures the three types of products: X, Y, and Z. How much is the maximum possible profit in dollars? Here, there is an upper limit of the monthly demand for each product. Also, the factory can be used up to 200 hours per month for product assembly, but multiple products cannot be assembled in parallel.\n\n![](https://learn.viblo.asia/uploads/a/0/a0191d03-df78-4c60-86be-e875ed97d0fe.png)","answer_label":"33,000","answer_id":14602},{"id":2831,"question":"Which of the following is an explanation of application architecture that configures enterprise architecture?","answer_label":"It systematically indicates the functions and configuration of a system supporting a business process.","answer_id":12325},{"id":3496,"question":"Which of the following is an appropriate explanation of SCM (Supply Chain Management)?","answer_label":"It is a business process for managing the series of business operations linking purchase, production, sale, and distribution from the viewpoint of total optimization among companies in order to reduce delivery lead time and stock.","answer_id":14907},{"id":3361,"question":"Among the costs related to computerization, which of the following is included in the\nrunning cost?","answer_label":"Maintenance cost of information equipment such as servers","answer_id":14381},{"id":2343,"question":"Which of the following is the work that is performed when non-functional requirements are defined?","answer_label":"Creating the technical requirements for the development criteria and standards\naccording to the programming language used in system development","answer_id":10448},{"id":13843,"question":"Which of the following is an explanation of work sharing","answer_label":"An initiative for securing employment through shortening of work hours per employee and review of work assignments","answer_id":53625},{"id":13837,"question":"Which of the following is a definition of Customer Relationship Management (CRM)?","answer_label":"A technology for managing all of a company’s relationships and interactions with customers and potential customers in order to improve business relationships","answer_id":53599},{"id":3417,"question":"When the relationship between the list price of a product and the demand for the product is defined as a linear expression, which of the following is an appropriate numerical value to be inserted into blank A below?\n(1) When the list price is set to 30 dollars, demand is 0 units.\n(2) When the list price is set to 10 dollars, demand is 60,000 units.\n(3) When the list price is set to 15 dollars, demand is    A     units.","answer_label":"45,000","answer_id":14594},{"id":636,"question":"Which of the following is an external factor concerning an in-house product identified using SWOT analysis?","answer_label":"Threats owing to a new entry","answer_id":5325},{"id":2836,"question":"Which of the following is a characteristic of an IC tag (RFID)?","answer_label":"An IC tag is resistant to dirt, and the recorded information can be read even from outside the container.","answer_id":12344},{"id":773,"question":"A company chooses products and services that are acknowledged as actively addressing environmental concerns. What is this initiative called?","answer_label":"Green procurement","answer_id":5020},{"id":3363,"question":"According to Michael Porter, who is the author of “Competitive Strategy”, which of\nthe following is the tool that is used to classify a company’s business activities into\nmain activities and supporting activities on a function-by-function basis in order to\nidentify key activities that generate the profit for the company and the possible benefit\nfor customers?","answer_label":"Value chain analysis","answer_id":14389},{"id":2832,"question":"In the table shown below, the investment category and KPI have been arranged according to the investment purpose. Which of the following corresponds to investment purpose C ? Here, a) to d) are applied to any one of A to D.\n![](https://learn.viblo.asia/uploads/1/3/139fab6c-29e2-41b7-b1b5-9efb9e585dfb.png)","answer_label":"Creation of business and establishment of competitive advantages","answer_id":12328},{"id":4442,"question":"When a company’s own product is analyzed by using a SWOT analysis, which of the following is classified as an external factor?","answer_label":"Threats of new competitors","answer_id":18572},{"id":2036,"question":"The following inventory statement of Build-Up Property Company describes the status of the inventory since the beginning of the year 2014. If this company uses a first-in-first-out (FIFO) method for the inventory asset valuation, what is the inventory value at the end of the year 2014?\n\n![](https://learn.viblo.asia/uploads/1/5/15c1e12c-664f-46b1-96e4-10d266217877.png)","answer_label":"7,600","answer_id":9303},{"id":3503,"question":"Which of the following is an appropriate explanation of CRM?","answer_label":"It is a method for improving business performance by sharing information between all customer channels within a company and by increasing customer satisfaction.","answer_id":14934},{"id":3495,"question":"Which of the following is an appropriate explanation of SOA?","answer_label":"It is a design approach to architecture that builds software applications as reusable services and utilizes those services in a network such as the Internet in order to achieve a high level of productivity.","answer_id":14903},{"id":4629,"question":"Which of the following is the appropriate statement according to the Pareto analysis\n(also known as the 80-20 rule)?","answer_label":"This is the idea that 80% of tasks can be completed in 20% of the disposable time. The remaining 20% of tasks will take up 80% of the time.","answer_id":19233},{"id":3497,"question":"Which of the following is the most appropriate explanation of system integration?","answer_label":"Necessary tasks related to an information system, such as planning, construction, and operations, are performed all together based on an underpinning contract.","answer_id":14912},{"id":6170,"question":"When ABC analysis is used to categorize product items in the table below, which of the following is the combination of the product numbers for the items that are categorized into the group “A”?\n![](https://learn.viblo.asia/uploads/5/6/569d0f29-7c00-4ba3-88ec-4fe55eabe737.png)","answer_label":"2 and 5","answer_id":24895},{"id":4630,"question":"The seven traditional, fundamental quality control tools consist of Check sheet, Pareto\nchart, Stratification, Scatter Diagram, Histogram, and Control Chart. What is the last\n(or 7th) one?","answer_label":"Cause and effect diagram","answer_id":19236},{"id":644,"question":"Which of the following is an appropriate method to forecast the amount of revenue during an upcoming promotion at a store, based on historical data?","answer_label":"Regression analysis","answer_id":5293},{"id":637,"question":"According to the “competitive strategy” proposed by Philip Kotler, which of the following describes a company that has no high market share, but has the strategic aim to increase income and acquire a unique position by focusing management resources on particular products and services?","answer_label":"Market nicher","answer_id":5321},{"id":6317,"question":"![](https://learn.viblo.asia/uploads/b/c/bcad9ccc-3168-4e18-bf9c-1a65dd051e83.png)","answer_label":"c","answer_id":25417},{"id":2841,"question":"Among the measures that a company should adopt in order to fulfill social responsibility, which of the following is implemented in terms of the environment?","answer_label":"To develop an internal organization for the purpose of green purchasing.","answer_id":12363},{"id":5220,"question":"The four perspectives of the BSC (Balanced Score Card) includes “financial,” “learning and growth,” “internal business process,” and one other. Which of the following is the one remaining perspective that is sometimes extended to or replaced by “stakeholder” for modified or extended BSC models?","answer_label":"Customer","answer_id":21355},{"id":5135,"question":"Which of the following is an improvement index in supply chain management?","answer_label":"Ratio of reduction in dead stock","answer_id":21015},{"id":1786,"question":"Which of the following is an explanation of the long tail?","answer_label":"It is effective in reducing the risk of opportunity loss in an online shop that uses the Internet by lining up a broad range of items, including products for which sales opportunities are few.","answer_id":8354},{"id":4632,"question":"There are goods whose unit purchase prices are gradually rising. There was an\ninventory of these goods at the end of the last accounting period, and the goods were\ncarried into and out of the warehouse several times during the current period. Which\nof the following valuation methods produces the lowest valuation of the inventory at\nthe end of the current period?","answer_label":"Last-in first-out method","answer_id":19245},{"id":1779,"question":"Which of the following is an explanation of green procurement?","answer_label":"It refers not only to the fulfillment of the requirements of quality and price, but also to the preferential purchase of products and services that exert a lower environmental burden from companies working towards a reduction in environmental burden.","answer_id":8323},{"id":765,"question":"In ITIL, the reduction in the index value expressing the maintainability is cited as an example of a KPI (Key Performance Index) in availability management. Which of the following corresponds to such an index?","answer_label":"Mean time to restore service","answer_id":5052},{"id":3507,"question":"Which of the following is the appropriate rule for “brainstorming” that is a method of resolving problems?","answer_label":"Participants should listen to free-wheeling opinions, including unique ideas.","answer_id":14952},{"id":2979,"question":"Which of the following is an explanation of Supply Chain Management (SCM)?","answer_label":"The sequence of business operations, from purchasing and production to sales and distribution, is reexamined within the company and among companies in view of total optimization, so as to accelerate delivery and minimize inventory.","answer_id":12904},{"id":5217,"question":"Which of the following is an appropriate explanation of the RFI that is created when a new information system is procured?","answer_label":"A request is made to the vendor for helpful information by showing the details of business operations and the purpose of the computerization.","answer_id":21343},{"id":2075,"question":"IT investment evaluation is performed as prior evaluation, interim evaluation, or post evaluation according to each stage of the planning, execution, and completion for an individual project. Which of the following is an explanation concerning “prior evaluation”?","answer_label":"Setting the performance objectives based on the purpose of investment, and providing the top management with information necessary for determining the feasibility of implementation","answer_id":9461},{"id":3370,"question":"Which of the following is an appropriate reason for using a flash memory device as a\nbuilt-in memory feature of a one-chip microcomputer?","answer_label":"The program can be rewritten after the microcomputer is shipped.","answer_id":14416},{"id":2986,"question":"When the weather tomorrow is sunny with 30% probability, cloudy with 50% probability, and rainy with 20% probability, which of the following strategies offers the highest expected value?\n![](https://learn.viblo.asia/uploads/b/1/b1465328-3564-41df-afd5-c683e3337841.png)","answer_label":"S1","answer_id":12929},{"id":13835,"question":"Which of the following is an external factor related to company’s products, identified by SWOT analysis?","answer_label":"Threats by new entrants","answer_id":53592},{"id":13841,"question":"Which of the following is a control method for a status of “a somewhat large number” or“slightly” ?","answer_label":"Fuzzy control","answer_id":53615},{"id":3499,"question":"Which of the following is applicable to the definition of “ non-functional ” requirements?","answer_label":"Creating development criteria and standards suitable for the language used in system development","answer_id":14918},{"id":641,"question":"Which of the following performs processing according to steps (1) through (3)?\n(1) Based on the types and quantities, as well as the parts list of the product to be manufactured within a future fixed period of time, the required quantity of components is calculated.\n(2) The net order quantity of each component is calculated from the amount of inventory that can be allocated.\n(3) The ordering time for the components is determined with consideration for the manufacturing or procurement lead time.","answer_label":"MRP","answer_id":5305},{"id":2255,"question":"Which of the following is the purpose of analyzing business plans and competitive\nadvantages through portfolio management that uses the matrix shown in the figure?\n![](https://learn.viblo.asia/uploads/2/f/2f027d26-fecf-4255-a151-f0b41f0df5d8.png)","answer_label":"To evaluate the position of the company’s business as the basis for setting an objective\nand prioritizing resource allocation","answer_id":10113},{"id":3508,"question":"Which of the following is an appropriate chart that can be used for planning the work schedule and for keeping track of the progress status in a project?","answer_label":"Gantt chart","answer_id":14956},{"id":4695,"question":"Which of the following is an organization that is formed for a certain limited period of time to solve a problem and is disbanded when the problem is solved?","answer_label":"Project organization","answer_id":19463},{"id":5224,"question":"Which of the following is a business organization that is divided according to the type of work performed as shown in the chart below?\n![](https://learn.viblo.asia/uploads/e/3/e3fbf3ec-809e-46c5-89de-597205ddcc4b.png)","answer_label":"Functional organization","answer_id":21370},{"id":3416,"question":"Which of the following is a chart or a diagram that is used to analyze possible relationships between two variables and is composed of a horizontal axis containing the measured values of one variable and a vertical axis representing the measurements of the other variable?","answer_label":"Scatter diagram","answer_id":14590},{"id":645,"question":"Which of the following is an appropriate explanation of a scatter diagram?","answer_label":"It is a chart used to determine if a relationship, pattern, or trend exists between two numeric attributes.","answer_id":5286},{"id":639,"question":"Which of the following is an explanation of knowledge management?","answer_label":"Knowledge scattered across an enterprise is shared to improve overall problem-solving capability.","answer_id":5312},{"id":634,"question":"Which of the following should be undertaken in order to eliminate the “digital divide”?","answer_label":"Increasing learning opportunities for information literacy, and preparing an environment to further facilitate the use of information & telecommunications equipment and information services","answer_id":5331},{"id":2082,"question":"Among the various types of e-commerce transactions, which of the following is an appropriate example of B2C (i.e., “B to C”)?","answer_label":"Mr. B buys a book from an online shop owned by Company A.","answer_id":9487},{"id":779,"question":"Which of the following is not appropriate as an application example of the IoT (Internet of Things)?","answer_label":"A computer that independently performs file management, arithmetic and logic operations, printing processing, and other tasks without accessing a server to avoid the security problems on the Internet","answer_id":4994},{"id":3413,"question":"Which of the following is the purpose of SCM?","answer_label":"To reduce costs and shorten delivery periods through integrated management of information across multiple companies or organizations from procurement to sales","answer_id":14578},{"id":3362,"question":"Which of the following is an explanation of the digital divide?","answer_label":"It refers to the social or economic gap that occurs depending on the level of\ninformation literacy and also on the differences in the usage environment of\ninformation technology.","answer_id":14384},{"id":4440,"question":"Which of the following is an explanation of SCM?","answer_label":"A series of business operations including purchase, production, sale, and distribution is reviewed from the viewpoint of total optimization among companies in order to reduce delivery lead time and inventory.","answer_id":18561},{"id":13833,"question":"An RFP is presented to each vendor that has responded to an RFI. Which of the following should be done beforehand in order to proceed with future vendor selection processes fairly?","answer_label":"Establishing processes of selection, such as setting evaluation standards or weighting rules of conformity to the request items","answer_id":53583},{"id":2077,"question":"When a computerization plan is made, which of the following is an item to be considered?","answer_label":"Clarifying the cost and investment effect of the development, maintenance, and operations of the system","answer_id":9466},{"id":2840,"question":"Which of the following is a role that CIO is required to perform?","answer_label":"Promotion of use of IT services that maximizes business value.","answer_id":12362},{"id":778,"question":"Which of the following can take advantage of the cell production method?","answer_label":"Products that require flexible production to produce a variety of types","answer_id":5000},{"id":5149,"question":"The table below shows the transaction records for a certain fiscal period. When the average cost is calculated based on the periodic average method, how much is the “cost of sales” in dollars at the end of the period?\n![](https://learn.viblo.asia/uploads/f/8/f8830ba8-d85d-4d6d-bf70-5395ee9e9e6a.png)","answer_label":"938","answer_id":21070},{"id":3678,"question":"When the fixed order quantity model can be used for controlling inventory under the following conditions, what is the Economic Order Quantity (EOQ)? Here, EOQ is theoptimal order quantity that theoretically minimizes the total of the cost of ordering and holding inventory. The demand is constant, and does not vary over time.\n![](https://learn.viblo.asia/uploads/8/d/8dce54e6-414e-418a-9576-1fd4055f2f4a.png)","answer_label":"1,000","answer_id":15629},{"id":640,"question":"Which of the following is an explanation of CAD?","answer_label":"Using a computer to create product design drawings from attribute data concerning product shape, composition, etc.","answer_id":5308},{"id":5141,"question":"Which of the following is an appropriate form of transaction where one company (i.e., the bidder) gains a decisive share of the basic equity of another target business?","answer_label":"Acquisition","answer_id":21037},{"id":6171,"question":"When the relationship between the list price and expected demand of a product can be expressed by a linear expression, which of the following is the appropriate value to be inserted in the blank A?\n(1) When the list price is set to 30 dollars, the quantity demanded is 0.\n(2) When the list price is set to 10 dollars, the quantity demanded is 60,000.\n(3) When the list price is set to 15 dollars, the quantity demanded is $\\boxed{A}$.","answer_label":"45,000","answer_id":24901},{"id":4696,"question":"Which of the following is a two-layered chart that is composed of a bar chart showing control items arranged in descending order of frequency and a line chart showing the cumulative percentage of each item?","answer_label":"Pareto chart","answer_id":19466},{"id":5222,"question":"Which of the following is an appropriate characteristic of an RFID tag that is a type of IC tag and is used for locating and tracking merchandise, inventory, or other assets?","answer_label":"It reads information without physical contact by using electromagnetic waves.","answer_id":21363},{"id":3411,"question":"Which of the following is the business management technique that is used to develop specific targets and measures to implement a planned strategy, in consideration of the appropriate mutual relationships among four perspectives (i.e., financial, customer, internal business processes, and learning and growth)?","answer_label":"Balanced score card","answer_id":14567},{"id":4628,"question":"Which of the following appropriately describes financial statements?","answer_label":"Profit and loss statement is also known as the income statement. This presents\nhow revenues are converted to net income by reporting both revenues and expenses\nof the company for a given period of time.","answer_id":19229},{"id":3365,"question":"Which of the following is an example of the strategic target and key performance\nindicator of a balanced score card from the viewpoint of customers?","answer_label":"Since the target is to establish a close and continuing relationship with the major\ncustomers, the number of complaints is the indicator.","answer_id":14395},{"id":5145,"question":"Which of the following is an appropriate explanation of IR (Investor Relations)?","answer_label":"It is a business process of providing investors and analysts with accurate management information necessary for making investment decisions, on a timely and continuous basis.","answer_id":21056},{"id":2024,"question":"Which of the following is a price-setting method based on cost-plus pricing?","answer_label":"On the basis of manufacturing cost and operating expenses, the price is set by\nincorporating a desired margin.","answer_id":9255},{"id":4692,"question":"Which of the following is the situation where an improvement can be expected by installing an MRP (Material Requirements Planning) system?","answer_label":"Information about materials and quantities necessary for production is complicated, so a miscalculation of order quantity or an interruption of production often occurs.","answer_id":19450},{"id":2845,"question":"Which of the following is a technique that discovers useful information and relationships from large amounts of customer and market data retained by a company?","answer_label":"Data mining","answer_id":12381},{"id":5219,"question":"Which of the following is the technique and concept for improving management efficiency by planning and controlling the company-wide management resources in an effective and integrated way?","answer_label":"ERP","answer_id":21350},{"id":4627,"question":"A data warehouse was set up, but it is hardly used. The result of a hearing suggests\nthat the users’ skill level is lower than expected. Which of the following is an\nappropriate measure for improvement to promote usage?","answer_label":"To prepare, as standards, templates according to data extraction and analysis patterns","answer_id":19224},{"id":2034,"question":"Products A, B, C, and D are to be introduced to the market. The table below shows the expected profit for each product with three (3) sales forecasts (High, Medium, and Low) that are estimated to occur in accordance with the probability in the table. Which of the following is the product that is expected to make the highest profit according to the expected value principle? \n\n![](https://learn.viblo.asia/uploads/b/9/b96ebe5f-2d06-49ec-8a4e-e515782c0e22.png)","answer_label":"B","answer_id":9295},{"id":5225,"question":"Which of the following is an appropriate explanation of accessibility in the context of information technology?","answer_label":"Environment where even those who are handicapped or elderly have an easy access to information equipment and receive information services","answer_id":21374},{"id":770,"question":"When an UML is used for business modeling, which of the following is the diagram that can represent a workflow such as the execution sequence of the business processes and branching based on conditions?","answer_label":"Activity diagram","answer_id":5030},{"id":1900,"question":"An apparel manufacturing and selling company is evaluated by value chain analysis. When activities in the company are classified into inbound logistics, productions, outbound logistics, sales/marketing, and services, which of the following is classified as inbound logistics?","answer_label":"Activity to order material, carry out inspections, and manage inventory","answer_id":8808},{"id":3366,"question":"Which of the following is a pricing method that is based on the cost plus method?","answer_label":"Deciding the price by incorporating the desired margin in addition to the\nmanufacturing costs and business expenses","answer_id":14399},{"id":3504,"question":"Which of the following is the characteristic of the cell production system where production is grouped into cells with each cell taking responsibility for the production of each product?","answer_label":"A single worker or a group of several workers completely assembles each product from start to finish.","answer_id":14939},{"id":493,"question":"The sales price of products is decided according to the different sales price setting methods.\nWhich of the following approaches sets a high sales price by using the consumer psychology that high quality equals to high price?","answer_label":"Prestige pricing","answer_id":5811},{"id":6161,"question":"Which of the following is an explanation of ERP?","answer_label":"It is the technique and concept for improvement in management efficiency by planning and controlling the company-wide management resources in an effective and integrated way.","answer_id":24858},{"id":3371,"question":"Which of the following is a specialization-oriented organization that is divided into\ngroups, such as research and development, manufacturing, sales, human resources,\ngeneral affairs, and accounting, according to the type of work performed?","answer_label":"Functional organization","answer_id":14419},{"id":4631,"question":"A server runs a regional web application. It services the requests coming in from all\nregional offices. Each request is completed in 80 milliseconds on average. A total\nof 10 requests per second arrive at the server on average. If the M/M/1 queuing\nmodel can be applied, how many requests are waiting for the service on average?","answer_label":"4","answer_id":19240},{"id":5216,"question":"Which of the following is an explanation of “contact management” that is a basic function of SFA (Sales Force Automation)?","answer_label":"Performing effective sales activities for existing and prospective customers by managing a set of records including customer visiting days and sales results","answer_id":21340},{"id":495,"question":"Which of the following is an example of Consumer Generated Media (CGM)?","answer_label":"A website such as a blog and SNS, etc. through which an individual transmits\ninformation to the general public about the evaluation of products, etc. that he/she has\nused","answer_id":5803},{"id":3676,"question":"Which of the following is “B to C ” in electronic commerce?","answer_label":"Virtual mall","answer_id":15621},{"id":3505,"question":"Which of the following is an appropriate explanation of XBRL?","answer_label":"It is a data description language developed for financial information exchange and reporting, based on XML (eXtensible Markup Language).","answer_id":14942},{"id":4447,"question":"Which of the following is an explanation of knowledge management?","answer_label":"Business is conducted to enhance the problem-solving ability of the entire workforce by sharing information, skills, and understanding dispersed across a company.","answer_id":18590},{"id":2988,"question":"Company Z is planning to start a new project of which the initial investment is 100 million dollars. It is expected to generate cash as shown in the following table. What is the payback period of the new project?\n![](https://learn.viblo.asia/uploads/e/5/e51d0a4e-383e-4062-8875-34ff60ccba34.png)","answer_label":"3.2","answer_id":12938},{"id":1898,"question":"Which of the following is an appropriate sequence of procedure for creating a business Model?\n\nA. Associating a business process with an existing organization\n\nB. Clarifying a business process\n\nC. Associating a business process with an information system\n\nD. Clarifying a data class (information model)\n\nE. Associating a business process with a data class","answer_label":"B → D → E → C → A","answer_id":8800},{"id":2025,"question":"Which of the following is an explanation of an e-marketplace?","answer_label":"It is a method in which many sellers and buyers meet in a market set up on the Internet\nand trade directly without an intermediate distributor.","answer_id":9258},{"id":785,"question":"Which of the following is a description of the ABC analysis?","answer_label":"It arranges products in the order of high sales or high gross profit, divides into levels based on the cumulative ratio, and then plans to increase the volume of the sales of products at the high levels.","answer_id":4971},{"id":3502,"question":"Which of the following is a type of information system that helps companies change or otherwise alter their business strategy and structure and thus create a competitive advantage?","answer_label":"SIS","answer_id":14933},{"id":3409,"question":"According to “competitive strategy” proposed by Philip Kotler, which of the following is the company that has a small market share, but has the strategic aim of increasing income and acquiring a unique position by focusing management resources on particular products and services?","answer_label":"Market nicher","answer_id":14562},{"id":638,"question":"Which of the following is a technique for separating company activities into core activities and support activities for each business function, and analyzing which activities generate the profit derived from the products and services provided to customers?","answer_label":"Value chain analysis","answer_id":5317},{"id":3509,"question":"Which of the following is an appropriate explanation of the Delphi method that is a qualitative and exploratory forecasting approach?","answer_label":"It is a technique of obtaining the most reliable consensus of opinions from a group of experts through a series of questionnaires.","answer_id":14960},{"id":2985,"question":"Which of the following is a part of total quality management?","answer_label":"Designing products and services that meet or exceed customers’ expectations","answer_id":12925},{"id":5137,"question":"When an information system is procured according to the procedure shown in the figure below, which of the following is to be inserted into blank B?\n![](https://learn.viblo.asia/uploads/4/7/474f3012-81c9-4508-8673-bf20591b81db.png)","answer_label":"RFP","answer_id":21023},{"id":4694,"question":"Which of the following is an explanation of BCP (Business Continuity Plan)?","answer_label":"In order to avoid risks of business interruptions or recover promptly from damages, a policy or an activity procedure is prepared in advance.","answer_id":19458},{"id":13840,"question":"When a production plan is created, it is important to select an appropriate production system. Which of the following is a suitable production system for varied and flexible high-mix low-volume production by single or several operators in charge of all processes?","answer_label":"Cell production system","answer_id":53611},{"id":630,"question":"Which of the following is an explanation of SCM (Supply Chain Management)?","answer_label":"The sequence of business operations, from purchasing and production to sales and distribution, is reexamined across companies in view of total optimization, so as to minimize inventory and accelerate delivery.","answer_id":5349},{"id":2086,"question":"Which of the following is a case example that is suitable for ABC analysis?","answer_label":"The hot-selling products need to be analyzed on the basis of the sales value and gross profit of each product.","answer_id":9505},{"id":3498,"question":"In verification of stakeholder requirements, which of the following means the ability to keep track of the process until the implementation of a change request related to a defined requirement is completed?","answer_label":"Traceability","answer_id":14916},{"id":5143,"question":"Which of the following is an appropriate explanation of direct telemarketing?","answer_label":"A type of direct marketing that involves not only selling products on the phone but also asking for donations or opinions","answer_id":21045},{"id":1783,"question":"PEST analysis is used for analyzing the external environment in determining a business strategy. What are the external environmental factors the PEST analysis analyzes?","answer_label":"Politics, Economics, Society, Technology","answer_id":8339},{"id":3674,"question":"Which of the following describes the characteristics of niche strategy in the context of competitive strategy?","answer_label":"Specializing in a market segment where other companies cannot enter easily to achieve higher profitability","answer_id":15614},{"id":5150,"question":"The figure below shows each break-even point of Company A and Company B. Which of the following is an appropriate description concerning the benefit-risk analysis of the two companies?\n![](https://learn.viblo.asia/uploads/9/0/90a5fd04-53d5-4a10-877d-c1de42c42317.png)","answer_label":"The variable cost ratio of Company A is lower than Company B, and therefore, when the sales above the break-even point are equal, the profit of Company A is higher than Company B.","answer_id":21075},{"id":3673,"question":"Which of the following is an advantage of M&A?","answer_label":"A company can establish a new business in a short period of time by acquiring skills and know-how that it does not have.","answer_id":15609},{"id":6173,"question":"The table below shows records of purchase and withdrawal for a component. When the first-in first-out method is applied, which of the following is the unit price of the withdrawal on April 10?\n![](https://learn.viblo.asia/uploads/2/c/2c5f0760-3dbb-4b59-972a-c4a8ef69f9d8.png)","answer_label":"110","answer_id":24907},{"id":2058,"question":"Which of the following is regarded as risk sharing or risk transfer?","answer_label":"Distributing risk to other parties by purchasing insurance","answer_id":9391},{"id":13839,"question":"Which of the following is one of the main characteristics of a blockchain?","answer_label":"A distributed ledger on a peer to peer network","answer_id":53608},{"id":2839,"question":"Which of the following is an appropriate explanation of tethering as a function of cell phones?","answer_label":"By using a cell phone as a modem or access point, data communication that uses a network, such as the Internet, is enabled on a PC, game console, or other such devices.","answer_id":12356},{"id":1784,"question":"Which of the following is an explanation of the IoT (Internet of Things)?","answer_label":"It refers to the installation of communication functionality to various objects, in addition to information and communication devices, and enabling automatic recognition or remote measurement by connecting these to the Internet, to achieve high-level decision-making services and automated control through the collection and analysis of large volumes of data.","answer_id":8346},{"id":1780,"question":"Which of the following is an appropriate description of an RFI?","answer_label":"It is a document used to request information concerning computerization from prospective suppliers such as system vendors.","answer_id":8330},{"id":5138,"question":"Which of the following is an explanation of core competence management?","answer_label":"Management is centered on proprietary know-how and technology that are not easy for other companies to imitate.","answer_id":21028},{"id":3364,"question":"Among the four stages, introduction, growth, maturity, and decline in the product life\ncycle, which of the following is a characteristic of the growth stage?","answer_label":"Customers are aware of product, and as a result, sales increase. However, profits\nmight sometimes decline for the company that first introduced the product, because\ncompetitors enter the market.","answer_id":14390},{"id":5147,"question":"Which of the following is a technique by which useful information and relationships are discovered and extracted from large amounts of customer and market data retained by a company?","answer_label":"Data mining","answer_id":21063},{"id":5218,"question":"When a company’s business is divided into four categories A through D as shown in the figure below, which of the following is the characteristic of the business that is classified as category B?\n![](https://learn.viblo.asia/uploads/3/c/3caf3c07-16d9-49c8-8910-ba5b5af359fe.png)","answer_label":"It is currently generating a large inflow of cash, but it also needs continuous investment into the future.","answer_id":21347},{"id":2982,"question":"The basic elements and examples of devices and services when IoT is used in the equipment maintenance tasks of a factory are compiled as shown below. When a) through d) correspond to any one of A through D, which of the following corresponds to A?\n![](https://learn.viblo.asia/uploads/6/6/6643a0dc-2b4c-4319-a14c-eb3468fa479b.png)","answer_label":"Temperature sensor for equipment","answer_id":12915},{"id":3410,"question":"When the effect of improvement is quantitatively evaluated, a weighted overall evaluation is used as a method of integrating and quantifying the results of the evaluation of multiple items. Which of the following is the improvement proposal that should be prioritized in the table below?\n\n![](https://learn.viblo.asia/uploads/b/9/b9eaea7d-40e6-40a7-be59-3abbe9ea1ee9.png)","answer_label":"Proposal 2","answer_id":14564},{"id":3420,"question":"Which of the following is the form of organization that has the characteristics (1) through (4) described below?\n(1) The organization is formed by assembling necessary experts from all departments to achieve strategic objectives.\n(2) The organization is a strategic organization that responds to changes in the environment, and is independent of functional departments.\n(3) The organization has the flexibility to dissolve if the expected objectives are achieved.\n(4) A task force team belongs to this form of organization.","answer_label":"Project organization","answer_id":14606},{"id":5148,"question":"Which of the following is a qualitative and exploratory forecasting approach that is used for obtaining the most reliable consensus of opinions from a group of experts through a series of questionnaires?","answer_label":"Delphi method","answer_id":21066},{"id":492,"question":"Which of the following is a marketing technique used to provide incentives for distributors by applying conditions such as kickbacks and rebates, and increase the demands of consumers?","answer_label":"Push strategy","answer_id":5814},{"id":4575,"question":"![](https://learn.viblo.asia/uploads/d/9/d9fed483-a033-4c04-99a9-304cfe355a6f.png)","answer_label":"d","answer_id":19032},{"id":1655,"question":"Which of the following is an explanation of CAD?","answer_label":"By using computers, creating drawings of the product design from attribute data\r\nconcerning product shape, composition, etc","answer_id":7748},{"id":2844,"question":"Three products, A, B, and C, are processed by two (2) machines, M1 and M2. Processing must be conducted in the order of M1 → M2. The time required for each machine to process each product is shown in the table below. Under these conditions, which of the following is the processing order of three (3) products that results in the shortest time from the beginning of the processing until all products are finished? Here, when M1 has processed a product, it can successively process another product.\n![](https://learn.viblo.asia/uploads/e/6/e6ac8101-6ad1-4362-8d4d-5e4492f4cab0.png)","answer_label":"b","answer_id":12376},{"id":786,"question":"Which of the following is a financial statement that represents the assets, liabilities, and net assets of a company at a certain point of time and indicates the financial situation of the company?","answer_label":"Balance sheet","answer_id":4966},{"id":6315,"question":"![](https://learn.viblo.asia/uploads/0/5/05730e18-d405-48f1-8fb5-2dcb4459d8b5.png)","answer_label":"d","answer_id":25410},{"id":1785,"question":"Which of the following is an explanation of benchmarking used for corporate management?","answer_label":"It refers to a qualitative and quantitative understanding of a company’s own products, services, and operation through comparison with those of competitors or advanced companies.","answer_id":8347},{"id":5223,"question":"Which of the following is an appropriate explanation of EDI?","answer_label":"A method for electronically exchange of business data between computers over a network, based on standard formats and protocols","answer_id":21366},{"id":3412,"question":"Which of the following is an explanation of the long tail?","answer_label":"The long tail refers to the situation where the sales percentage for a group of poor-selling products cannot be ignored in terms of the total sales of Internet shopping.","answer_id":14574},{"id":777,"question":"Which of the following marketing approaches is for the push strategy?","answer_label":"A manufacturer does his/her best to predict what customers want before producing an item or service.","answer_id":5003},{"id":13834,"question":"In a growth matrix proposed by Ansoff, which of the following is a strategy for an organization that tries to expand a business by introducing new products into new markets?","answer_label":"Diversification","answer_id":53586},{"id":6172,"question":"Which of the following is an appropriate description concerning financial indicators?","answer_label":"The total capital profit ratio is the ratio of profit to gross capital. As the value is larger, profitability is higher.","answer_id":24905},{"id":2837,"question":"In IT investment opportunities, when the investment effect of five (5) years is evaluated on the basis of ROI (Return On Investment), which of the following four (4) opportunities A through D has the greatest effect? Here, the IRR (Internal Rate of Return) is zero (0).\n![](https://learn.viblo.asia/uploads/b/7/b7a71378-bc43-4061-b512-724265812463.png)","answer_label":"A","answer_id":12347},{"id":2084,"question":"Which of the following is an organization structure where employees report to both their individual immediate managers and a cross function leader and try to achieve coordination between program groups and centrally controlled groups of functional specialists?","answer_label":"Matrix organization","answer_id":9496},{"id":3367,"question":"Which of the following is a characteristic of an IC tag (i.e., RFID)?","answer_label":"An IC tag is resistant to dirt, and the recorded information is accessible from outside\nthe packaging","answer_id":14403},{"id":5140,"question":"A SWOT (Strengths, Weaknesses, Opportunities, Threats) analysis is a technique that is used  to  identify  and  evaluate  the  internal  and  external  factors  that  are  helpful  or  harmful  to  achieving  the  objectives  of  business  organizations  or  projects.      Which  of  the following is the appropriate matrix that shows a combination of those factors?\n![](https://learn.viblo.asia/uploads/6/d/6df6a192-0027-46c0-a89d-f8322ff5d49a.png)","answer_label":"c","answer_id":21035},{"id":1901,"question":"A company has planned to provide a product with a fixed cost of $128,000, a variable cost per unit of $48, and a selling price per unit of $80. Which of the following is the point of sales ($) to become break-even?","answer_label":"320000","answer_id":8812},{"id":3418,"question":"Which of the following is the forecasting technique that performs the procedure below in order to address problems that involve future prediction difficult to make by using other techniques?\n\n[Procedure]\n(1) Select some experts as respondents to questions.\n(2) Aggregate the responses to questions for use in feedback, and ask questions again.\n(3) Process the responses statistically, and present the responses together with their\ndistribution.","answer_label":"Delphi method","answer_id":14597},{"id":2076,"question":"Which of the following is the purpose of defining a business model at the planning stage of total optimization in an information strategy?","answer_label":"To organize the relationships between a company’s entire business operations and their utilized information, and establish a clear vision for the information system","answer_id":9464},{"id":3506,"question":"Which of the following is the organizational structure that is given the authority and responsibility as an intrapreneur who performs a project as a semi-independent business unit and takes full responsibility for the outcome of the project?","answer_label":"In-house venture organization","answer_id":14948},{"id":2070,"question":"Which of the following is the most appropriate description concerning a backup method for data","answer_label":"In consideration of a possible response delay in business processing, a backup schedule is adjusted so that it does not overlap with business processing.","answer_id":9438},{"id":496,"question":"Which of the following indicates a price setting method based on the cost plus approach?","answer_label":"Deciding the price by incorporating the desired margin with reference to the\nmanufacturing cost and business expenses","answer_id":5793},{"id":3421,"question":"The relationship between the value “x” of a certain factor in the manufacture of a product and the value “y” of a quality characteristic for the product is plotted as shown in the figure below,. Which of the following can be understood from this figure?\n\n![](https://learn.viblo.asia/uploads/2/a/2a04da9c-6d89-4675-acaf-bb467a4fc079.png)","answer_label":"The correlation coefficient of x and y is negative.","answer_id":14608},{"id":13836,"question":"Heskett classified customers into four categories and explained the importance of improving customer satisfaction. Which of the following types of customers is dissatisfied and, if given a chance, would encourage others to switch as well?","answer_label":"Terror","answer_id":53597},{"id":2023,"question":"Which of the following is an appropriate explanation of the “Question mark” product in the product portfolio management (PPM) matrix?","answer_label":"It needs significant investments to nurture owing to a small rate of market share and a\nhigh rate of market growth.","answer_id":9252},{"id":2980,"question":"Which of the following is an appropriate example of a core technology?","answer_label":"It is an idling stop technology of an automobile engine that cannot be imitated by competitors.","answer_id":12907},{"id":769,"question":"Which of the following is a case that enables the customer support operations at a call center to improve the quality by applying a pattern recognition function or machine learning function to the accumulated data?","answer_label":"Deriving the most appropriate response in real time from the related materials and all the previous support history according to the content of the inquiry made by a customer","answer_id":5034},{"id":2259,"question":"The figure below is the work procedure of MRP (Material Requirements Planning), a\ntechnique of a production management system. Which of the following information to be\ninserted into A in the figure below is necessary for calculating the net requirements?\n![](https://learn.viblo.asia/uploads/d/c/dce8d118-1be2-4b28-9957-65d8c42c6071.png)","answer_label":"Inventory status (inventory amount, residual orders, in-process quantity)","answer_id":10123},{"id":3415,"question":"Which of the following is an explanation of RFID?","answer_label":"RFID is a combination of an extremely small integrated circuit and an antenna, which is used for an electronic tag that enables an object to be identified and located by using the wireless automatic recognition technique.","answer_id":14583},{"id":3500,"question":"The marketing strategies are categorized into four basic types: leader, challenger, follower, and nicher. The market follower is a firm that is not a market leader and that does not attempt to be a market leader. In addition, the follower can often find the reinvention of ideas easier than the originators. Which of the following is the basic strategy of the follower as a competitive position?","answer_label":"Imitation strategy for quickly responding to market opportunities","answer_id":14924},{"id":2834,"question":"According to the “competitive strategy” by Philip Kotler, which of the following is a company that has no high market share, but has the strategic aim of achieving high profits and acquiring a unique position by focusing management resources on particular products and services?","answer_label":"Market nicher","answer_id":12338},{"id":5144,"question":"Which of the following is an appropriate example of the effective utilization of RFID?","answer_label":"Identification and control of humans or objects by using a small wireless chip","answer_id":21049},{"id":2026,"question":"Which of the following is an explanation of a smart grid?","answer_label":"It is a system that aims at the utilization of recyclable energy, supply of stable electric\npower, and optimum demand adjustment through the integrated control of power\ngeneration and power consumption based on communication and information-processing\ntechnology.","answer_id":9262},{"id":1657,"question":"There is an enterprise whose current liabilities valued 2,400 dollars and the current assets valued 5,000 dollars including inventory assets valued 200 dollars. What is an acid test ratio (in percentage) of the enterprise?","answer_label":"200","answer_id":7757},{"id":1651,"question":"Which of the following is a description of the growth stage of the product life cycle?","answer_label":"It is the stage at which sales increase rapidly. The market becomes active and the\r\ncompetition intensifies because of new market participants.","answer_id":7734},{"id":2027,"question":"There is a language defined by a context-free grammar with the production rules below:\n\nE $\\to$ T + E | T\n\nT $\\to$ F * T | F\n\nF $\\to$ ( E ) | C\n\nC $\\to$ 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 \n\nIn this grammar, non-terminals are E, T, F, and C; terminals are parentheses, plus sign,\nasterisk, and numbers; E is the start symbol. Which of the following shows that the\nexpression 7 + 3 * (6 + 4) is a sentence of this language?","answer_label":"E $\\to$ 7 + 3 * (F + T)","answer_id":9266},{"id":4691,"question":"Which of the following is an appropriate explanation of product innovation in the management of technology?","answer_label":"Developing new products or products differentiated from other companies","answer_id":19444},{"id":3679,"question":"The sales staff at Company A wants to depart from Company A, visit customer companies B, C, and D once, respectively, and return to Company A. The table shows time required to move from one company to another. How long is the shortest time (in minutes) required for the visit?\n![](https://learn.viblo.asia/uploads/8/a/8a3d6982-f044-447f-9c8a-b8f34769da55.png)","answer_label":"110","answer_id":15632},{"id":2987,"question":"There are several quality control tools that have been used primarily for manufacturing and inspection departments. Which of the following sets two corresponding types of data on the vertical and horizontal axes, after which the measured values are plotted?","answer_label":"Scatter diagram","answer_id":12936},{"id":4693,"question":"When production is planned based on the calculation formula and table shown below, what is the value for production plan C ? Here, the carry-over inventory on April 1 is equal to 400 pieces of the actual inventory on March 31.\n![](https://learn.viblo.asia/uploads/a/5/a5883285-9818-4b0d-90e9-9b920ba0ed7f.png)","answer_label":"4,850","answer_id":19454},{"id":6169,"question":"When the relationship between the value “x” of a certain factor in manufacturing a product and the value “y” of a quality characteristic for the product is plotted in a chart, which of the following charts has the positive correlation coefficient between x and y?\n![](https://learn.viblo.asia/uploads/4/5/456bab15-1a0d-4289-b32a-f27333ae94c0.png)","answer_label":"b","answer_id":24891},{"id":4445,"question":"Which of the following is an explanation of core competence adopted in business administration?","answer_label":"It refers to a bundle of a company’s unique skills and technologies that are the source of competitive superiority and are superior to those of competitors.","answer_id":18581},{"id":4448,"question":"A restaurant is to be opened for business under the conditions shown below. In order to make the monthly profit of 50,000 dollars, how many customers are necessary for each seat per business day?\n![](https://learn.viblo.asia/uploads/3/e/3e6ca9ef-4b0c-4e43-8d35-a089fb7f8cba.png)","answer_label":"3","answer_id":18594},{"id":3677,"question":"In an arrow diagram shown below, at least how many days are needed to complete all the activities A through J ? Here, in the diagram, each number shown beside the arrow indicates the number of days required for the activity.\n![](https://learn.viblo.asia/uploads/f/f/ff558426-afae-436a-81c4-f07d435c4d11.png)","answer_label":"11","answer_id":15626},{"id":2977,"question":"In SWOT analysis, which of the following is generally positioned as a threat?","answer_label":"Entry of strong companies in the market","answer_id":12893},{"id":5139,"question":"In the product life cycle, which of the following is the stage where the market begins to understand the value of the product, and both product lines and sales channels need to be expanded?","answer_label":"Maturity stage","answer_id":21032},{"id":2833,"question":"A SWOT analysis is a technique that is used to identify and evaluate the internal and external factors that are advantageous or disadvantageous to achieve the objectives of the business or project. When a company’s situation is analyzed as shown in the table below, which of the following is the most appropriate combination that corresponds to the company’s Strengths that give the company advantages over others, Weaknesses that give the company disadvantages relative to others, Opportunities that are exploited for the company’s advantages, and Threats that cause troubles for the business or project?\n![](https://learn.viblo.asia/uploads/9/a/9aa58928-2381-4350-a31b-4bee0af12fb7.png)\n![](https://learn.viblo.asia/uploads/c/b/cb59ffa5-939b-4815-98ca-03ec6796d102.png)","answer_label":"c","answer_id":12333}]