[{"id":13790,"question":"Which of the following is an appropriate description of flash memory","answer_label":"The content can be erased electrically in units of blocks.","answer_id":53412},{"id":5085,"question":"The magnetic head of a hard disk drive is currently positioned at cylinder number 100, and  the  cylinder  numbers  120,  90,  70,  80,  140,  110,  and  60  are  lined  up  in  the  I/O  request  queue.      What  is  the  total  number  of  cylinders  that  the  head  moves  to  satisfy  the conditions below? \n[Conditions] \n(1) The  seek  optimization  method  is  applied  to  I/O  requests,  which  are  sorted  in  order  of  increasing  cylinder  number  so  that  the  head  can  move  in  the  same  direction to the extent possible. \n(2)  The head is currently moving in the direction where cylinder number increases. \n(3)   When  there  are  no  more  I/O  requests  in  the  current  direction,  the  direction  of  movement is reversed. \n(4)  The results are not affected by the processing order of I/O requests. \n(5)  New I/O requests do not occur during the process.","answer_label":"120","answer_id":20814},{"id":518,"question":"An operating system (OS) chooses a process for CPU execution based on a scheduling algorithm. Consider four processes, P1, P2, P3, and P4, and their corresponding arrival times along with their burst times shown in the table below. Which of the following is the correct combination of waiting times for the processes to be executed in the First-Come-First-Serve (FCFS) scheduling algorithm? Here, the arrival time is the time at which a process arrives in the ready queue, the burst time is the time required by a process for CPU execution, and the waiting time is the period of time spent by a process in the ready queue for CPU to start the execution.\n(Unit: millisecond)\n\n| Process | Arrival time | Burst Time |\n| -------- | -------- | -------- |\n| P1 | 0 | 6 |\n| P2 | 2 | 4 |\n| P3 | 4 | 9 |\n| P4 | 5 |  7 |\n\n\n\n\n| | P1 | P2 | P3 | P4 |\n| -------- | -------- | -------- | -------- |-------- |\n| a) | 0 | 2 | 4 | 5 |\n| b) | 0 | 4 | 6 | 14 |\n| c) | 6 | 4 | 9 | 7 |\n| d) | 6 | 6 | 13 | 12 |","answer_label":"b","answer_id":5547},{"id":5957,"question":"When a certain RISC processor has a 5-stage instruction pipeline, how long (in nanoseconds) does it take to continuously execute 7 instructions excluding branch/jump instructions? Here, it takes 1.5 nanoseconds to complete each stage. In addition, any delay, such as pipeline stall and bubble, does not occur during the execution of those instructions.","answer_label":"16.5","answer_id":24041},{"id":5088,"question":"In reliability design, which of the following is an appropriate example of fail-soft?","answer_label":"In a system with a cluster configuration, even when a server does not work, another server takes over applications and provides functions.","answer_id":20825},{"id":3813,"question":"Which of the following is a term that shows the amount of work that is processed per unit of time by a computer system?","answer_label":"Throughput","answer_id":16140},{"id":1610,"question":"Which of the following is an appropriate explanation of the spooling function?","answer_label":"The overall processing power of a system is enhanced by performing data transfer\r\nbetween the main storage and low-speed input/output devices via auxiliary storage\r\ndevices.","answer_id":7570},{"id":725,"question":"Which of the following is a method that performs data transfer between the main memory and a low-speed output device via a high-speed auxiliary storage device to increase the throughput of the entire system?","answer_label":"Spooling","answer_id":5212},{"id":6380,"question":"Which of the following is the appropriate explanation of spooling?","answer_label":"Output data to a low speed device such as a printer is temporarily stored on a high speed hard disk and later sent as output to that target device.","answer_id":25648},{"id":807,"question":"Which of the following is a characteristic of DRAM?","answer_label":"The memory cell structure is simple, so high integration is possible and a low price per bit can be achieved.","answer_id":4884},{"id":1858,"question":"Which of the following is the computer architecture where a processor executes the same\nInstruction on multiple data?","answer_label":"SIMD","answer_id":8641},{"id":6066,"question":"Which of the following appropriately describes “memory interleaving” that is one of the high-speed computer technologies?","answer_label":"It is a method for dividing the memory into multiple independently-operating groups and accessing each group in parallel.","answer_id":24478},{"id":3324,"question":"There are cases where the unused storage space is divided into lots of small and\nisolated areas because of repeated allocation and release of storage area by an OS.\nWhich of the following is the terminology applicable to such cases?","answer_label":"Fragmentation","answer_id":14230},{"id":4406,"question":"![](https://learn.viblo.asia/uploads/2/2/2207a059-a0e8-4afa-bf8e-80047c9e7422.png)","answer_label":"d","answer_id":18440},{"id":6119,"question":"In an online transaction system environment, which of the following represents the interval of time from the time the system completes receipt of an input to the time the system begins to return its resulting output?","answer_label":"Response time","answer_id":24692},{"id":2041,"question":"Which of the following is an appropriate explanation concerning a memory leak?","answer_label":"Part of main memory occupied during application execution is not released because of a bug of the application or OS, and the usable space of main memory decreases.","answer_id":9324},{"id":443,"question":"To determine an effective address from the value recorded in the address part of instruction, various addressing modes are used. Which of the following modes uses the value of the address part as an effective address?","answer_label":"Absolute addressing","answer_id":6012},{"id":6076,"question":"Which of the following is the primary purpose to use RAID?","answer_label":"To ensure higher reliability and/or performance","answer_id":24519},{"id":583,"question":"There exists a device with an MTBF of forty-five (45) hours and an MTTR of five (5) hours. What is the availability of a system that connects two (2) such devices in series?","answer_label":"0.81","answer_id":1831},{"id":6377,"question":"Which of the following is widely used as a computer port for a modem connection?","answer_label":"Serial port","answer_id":25637},{"id":522,"question":"The figure shows the storage sequence of instructions fetched by a processor. Which of the following corresponds to a?\n![](https://learn.viblo.asia/uploads/7/7/771f1f97-9829-4de1-b3cb-ab3a25ef3d33.png)","answer_label":"Instruction register","answer_id":5532},{"id":2786,"question":"Which of the following is an open source integrated development environment that includes software and support tools for application development?","answer_label":"Eclipse","answer_id":12143},{"id":4767,"question":"With which of the following task scheduling methods is it highly possible for a specific task to continue to wait for the allocation of CPU resources?","answer_label":"The task with the shortest estimated processing time is executed first. The next task is initiated when the currently executed task is completed or suspended for some reason.","answer_id":19704},{"id":5081,"question":"Which of the following is a role of the program register (i.e., program counter) of the CPU?","answer_label":"In order to read out an instruction, it contains the address where the next instruction is stored.","answer_id":20800},{"id":4289,"question":"A computer is designed to enable pipeline control so that each instruction can be completed in five cycles. How many cycles are needed to execute 20 instructions? Here, all instructions can be executed without being stopped halfway.","answer_label":"24","answer_id":18020},{"id":6084,"question":"Which of the following is the language processing program that generates, on a certain computer, object programs that can be executed on another computer that has a different instruction set?","answer_label":"Cross compiler","answer_id":24550},{"id":1860,"question":"Which of the following is used to translate a logical address generated by a CPU into a physical address?","answer_label":"Memory Management Unit (MMU)","answer_id":8649},{"id":2926,"question":"As shown below, there is a set of processes, with the length of the CPU-burst time given in milliseconds, and the processes arrive in the order of P1, P2, P3, P4, and P5 with the arrival time of all processes at t = 0.\n![](https://learn.viblo.asia/uploads/b/7/b774a91a-b13c-4789-84c2-d3b734c806cf.png)\n\nWhich of the following is the average turnaround time of five (5) processes from P1 through P5 with the first-come first-served (FCFS) scheduling algorithm?","answer_label":"25","answer_id":12692},{"id":1805,"question":"As shown the figure and table below, there are two types of CPUs X and Y that have the same configuration except that the access times of cache memory and main memory are different from each other. All other conditions of the two CPUs are the same.\nWhen a certain program is executed on both CPU X and CPU Y, the processing time of each CPU is the same. Under these conditions, what is the hit ratio of the cache memory? Here, there are no effects from other than CPU processing.\n![](https://learn.viblo.asia/uploads/5/5/5595ee46-0ad4-437d-a5c6-243931383f75.png)","answer_label":"0.90","answer_id":8428},{"id":4591,"question":"Which of the following is an appropriate description concerning the characteristics of\nUSB?","answer_label":"It has three data transfer modes: high-speed mode for external hard disks, full-speed\nmode for printers and scanners, and low-speed mode for keyboards and mice.","answer_id":19079},{"id":528,"question":"Which of the following is a sequential circuit that has two (2) stable states?","answer_label":"Flip-flop","answer_id":5516},{"id":1812,"question":"Among the descriptions concerning process scheduling, which of the following is an appropriate explanation of the round robin method?","answer_label":"CPU resources are allocated to the first executable process in the queue when an interval-timer interrupt is generated.","answer_id":8457},{"id":510,"question":"A CPU has a clock frequency of 2.0 GHz. When the instructions consist of three types, as shown in the table below, what is the approximate CPU performance in MIPS?\n\n| Type | Execution time (clocks) | Frequency of appearance (%) |\n| -------- | -------- | -------- |\n| Instruction 1 | 15 | 40 |\n| Instruction 2 | 10 | 20 |\n| Instruction 3 | 10 | 40 |","answer_label":"167","answer_id":5560},{"id":1818,"question":"A D/A (digital-to-analog) converter with a resolution of 8 bits generates the output voltage 0 volts for the digital input value 0, and the output voltage 2.5 volts for the digital input value 128. When the lowest one bit of the digital input value is changed, which of the following is the change (in volts) of the output voltage that is generated by the D/A converter?","answer_label":"2.5/128","answer_id":8479},{"id":2932,"question":"By using a sensor that detects changes in shape, the condition of infrastructure such as elevated highways can be monitored and maintained. Which of the following is a sensor that is used for this purpose?","answer_label":"Strain gage","answer_id":12715},{"id":1810,"question":"Which of the following is the most appropriate explanation of a benchmark test for a computer system?","answer_label":"The processing performance of a system is compared with other systems in terms of scores obtained by executing software for measurement.","answer_id":8449},{"id":717,"question":"For a processor running at 50 MIPS, what is the average execution time per instruction?","answer_label":"20 ns","answer_id":5238},{"id":5087,"question":"Which of the following is an essential activity for achieving a fault tolerant system?","answer_label":"Providing  redundancy  for  a  system  configuration  to  minimize  the  effect  of  a  component failure so that the processing can be continued without any effect on the overall system","answer_id":20823},{"id":3450,"question":"Which of the following is the method of improving the throughput of the entire system by transferring data from main memory to a low-speed output device via a high-speed auxiliary storage device?","answer_label":"Spooling","answer_id":14724},{"id":6122,"question":"There are some methods of getting backup files for the purpose of recovering files and managing generations. Which of the following is an appropriate description concerning those methods or procedures?","answer_label":"A differential backup contains all files changed after the last full backup, while an incremental backup saves all files changed after the last full, differential, or incremental backup.","answer_id":24702},{"id":2924,"question":"Which of the following is an appropriate explanation of a benchmark test?","answer_label":"It executes a standard program selected in accordance with the usage purpose, and measures the system’s processing performance.","answer_id":12683},{"id":13784,"question":"The life cycle of a computer system can be classified from the viewpoint of failure into the three periods of early failure period, random failure period, and wear-out failure period. Which of the following is the most appropriate description of the measures in the early failure period?","answer_label":"Strengthening the design review and failure analysis in order to reduce errors in the design and manufacturing","answer_id":53389},{"id":527,"question":"Which of the following is the OSS that is provided as an integrated development environment for software?","answer_label":"Eclipse","answer_id":5519},{"id":6033,"question":"When a color image is stored in video memory at a tonal resolution of 24 bits per pixel, approximately how many megabytes (MB) are required to display the image on the screen with a resolution of 1024x768 pixels? Here, 1 MB is 10^6 bytes.","answer_label":"2.4","answer_id":24345},{"id":6082,"question":"Which of the following shows the system configuration that can operate with an overall system availability of $(1-(1-A)^2)^2$? Here, the element X is a processor with an availability of A. Also, the segment connected in parallel is considered operating if either of the two processors is operating. However, the segment connected in series is considered operating only when both processors are operating.\n![](https://learn.viblo.asia/uploads/1/f/1fbefff2-9dec-4048-92c8-713b14ea9b19.png)","answer_label":"d","answer_id":24545},{"id":6378,"question":"A  certain  computer  system  runs  in  a  multi-programming  environment  using  a  non-preemptive “shortest job first ” algorithm.    In this system, four processes A, B, C, and D  arrive  sequentially  in  the  process  queue  every  1  millisecond.    The  table  shown  below includes estimated execution time for each process; for example, process A uses CPU, I/O, and then CPU sequentially for 4, 5, and 5 milliseconds respectively.    When 14  milliseconds  elapse  after  the  arrival  of  the  first  process  A,  which  of  the  following  processes  is  executed  in  CPU?      Here,  the  multi-processing  overhead  of  OS  can  be  ignored, and both CPU and I/O operations can be executed concurrently.   \n![](https://learn.viblo.asia/uploads/b/5/b5403642-91ec-4488-af5c-07ba98271d50.png)","answer_label":"C","answer_id":25640},{"id":6071,"question":"Which of the following is a method whereby  the relevant program is read into main memory and the CPU reads out and executes it sequentially?","answer_label":"Stored program method","answer_id":24500},{"id":724,"question":"Which of the following is an appropriate explanation of paging?","answer_label":"A method of memory management in which the virtual memory space and real memory space are divided into fixed-length blocks for management","answer_id":5217},{"id":4408,"question":"![](https://learn.viblo.asia/uploads/3/2/32f3db8d-9fb2-48de-85ee-5df6dc0bd515.png)","answer_label":"c","answer_id":18446},{"id":4307,"question":"There is a CPU whose clock cycle time is 0.01 microsecond. The table below shows a program’s instruction mix executed on the CPU. What is the approximate MIPS value for the processor?\n![](https://learn.viblo.asia/uploads/3/e/3e5ee36c-3f91-458e-83b5-c7db405ca305.png)","answer_label":"18.02","answer_id":18092},{"id":3618,"question":"Which of the following is an optical disc that uses organic dye for the recording layer of the storage media and makes the traces of burning by laser light called pits to record the data?","answer_label":"CD-R","answer_id":15387},{"id":3448,"question":"In an on-line real-time system, there occur transactions at a frequency of 20 times per second. Each of the transactions is completed after it performs the CPU processing once and the hard disk I/O processing four times. The I/O processing time of a hard disk drive is 40 milliseconds per each I/O, and the CPU processing time is negligibly small. When each hard disk drive is accessed evenly, at least how many hard disk drives are required for this transaction processing?","answer_label":"4","answer_id":14715},{"id":6070,"question":"Which of the following appropriately describes a method of recording data on CD-R?","answer_label":"Laser beams are radiated onto an organic dye layer in a disk.  As a result, a series of burned spots called pits are created on that layer, thereby recording the data.","answer_id":24495},{"id":13779,"question":"Which of the following is a characteristic of a RISC processor when it is compared with a CISC processor?","answer_label":"The RISC processor uses a uniform instruction length to process tasks in a pipeline.","answer_id":53367},{"id":6060,"question":"Which of the following leads to the von Neumann bottleneck?","answer_label":"Data transfer speed between CPU and main memory","answer_id":24456},{"id":6080,"question":"Which of the following appropriately describes a dual system?","answer_label":"Two systems perform the same processing, and the processed results are collated to confirm the correctness of the processing. If a fault occurs in either system, processing continues in degraded operation.","answer_id":24537},{"id":4769,"question":"Which of the following is the appropriate purpose of using semaphores?","answer_label":"For managing shared resources","answer_id":19713},{"id":6034,"question":"How many memory cells (or latches for holding 1 bit each) are implemented in SRAM with 24 address lines and 16 data lines?","answer_label":"2^24x16","answer_id":24351},{"id":2778,"question":"Which of the following lists contain A through D in the order of shorter effective memory access time of the main memory?\n![](https://learn.viblo.asia/uploads/8/f/8fd50d94-2c6c-4fd3-a7fc-2e66cff590ec.png)","answer_label":"A, D, B, C","answer_id":12112},{"id":4298,"question":"Which of the following is the most appropriate index indicating the performance of a laser printer?","answer_label":"Number of dots per inch (2.54 cm) and number of pages that can be printed per minute","answer_id":18054},{"id":729,"question":"Which of the following is an appropriate explanation of the function of an actuator?","answer_label":"It changes an electrical control signal that is supplied by a computer into a mechanical motion.","answer_id":5195},{"id":5095,"question":"For the purpose of monitoring the execution process of a program in order of time, which of the following is used as a dynamic debugging tool that records the contents of the memory and registers as well as the execution sequence of program instructions?","answer_label":"Tracer","answer_id":20856},{"id":4296,"question":"What is an advantage of DVD-RAM in comparison with DVD-RW and DVD+RW?","answer_label":"More durable rewritable disc","answer_id":18048},{"id":6040,"question":"Which of the following is the appropriate explanation of throughput?","answer_label":"It is the number of jobs processed per unit time. Spooling helps to improve throughput.","answer_id":24374},{"id":4287,"question":"The figure shows an RS flip-flop using two NOR gates. Which of the following is the correct truth table for the flip-flop? Here, “unchanged” show in the table means the outputs maintain a previous state, and “unstable” means the outputs are in an unstable state.\n![](https://learn.viblo.asia/uploads/c/9/c96c8a35-20e9-4508-859a-4dfac865e9d2.png)","answer_label":"a","answer_id":18010},{"id":1761,"question":"Which of the following logic circuits meets the condition described below?\n\n(Condition)\nA light is turned on and off by using switches A and B located at the top and bottom of the stairs. The light can be turned on and off by using one switch, regardless of the status of the other switch.\n![](https://learn.viblo.asia/uploads/0/d/0d5485d0-a834-42bd-b604-6309dc235eb7.png)","answer_label":"XOR","answer_id":8254},{"id":5094,"question":"Which of the following is the language processor that translates and executes a source program written in high-level language, on a line-by-line basis?","answer_label":"Interpreter","answer_id":20852},{"id":6037,"question":"Which of the following is an appropriate explanation of TCO?","answer_label":"Total cost required throughout the life cycle of a system","answer_id":24363},{"id":2788,"question":"Which of the following is a logical expression that is equivalent to the digital circuit shown in the figure below? Here, “•” is the logical product, “+” the logical sum, and “ ![](https://learn.viblo.asia/uploads/9/2/92a24cbd-be44-430b-9b80-a3264baa019c.png)\n ” the negation of X.\n![](https://learn.viblo.asia/uploads/f/6/f68293ff-4ff1-449e-afb1-76393ab0d756.png)","answer_label":"![](https://learn.viblo.asia/uploads/7/e/7e544a0c-379a-47bb-ab72-7ad451fdff69.png)","answer_id":12153},{"id":6123,"question":"Which of the following circuits can  write  out  “1” to the  output line Z only when the input lines X and Y have the same value?\n![](https://learn.viblo.asia/uploads/c/e/ce3317a4-94d3-41a8-afa7-a8662f92ed93.png)","answer_label":"c","answer_id":24708},{"id":6062,"question":"The instruction pipeline is a technique used in order to improve the CPU performance. Instructions are divided into stages and moved through the processor. An RISC processor has five-stage pipeline (Instruction fetch, Instruction decode, Execute, Memory access, Register write back) and can accept a new instruction at every clock cycle. How many clock cycles does this processor take for completion of the execution of 10 instructions? Here, there are no pipeline stalls, such as branch stall, load stall, and so on.","answer_label":"14","answer_id":24462},{"id":1866,"question":"Which of the following is an appropriate explanation for a non-preemptive scheduling Method?","answer_label":"A task cannot move to a running state until another task in the running state either moves to the waiting state by itself or finishes.","answer_id":8671},{"id":797,"question":"Which of the following is an appropriate explanation of memory interleaving?","answer_label":"It allows CPU to access different banks of the main memory simultaneously.","answer_id":4922},{"id":5091,"question":"In memory pool management of a real time system using various sizes of memory resources, which of the following is an appropriate characteristic of the fixed-length method in comparison with the variable-length method?","answer_label":"The memory efficiency is poor, and the processing speed for allocation and deallocation is fast and constant.","answer_id":20839},{"id":3807,"question":"Which of the following is the list that arranges A through D in order of effective access time of main memory from shortest to longest?\r\n![](https://learn.viblo.asia/uploads/e/1/e1cd9184-a3d5-4012-b805-8e4586bd3d1c.png)","answer_label":"A, D, B, C","answer_id":16116},{"id":4309,"question":"A company uses 1,000 PCs. The mean failure in 20 days is to be restricted to 2 PCs. How many hours of MTBF are at least required for these PCs? Here, the mean usage time of the PCs is assumed to be 8 hours per day.","answer_label":"80,000","answer_id":18100},{"id":4590,"question":"A system manages files by allocating file storage on a block-by-block basis, where\neach block consists of eight 500-byte sectors. How many sectors in total are required\nto store two files: one with 2,000 bytes and the other with 9,000 bytes? Here, sectors\nfor management information such as directories can be ignored.","answer_label":"32","answer_id":19078},{"id":6072,"question":"Which of the following functions is a part of OS task management?","answer_label":"CPU allocation","answer_id":24502},{"id":2030,"question":"There is a system composed of two (2) CPUs, and the CPU that is not in use is assigned to a task for which there is an execution request. When two (2) tasks A and B are run on this system, these tasks exclusively use a common resource R. The figure below shows the usage periods of the CPUs and resource R for tasks A and B, and the order in which the tasks are run. When the execution of both the tasks is started simultaneously, how much time, in milliseconds, is required until the completion of processing of both the tasks? Here, both the CPU and resource R are available when tasks A and B are started.\n\n![](https://learn.viblo.asia/uploads/f/1/f182ed56-2a4f-4c60-83e3-f11b5f31bf44.png)","answer_label":"140","answer_id":9279},{"id":2928,"question":"Multiple directories named A and B are managed in the structure shown in the figure below. Which of the following is the case in which the current directory is moved so that “\\B\\A\\B” is the current directory? Here, the method for directory designation is as below, and → indicates the order of movement.\n \n[Method for directory designation]\n(1) A directory is referenced as “directory name\\ ··· \\directory name”, where the directories on the path are aligned and delimited with “\\” in sequence, followed by “\\” and the directory name.\n(2) The current directory is represented by “.” (a period).\n(3) The directory one (1) hierarchical level above is represented by “..” (two periods).\n(4) When a reference begins with a “\\”, it is assumed that the root directory is omitted at the leftmost position of the reference.\n(5) When a reference does not start with “\\”, “.”, or “..”, it is assumed that “.\\” is omitted from the leftmost position of the reference.\n\n![](https://learn.viblo.asia/uploads/1/1/11487d4d-0983-4071-b144-5865d9a6b079.png)","answer_label":"\\A → ..\\B → .\\A\\B","answer_id":12697},{"id":3319,"question":"Which of the following is an appropriate description concerning cache memory?","answer_label":"In machines with the large time gap between access to main memory and instruction\nexecution, the effective access time can be shortened by multi-level cache.","answer_id":14212},{"id":2779,"question":"Which of the following is an appropriate description of the reliability of computer systems?","answer_label":"Preventive maintenance of systems is performed to increase MTBF.","answer_id":12117},{"id":450,"question":"Which of the following is the backup method that requires the longest time to backup but the shortest time to restore?","answer_label":"Full backup","answer_id":5937},{"id":5092,"question":"When CPU processing and printing are performed for four jobs under the conditions below, how many minutes does it take to complete them from the start of the first CPU processing until the end of the last printing? \n[Conditions] \n(1) The multiplicity of jobs is 1 during execution. \n(2) The CPU processing time of each job is 20 minutes. \n(3) 400Mbytes of printing data are spooled for each job when the CPU processing ends. The printing function of the OS operates after spooling is completed, and printing is performed by the printer. \n(4) One printer is available, and the printing speed is 10 minutes per 100Mbytes. \n(5) The functions of CPU processing and printing can operate in parallel, and do not affect each other. \n(6) The time period that is not mentioned in the conditions, such as the time required for spooling, can be ignored.","answer_label":"180","answer_id":20843},{"id":444,"question":"Which of the following is a memory device that stores programs or data in factories, and only has the read operation for the stored programs or data?","answer_label":"Mask ROM","answer_id":6018},{"id":445,"question":"Which of the following is an appropriate role of a device driver?","answer_label":"It directly controls the hardware according to requests from an application program.","answer_id":6021},{"id":6064,"question":"A CPU has four blocks of cache memory. Using the LRU (Least Recently Used) replacement algorithm, which memory blocks are stored in the cache memory after the execution of the following sequence of access to memory blocks: 1 2 3 4 5 2 5 4 1 5 2 3? Here, at the start of the memory access, the four cache blocks are empty and used in sequence until all the blocks are occupied.  In other words, the cache blocks contain memory blocks “1 2 3 4” after access to the first four memory blocks.","answer_label":"1 5 2 3","answer_id":24470},{"id":799,"question":"Which of the following is an appropriate term to describe the phenomenon when files produced in the process of saving are scattered to different parts of the whole hard disk rather than in continuous clusters?","answer_label":"Fragmentation","answer_id":4915},{"id":1811,"question":"There exist the same two devices, each with an MTBF of 45 hours and an MTTR of 5 hours. What is the availability of a system that connects these two devices in series?","answer_label":"0.81","answer_id":8451},{"id":5096,"question":"Which of the following is an appropriate explanation of DRAM?","answer_label":"It is often used as main memory, and one bit is represented depending on whether or not its capacitor is charged.","answer_id":20858},{"id":442,"question":"Which of the following is an appropriate explanation of symmetric multiprocessing (SMP)?","answer_label":"Several CPU cores have schedules for their own tasks, with priorities set by the\noperating system with equal access to the memory and system resources.","answer_id":6010},{"id":2920,"question":"Which of the following is the addressing mode that references data in main memory as shown in the figure below?\n![](https://learn.viblo.asia/uploads/c/2/c2d44e62-e52b-4263-9dbf-644d3293b97d.png)","answer_label":"Indirect addressing","answer_id":12667},{"id":5974,"question":"Which of the following is the closest value as overall availability of the system composed of the four devices A to D? Here, availability of individual device is 0.9 for A and C, and 0.8 for B and D. In addition, when either of the parallel connections is operating, the corresponding parallel portion can be regarded as operating.\n![](https://learn.viblo.asia/uploads/9/e/9ea0abb7-9c69-45e0-82d3-484ba00ab68e.png)","answer_label":"0.95","answer_id":24110},{"id":6372,"question":"There is a CPU with an internal clock frequency of 700 MHz. The number of clock cycles for executing instructions and their appearance rates are shown in the table below. What is the approximate performance (measured in MIPS) of this CPU?\n![](https://learn.viblo.asia/uploads/5/7/57f679a7-ea5e-4c56-a8d9-a110dfa94ee1.png)","answer_label":"100","answer_id":25617},{"id":3620,"question":"Which of the following is the most appropriate explanation of grid computing?","answer_label":"By connecting multiple computers via a network, a high-performance system can be configured.","answer_id":15395},{"id":1760,"question":"Which of the following is the logical circuit that generates “1” as the output signal Z, only when the input signals X and Y have the same value?\n![](https://learn.viblo.asia/uploads/a/4/a405a3cf-326c-4453-8873-f672479497fe.png)","answer_label":"c","answer_id":8249},{"id":446,"question":"Which of the following is the RAID level that can recover data from the other disks, with a minimum of two-disk configuration?","answer_label":"RAID 1","answer_id":5941},{"id":5971,"question":"There is a fault-tolerant computer system with high reliability and availability in which two CPUs perform the same processing and compare the processing results to each other. If one CPU fails, the system cuts off the failed CPU and continues processing on the other CPU. What is this system configuration called?","answer_label":"Dual system","answer_id":24095},{"id":6077,"question":"There is an RAID5 disk array system that is composed of 10 hard disk drives, and each disk capacity is 100Gbytes. What is the approximate maximum capacity (in Gbytes) that can be used to store user data and/or programs on this system?","answer_label":"900","answer_id":24524},{"id":3446,"question":"In a client/server system, which of the following is the most appropriate advantage of using “stored procedures” that are available to all clients and do not need to be replicated in each client?","answer_label":"Data traffic between client and server can be reduced.","answer_id":14706},{"id":6038,"question":"In the RAID3 system shown below, three disks (Disks 0 through 2) for byte-striped data and one dedicated parity disk (Disk 3) are used as one volume. Parity byte Ap is generated by calculating the “exclusive OR” ($\\bigoplus$) of three bytes in Disks 0 through 2. For example, $A_p$(1-3) is calculated as follows:\n\n$A_p(1-3) = A_1 \\bigoplus A_2 \\bigoplus A_3$\n\nIn the event of a disk failure, data recovery can be accomplished by using the information recorded on the remaining three error-free disks. Which of the following operations should be executed for this data recovery?\n![](https://learn.viblo.asia/uploads/d/a/dac70f1e-4e55-4c74-9aa4-8bc604cd7c28.png)","answer_label":"Exclusive OR","answer_id":24366},{"id":2787,"question":"Which of the following is a characteristic of DRAM and not of SRAM?","answer_label":"It has a simple memory cell structure, and thus the price per bit is low.","answer_id":12148},{"id":3822,"question":"Audio is sampled and recorded at a frequency of 11,000 times per second with a resolution of 8 bits per sample. How many minutes of audio at maximum can be recorded in flash memory with a capacity of 512x10^6 bytes?","answer_label":"775","answer_id":16177},{"id":3803,"question":"Which of the following is the addressing mode where the register specified is used to point to the memory address of the data to be operated upon?","answer_label":"Register indirect addressing mode","answer_id":16102},{"id":4293,"question":"Which of the following is an appropriate description of memory interleaving?","answer_label":"Dividing main memory into several banks and speeding up access to sequential addresses in memory.","answer_id":18035},{"id":5084,"question":"Cache memory is usually organized at multiple levels, such as L1 for level 1 and L2 for level  2,  with  L1  having  the  smallest  storage  capacity  but  the  fastest  memory  speed.     The  data  in  L1,  L2,  and  main  memory  can  be  accessed  using  1,  10,  and  100  clock  cycles,  respectively.    When  the  cache  miss  rates  in  L1  and  L2  are  5%  and  50%  respectively, what is the average memory access time in clock cycles?","answer_label":"3.7","answer_id":20810},{"id":801,"question":"Consider a RAID 0 (i.e., block-level striping without parity or mirroring) system with two disks; when data is distributed evenly across the two disks and both disks have a failure rate of 0.1%, what is the overall failure rate (as a percentage) of this RAID system? Here, the overall failure rate refers to the probability that the system fails to obtain data from either of the disks.","answer_label":"0.1999","answer_id":4908},{"id":13781,"question":"Which one of the following serial transmission methods is used in asynchronous data communication","answer_label":"UART","answer_id":53377},{"id":4761,"question":"A CPU that operates at 1 GHz is known to execute one machine-language instruction in an average time of 0.8 clocks. Approximately how many million instructions can be executed by this CPU in one second?","answer_label":"1250","answer_id":19681},{"id":3320,"question":"Which of the following is an explanation of USB?","answer_label":"A serial interface to connect devices in a tree topology via hubs","answer_id":14214},{"id":13788,"question":"32-bit virtual address space is mapped to 4 k-byte pages. How many pages can be created? Here, 1k bytes represent 1,024 bytes.","answer_label":"2^20","answer_id":53404},{"id":6083,"question":"In some circumstances, a program may be still running when it is called again by another program. Which of the following is the appropriate characteristic that should be implemented to execute this program correctly?","answer_label":"Reentrant","answer_id":24547},{"id":3329,"question":"Which of the following is a sequential circuit that is capable of exhibiting either of two\nstable states and switching between them?","answer_label":"Flip-flop","answer_id":14252},{"id":4758,"question":"Which of the following is a high-speed memory technology that uses flip-flop circuits?","answer_label":"SRAM","answer_id":19669},{"id":3626,"question":"There is a virtual memory system in which the FIFO or LRU page replacement algorithm can be used as a page replacement algorithm. There are 4 page frames available in real memory, and a process makes the list of page references as follows: 2 → 3 → 6 → 4 → 6 → 3 → 1 → 2 → 4 → 6. How many execution of this process using the FIFO and LRU page replacement algorithms page faults occur during separately? Here, all page frames are empty at the beginning of the process.\n![](https://learn.viblo.asia/uploads/8/f/8f43650f-f359-4212-8f62-604bfbb3989c.png)","answer_label":"c","answer_id":15421},{"id":6075,"question":"Which of the following is the appropriate statement concerning client/server architecture?","answer_label":"It divides a series of processes into two groups by means of an inter-process communication mechanism; one group includes processes that request services, and the other consists of processes that execute the requested services.","answer_id":24514},{"id":5967,"question":"Which of the following combinations of access time and hit ratio for cache memory and access time for main memory results in the shortest effective access time to main memory?\n![](https://learn.viblo.asia/uploads/a/4/a4740358-8ba4-4f18-a919-aa8c6bce98d5.png)","answer_label":"d","answer_id":24082},{"id":3617,"question":"When a memory chip has 8 data lines and 9 address lines, what is the maximum number of bytes that can be stored in the chip? Here, chip select signals are implemented independent of those address lines, and no parity bit is considered.","answer_label":"512","answer_id":15385},{"id":3819,"question":"![](https://learn.viblo.asia/uploads/9/f/9f9b9200-dc07-4192-b2d7-c948713aad37.png)","answer_label":"B","answer_id":16164},{"id":3323,"question":"Which of the following is an appropriate characteristic of a Web system that is\nimplemented using the configuration of a three-tier client/server system?","answer_label":"A business process is executed on the server side, and the client software displays the\nresult on a screen according to the HTML coding.","answer_id":14226},{"id":6065,"question":"Which of the following appropriately describes the purpose of the cache memory used by processors?","answer_label":"To compensate for the difference between the main memory access speed and the processor speed","answer_id":24473},{"id":2780,"question":"A system is operated as a virtual machine environment with 20 physical machines. When the operating conditions are shown below, what is the minimum number of physical machine failures that causes the system to enter fall back operation?\n[Operating conditions]\n(1) If a physical machine fails, the virtual machines that were running on it are made to run evenly on all the other physical machines, and the resources that were used are distributed in the same way.\n(2) When there are 20 physical machines, 70% of the resources of all physical machines are used.\n(3) If the resources used on a single physical machine exceed 90%, the whole system enters fall back operation.\n(4) Conditions other than (1) through (3) above do not need to be considered.","answer_label":"5","answer_id":12122},{"id":4290,"question":"Which of the following is an appropriate statement in regard to interrupts?","answer_label":"A priority is individually assigned to the cause of an interrupt in preparation for the occurrence of multiple interrupts.","answer_id":18023},{"id":460,"question":"Which of the following can change the deadlock state of the transaction back to the normal state?","answer_label":"Rollback","answer_id":5950},{"id":451,"question":"In UNIX, which of the following is a function that links the standard output of a command directly to the standard input of another command?","answer_label":"Pipe","answer_id":5946},{"id":529,"question":"Which of the following is an appropriate description of flash memory?","answer_label":"Data can be electronically erased in block units.","answer_id":5507},{"id":1603,"question":"When data is read into a processor and there are no hits in the cache memory, which of the following is the action that the cache memory control unit performs?","answer_label":"The required data is read from main memory to cache memory by using the block\r\ntransfer mechanism.","answer_id":7540},{"id":800,"question":"Which of the following is the most appropriate explanation of grid computing?","answer_label":"A computing task is distributed to several computers in the network to attain the computational capacity.","answer_id":4910},{"id":519,"question":"Which of the following is an explanation of an absolute path name in a file system?","answer_label":"The path name from the root directory to the target file","answer_id":5544},{"id":4299,"question":"The figure shows the basic configuration of a computer. Which of the following is the correct combination of A, B, and C to be inserted in the figure?\n![](https://learn.viblo.asia/uploads/4/0/40377c7b-83ff-40be-b11d-e4461cc65871.png)","answer_label":"c","answer_id":18060},{"id":3628,"question":"Which of the following is the appropriate explanation of the hash method?","answer_label":"Access method that calculates the storing address of a record from its key value using a function","answer_id":15427},{"id":5965,"question":"When an image is read with a scanner at a resolution of 600 dpi and printed with a printer at a resolution of 300 dpi, how many times as large as the area of the original image is the area of the printed image?","answer_label":"4","answer_id":24074},{"id":1608,"question":"In a paged virtual memory, the LRU method is adopted for the page replacement algorithm. When the page frame allocated to the main memory is 4, which of the following page is to be replaced when page 6 is accessed if the pages are accessed in the order of page 1, 2, 3, 4, 5, 2, 1, 3, 2, 6? Here, no page exists in the main memory in the initial state.","answer_label":"5","answer_id":7562},{"id":3455,"question":"Which of the following is the appropriate logic circuit with two inputs and one output where the output X is 0 only when the two inputs A and B are both 1s?\n![](https://learn.viblo.asia/uploads/9/d/9d3b9d58-29e5-43f2-9ca3-1279d2b65cd9.png)","answer_label":"NAND circuit","answer_id":14743},{"id":6379,"question":"The  figure  below  shows  the  state  transition  diagram  of  a  certain  process.      Which  of  the following is the appropriate combination of States A, B, and C?\n![](https://learn.viblo.asia/uploads/f/8/f84285b1-f7a5-4cd5-8948-a2fea497c098.png)","answer_label":"c","answer_id":25644},{"id":3321,"question":"Which of the following is an appropriate explanation of a plasma display?","answer_label":"It consists of many tiny cells between two glass panels containing a mixture of noble\ngases with a phosphor coating, and displays images by using a gas discharge.","answer_id":14218},{"id":6078,"question":"In some systems, the system manually or automatically determines memory blocks which are no longer referenced by a program and reorganizes the memory space so that it can be available for subsequent allocation. What is this process called?","answer_label":"Garbage collection","answer_id":24527},{"id":3814,"question":"Which of the following is the most appropriate explanation of a dual system?","answer_label":"It provides a duplicate system for performing the same processing, and performs a cross check of the processing results. In the event of a failure in either system, it continues the processing through degraded operation.","answer_id":16146},{"id":2782,"question":"Which of the following occurs when a program attempts to access a page that is mapped in the virtual address space, but is not located in the main memory? Here, the OS supports paging.","answer_label":"Page fault","answer_id":12128},{"id":1814,"question":"Which of the following is an explanation of the function of an archiver that is one of the data management utilities?","answer_label":"Compiling several files into one file, or returning a file to its original condition in order to perform data backup and distribution","answer_id":8463},{"id":3622,"question":"As shown in the figure, one server, three clients, and two printers are connected to the LAN. This system transfers the data on the server to a printer based on instructions from a client. When the availability of each device is as shown in the table, which of the following is the formula indicating the availability of this system? Here, the operation is considered normal if at least one of the three clients and one of the two printers are operating.\n![](https://learn.viblo.asia/uploads/3/1/31c79e14-99c3-4ea0-ae36-9ae5f81e96c1.png)","answer_label":"d","answer_id":15406},{"id":4766,"question":"A color video clip is displayed in full-screen mode on a PC at 30 frames/second, with each screen comprising 300,000 pixels and 256 colors displayed at the same time. Under these conditions, which of the following is the approximate amount of data (in megabytes) that can be displayed in one minute? Here, the data is not compressed.","answer_label":"540","answer_id":19700},{"id":1808,"question":"Which of the following is an appropriate explanation of a capacitive touch panel?","answer_label":"An electric field is formed on the surface, and the touched position is detected on the basis of the change in the surface electric charge.","answer_id":8439},{"id":4302,"question":"Which of the following is an appropriate description concerning the role of a shell in an OS?","answer_label":"It interprets the commands entered by the user and instructs the OS to execute the corresponding functions.","answer_id":18072},{"id":723,"question":"A system has devices with availability R, connected as shown in the figure below. Which of the following is the expression that represents the availability of the entire system? Here, a parallel connection only requires either of the two devices to be functional, whereas a series connection requires both the devices to be functional.\n\n![](https://learn.viblo.asia/uploads/9/0/900bf53f-35b7-4c4a-b4af-c173a7500abf.png)","answer_label":"a","answer_id":5218},{"id":6369,"question":"When a CPU can perform a multiplication in 12 nanoseconds (ns), an addition in 1 ns, and a subtraction in 1.5 ns, which of the following is the minimum CPU time, in nanoseconds, for the calculation of “a × a – b × b ” ?","answer_label":"14.5","answer_id":25604},{"id":5093,"question":"When the number of concurrently running programs is increased in a virtual storage system with the small and insufficient capacity of main memory, which of the following is the state in which the overhead of the system increases and the processor utilization of the applications decreases?","answer_label":"Thrashing","answer_id":20848},{"id":3810,"question":"In a client/server system using a database server, the generation of a large number of SQL statements causes a problem with a rapidly increasing network load between client and server. Which of the following is an appropriate solution to this problem?","answer_label":"Use of stored procedure","answer_id":16130},{"id":4593,"question":"In virtual memory systems, serious degradation of system performance may occur due\nto a large number of page faults. Which of the following terms most appropriately\ndescribes this situation?","answer_label":"Thrashing","answer_id":19090},{"id":6125,"question":"Which of the following is an appropriate explanation of SoC (System on a Chip)?","answer_label":"A semiconductor chip in which all required functions (systems) are integrated in the same manufacturing process","answer_id":24715},{"id":727,"question":"On a virtual memory computer, the number of pages that can be allocated to the real memory is three (3), and the two (2) algorithms of FIFO and LRU are used for selecting the page to be removed. When a page reference string shown below accesses the three (3) pages, which of the following is an appropriate combination of the number of page replacement operations? Here, the three (3) pages are initially empty and filling of an empty page is not considered as a page replacement operation.\n\n          1, 3, 2, 1, 4, 5, 2, 3, 4, 5\n\t\t\t\t\t\n![](https://learn.viblo.asia/uploads/8/4/84b3a963-42c5-4a8c-816e-d94400f95aee.png)","answer_label":"b","answer_id":5203},{"id":2933,"question":"In a lighting circuit for an anode-common type LED with seven (7) segments, when 92 in hexadecimal is written out to the output port, which of the following is displayed? Here, P7 is the most significant bit (MSB), P0 is the least significant bit (LSB), and the LED lights up when the port output is 0.\n![](https://learn.viblo.asia/uploads/e/d/ed163864-34a3-4b03-9cf1-ab3650063d07.png)","answer_label":"c","answer_id":12719},{"id":4308,"question":"Which of the following is an appropriate statement with regard to system performance evaluation, when selecting a new computer system?","answer_label":"The data required for evaluation can be acquired by running programs which are frequently used or time critical.","answer_id":18097},{"id":3629,"question":"Which of the following groups of CASE tools is used only in a particular stage of the software development life cycle and is designed to work cooperatively with other CASE tools in an integrated and consolidated environment?","answer_label":"Component CASE tools","answer_id":15431},{"id":3820,"question":"Which of the following is a characteristic of DRAM, in comparison with SRAM?","answer_label":"DRAM is suitable for a higher level of integration.","answer_id":16168},{"id":2029,"question":"Which of the following is a technique of segmenting and storing data on multiple hard disks as shown in the figure? Here, b0 through b15 show the sequence in which the data are stored to the data disks on a bit-by-bit basis. \n\n![](https://learn.viblo.asia/uploads/6/8/6817a955-f2af-4101-a4ae-520a568f6ffb.png)","answer_label":"Striping","answer_id":9277},{"id":1606,"question":"Which of the following is the concept of a fail-safe design?","answer_label":"When the system determines that there is a fault in the sensor for detecting if someone\r\nhas entered the working envelope or work area, the robot arm is stopped forcibly.","answer_id":7554},{"id":3325,"question":"Which of the following is the virtual storage technique that can resolve external\nfragmentation rather than internal fragmentation by dividing virtual address space into\nfixed-length areas?","answer_label":"Paging","answer_id":14236},{"id":796,"question":"Which of the following is the computer architecture where processors execute multiple instruction streams on multiple data streams in parallel?","answer_label":"MIMD","answer_id":4926},{"id":3327,"question":"Which of the following is a technique that binds the modules constituting a program at\nthe time of executing the program?","answer_label":"Dynamic linking","answer_id":14242},{"id":4300,"question":"Which of the following is an input device classified as a pointing device and can be used for graphical input in a CAD system?","answer_label":"Tablet","answer_id":18065},{"id":5969,"question":"As one of the virtual storage methods, virtual address space is divided into fixed-length areas. What is such a fixed-length area called?","answer_label":"Page","answer_id":24088},{"id":5963,"question":"Which of the following is an appropriate description concerning RAID?","answer_label":"RAID 0 increases performance by using disk striping. However, the reliability is rather low because damages on even one disk cause whole data to be lost.","answer_id":24063},{"id":5083,"question":"There is a digital video recording system installed with four security cameras.    In this system,  the  video  data  from  each  camera  is  captured  at  30  frames  per  second  with  a  resolution  of  640 × 480  pixels  and  a  color  depth  of  16  bits  per  pixel,  and  then  it  is  stored  in  the  hard  disk  drive.    Which  of  the  following  is  the  approximate  storage  capacity  that  is  required  for  recording  all  video  data  for  one  minute?      Here,  1 MB  is  106 bytes, and 1 GB is 109 bytes.","answer_label":"4.5 GB","answer_id":20808},{"id":4757,"question":"When two D flip-flops are connected as shown below, which of the following timing charts represents this logic circuit? Here, in D flip-flop, an input signal is read in and held as an output signal only when a clock signal is changed from zero (or low) to one (or high). In other cases, no state transition occurs.\n![](https://learn.viblo.asia/uploads/5/a/5af04467-b57b-4406-a052-b0a9b7f4529e.png)\n![](https://learn.viblo.asia/uploads/8/c/8cd44538-00c7-4586-9f50-9a39e907fc8d.png)","answer_label":"b","answer_id":19663},{"id":2934,"question":"Currently, the number of customers is 8,000 with annual increase rate of 20%. By assigning a fixed length code using 26 uppercase alphabet A- Z to each customer, what is the minimum code length required to accommodate all the customers for next three years?","answer_label":"3","answer_id":12721},{"id":3816,"question":"Which of the following is classified as an external interrupt?","answer_label":"An interrupt that is caused by an interval timer when the specified time elapses","answer_id":16153},{"id":4297,"question":"Which of the following is the appropriate combination of 4 color inks or toners for a full-color printer?","answer_label":"Cyan, Magenta, Yellow, and Black","answer_id":18051},{"id":6032,"question":"There is a CPU with a clock frequency of 1 GHz. When the instructions consist of two types as shown in the table below, what is the performance in MIPS of the CPU?\n![](https://learn.viblo.asia/uploads/a/f/aff78248-c4d2-4f67-8841-72e393c4214d.png)","answer_label":"125","answer_id":24342},{"id":6370,"question":"Which of the following is the appropriate diagram that explains pipeline control? \nHere, the meanings of the capital letters in the diagrams are as follows: \nF: Fetching instruction \nD: Decoding \nA: Address calculation \nR: Reading operand \nE: Executing\n![](https://learn.viblo.asia/uploads/5/c/5c5a2a98-8202-4050-b91e-c7533571416b.png)","answer_label":"c","answer_id":25608},{"id":795,"question":"Which of the following is the addressing mode where the instruction contains the address and the address is modified by a value from another register?","answer_label":"Indexed addressing mode","answer_id":4931},{"id":1862,"question":"Which of the following is an appropriate description of throughput?","answer_label":"Spooling, which involves temporarily saving the output to a printer in a hard disk, is\nuseful in improving throughput.","answer_id":8657},{"id":13791,"question":"Which of the following is equivalent to the circuit below?\n![](https://learn.viblo.asia/uploads/7/3/73d21fcc-30cb-46e8-9a23-5aa1404a23e6.png)","answer_label":"d","answer_id":53417},{"id":2783,"question":"Which of the following is an appropriate explanation of spooling?","answer_label":"It temporarily saves output data for a low-speed device, such as a printer, to a high-speed hard disk, and then sends it to the intended device.","answer_id":12134},{"id":13789,"question":"The four jobs A through D are executed based on the conditions below and printed. How many seconds is it until all printing is completed after a job is started?\n[Conditions] \n(1) All jobs are launched at once, and executed by the CPU with a multiplicity of one. \n(2) Job A has the highest priority, followed by B, C, and D. \n(3) After each job is executed, a spooling function prints each job in turn on a single printer. \n(4) The execution time and printing time when each job is executed separately are as shown in the table. \n(5) Other overheads are not considered.\n\n![](https://learn.viblo.asia/uploads/4/9/490946b5-067f-4f23-bdd6-076fc9ebed62.png)","answer_label":"190","answer_id":53408},{"id":3625,"question":"In a certain file server system, it takes 15 ms to process one transaction if the target data is available in the disk cache. If the target data is stored in the hard disk in lieu of the disk cache, additional 75 ms for disk access is required to process it. When two-thirds of the number of transactions can be processed by using the disk cache data only, how many transactions per second on average can be consecutively handled in this system? Here, no parallel operation of disk access and data processing is performed. Overhead, such as communication and OS, can be ignored.","answer_label":"25","answer_id":15417},{"id":5958,"question":"At least how many bits are required for the register identification field of a machine instruction code in order to specify one of 16 general purpose registers in the machine?","answer_label":"4","answer_id":24045},{"id":3447,"question":"Which of the following is the appropriate RAID configuration that provides disk striping at the block level rather than byte level and reserves one disk for parity information?","answer_label":"RAID4","answer_id":14713},{"id":4291,"question":"Which of the following is an appropriate description concerning cache memory?","answer_label":"In one method, when executing a write instruction, data is written to both cache memory and main memory. In the other method, data is written only to a block in cache, and the modified block is written back into main memory only when it is replaced.","answer_id":18028},{"id":13783,"question":"A RAID 6 server is configured with six hard disk drives, and each drive’s capacity is one TB. What is the maximum total data storage capacity in TB? Here, spare disks are not used.","answer_label":"4","answer_id":53383},{"id":2929,"question":"In the virtual memory of a paging system, which of the following is a cause that increases the number of page fault occurrences?","answer_label":"An increase in access to a page that does not exist in main memory","answer_id":12702},{"id":6073,"question":"When variables shared among tasks are updated, an unexpected result may occur if synchronous control among tasks is not performed. When the initial value of the variable x shared among tasks is 3, the final value of x is expected to be 12 if task A executes the assignment statement “x = x + x” and if task B executes the assignment statement “x = x × x.” Which of the following is the appropriate execution sequence that can return the expected result?  Here, each assignment statement is executed by being divided into four portions as shown below.\n![](https://learn.viblo.asia/uploads/4/b/4baaec1e-0d0b-4237-9a09-517c4b752e69.png)","answer_label":"a1 → b1 → b2 → b3 → b4 → a2 → a3 → a4","answer_id":24507},{"id":3616,"question":"Which of the following is classified as an internal interrupt?","answer_label":"Interrupt by divide-by-zero","answer_id":15379},{"id":5090,"question":"The diagram below shows the state transition of the tasks in a multitasking computer system. When does a task in the running state move to the ready state?\n![](https://learn.viblo.asia/uploads/2/8/28d4a7f0-33cd-4693-bdb8-8de4c89958b8.png)","answer_label":"When a task with a higher priority is set to the ready state","answer_id":20835},{"id":525,"question":"Which of the following is essential to realizing a fault-tolerant system?","answer_label":"Providing redundancy in the system configuration to minimize the impact from any failure of parts so that processing can be continued without affecting the overall system","answer_id":5525},{"id":454,"question":"Which of the following uses a flip-flop circuit in a memory cell?","answer_label":"SRAM","answer_id":5971},{"id":4770,"question":"The FIFO method is used as the page replacement algorithm in virtual memory. There are 3 page frames available in real memory, and a reference list of the virtual page numbers “1, 4, 2, 4, 1, 3” was allocated to real memory in this order as shown in the table below. The table, up through “assigning step 3”, shows the status of the real memory pages just after each of the first three page numbers “1, 4, 2” of the reference list was allocated to real memory. Which of the following should be inserted in the bold-lined box that indicates the last status of the real memory pages just after the remaining page numbers were referenced?\n![](https://learn.viblo.asia/uploads/3/9/39268393-c2c5-4159-a6a9-4687aca0c258.png)\n![](https://learn.viblo.asia/uploads/7/b/7b92554c-96ff-4a4e-8c48-d6d531a4d949.png)","answer_label":"c","answer_id":19716},{"id":719,"question":"In a memory system that has a cache memory, which of the following causes an increase in the average memory access time?","answer_label":"A decrease in the cache hit rate","answer_id":5231},{"id":2930,"question":"Which of the following is a criterion for a page to be replaced in a Least Recently Used (LRU) algorithm?","answer_label":"The last referenced time","answer_id":12708},{"id":726,"question":"In the figure below, data are sent continuously for T seconds from the send task to the receive task. When the volume of the data sent per second is S and volume of the data received per second is R, which of the following is an appropriate relational expression for buffer size L for a buffer that does not overflow? Here, the transmission speed for the send task is faster than the transmission speed for the receive task, and there is sufficient time between the transmissions.\n\n![](https://learn.viblo.asia/uploads/7/6/76641276-372c-453d-9a0a-93d0b92da57d.png)","answer_label":"L≥(S-R)×T","answer_id":5209},{"id":5960,"question":"Which of the following is used to hold the address of the instruction being executed or the address of the next instruction to be executed, and is automatically incremented after fetching an instruction?","answer_label":"Program counter","answer_id":24054},{"id":13782,"question":"As a backup system configuration, which of the following is an appropriate description of a hot site","answer_label":"A site is operated as a standby site, the data and programs are updated at all times via a network, and the business operation is resumed immediately when a failure occurs.","answer_id":53379},{"id":4286,"question":"Which of the following is a re-writable, erasable memory, using electrical signals, which is widely used for various devices such as digital cameras and digital music players and can maintain the data even after the power is turned off?","answer_label":"Flash memory","answer_id":18007},{"id":2785,"question":"There is a system in which the print requests waiting for output are assigned to an available printer in an order of A, B, and C, and then the printer available first among the three (3) printers A through C of the same model. If the print time of each print request is 5, 12, 4, 3, 10, and 4 (minutes) in the order of the requests waiting for output, which of the following lists of printers is arranged in an order starting from the longest time assigned for printing? Here, all printers are available in the initial state.","answer_label":"A, B, C","answer_id":12139},{"id":5964,"question":"Which of the following USB transfer modes is mainly used for a mouse, joystick, etc.?","answer_label":"Interrupt transfer","answer_id":24069},{"id":531,"question":"Which of the following is an equivalent representation of the circuit below where only NAND gates are used?\n\n![](https://learn.viblo.asia/uploads/3/f/3fd1739c-877d-41fb-b6e8-7b47e8aeab0c.png)","answer_label":"b","answer_id":5511},{"id":3627,"question":"Which of the following appropriately describes the role of task management?","answer_label":"It controls multiprogramming and uses the CPU effectively.","answer_id":15424},{"id":13786,"question":"When the least recently used (LRU) method is used for swapping a block between cache memory and main memory, which of the following is a block in cache memory to be replaced","answer_label":"A block for which the longest period of time has elapsed since it was last referenced","answer_id":53395},{"id":1611,"question":"Which of the following is an explanation of an absolute path name of a file system?","answer_label":"It is the path name from the root directory up to the target file.","answer_id":7573},{"id":1816,"question":"Which of the following is classified as a function of a static test tool?","answer_label":"Detecting an error in a program by analyzing the source code","answer_id":8472},{"id":4763,"question":"From a point of view of better performance, improved fault tolerance, and enhanced data integrity, which of the following RAID configurations is commonly suitable for enterprise systems?","answer_label":"RAID 5","answer_id":19689},{"id":5966,"question":"Which of the following input devices is classified as a pointing device and used for graphics input in a CAD system?","answer_label":"Tablet","answer_id":24078},{"id":4303,"question":"Which of the following terms refers to the function that adjusts all address dependent locations within a program to correspond to the load position when the program is loaded into main memory prior to its execution?","answer_label":"Relocation","answer_id":18077},{"id":2923,"question":"Which of the following is an appropriate description of the effect of cache memory?","answer_label":"By reading data from main memory and storing it in cache memory, data transfer is performed at high speed when the CPU reads the same data later.","answer_id":12678},{"id":3624,"question":"A certain computer system runs in a multi-programming environment using a non-preemptive “shortest job first” algorithm. In this system, four processes A, B, C, and D arrive sequentially in the process queue every 1 millisecond. The table shown below includes estimated execution time for each process; for example, process A uses CPU, I/O, and then CPU sequentially for 4, 5, and 4 milliseconds respectively. Which of the following is the third completed process? Here, the multi-processing overhead of OS can be ignored, and both CPU and I/O operations can be executed concurrently.\n![](https://learn.viblo.asia/uploads/3/0/30ba1fa7-2624-46d7-a743-36084a413644.png)","answer_label":"B","answer_id":15412},{"id":6120,"question":"Which of the following is the most appropriate set of major functions supported by an OS?","answer_label":"Data management, job management, and task management","answer_id":24695},{"id":4292,"question":"There are two systems A and B whose access times of cache and main memory are show in the table. When a certain program runs on these systems, the cache hit ratio and the effective access time are the same on both systems. What is the cache hit ratio in this case?\n![](https://learn.viblo.asia/uploads/c/0/c0ed70b8-0985-4b3c-ad08-f1602f9535e9.png)","answer_label":"0.8","answer_id":18033},{"id":3631,"question":"As shown in the floor layout below, there are three sensors S1, S2, and S3 that control a light bulb in the middle of a hallway. The sensor S1 is a light sensor that generates the output signal “0” only when sunlight (or some other external light source) is detected. In case of no light, the output signal of S1 is “1”. The two sensors S2 and S3 are infrared sensors that generate the output signal “0” only when either S2 or S3 detects the movement of a thermal target in its effective range. If no movement is detected, the output signal is “1”. Which of the following logic circuits can be used to control a switch of signal “Bulb” of the given logic circuit is “1”. Sunlight streams in the hallwaythe light bulb? Here, the bulb is turned on only when the output through the windows, and the light bulb in the hallway does not affect the sensor S1.\n![](https://learn.viblo.asia/uploads/8/9/890b969a-ed6d-448b-8748-764437ec8ce4.png)\n![](https://learn.viblo.asia/uploads/a/b/ab60fcd1-bdd5-4310-b450-b058402e0920.png)","answer_label":"d","answer_id":15442},{"id":3623,"question":"The system operations model is shown in the figure. Which of the following is the appropriate combination of the expressions indicating MTBF and MTTR in this system? Here, ![](https://learn.viblo.asia/uploads/d/e/deec77ed-cbc6-44af-bfcc-3c40f98e57d5.png)\nrepresents the system operation time, and ![](https://learn.viblo.asia/uploads/7/9/795c0cf2-03c9-46c7-8d87-dbbaaa6fd177.png) represents the system repair time (i = 1, 2, ..., n).\n![](https://learn.viblo.asia/uploads/0/2/0270b676-f365-4fa2-b92b-02e9205c56d7.png)","answer_label":"b","answer_id":15408},{"id":3445,"question":"Which of the following is an appropriate characteristic of a client/server system?","answer_label":"The server provides functions as services for the client and performs the intended application in cooperation with the client.","answer_id":14705},{"id":6035,"question":"There is a hard disk drive that has the specifications shown in the table below. When a record of 10,000 bytes is read out from this disk, approximately how long (in milliseconds) does it take to access the disk and to complete the data transfer? Here, the data is stored contiguously from the beginning of one track, and the entire data on the track can be read and transferred per revolution. \n![](https://learn.viblo.asia/uploads/8/d/8dbe3d1b-fe77-4232-90d5-137f300c79b3.png)","answer_label":"42","answer_id":24355},{"id":520,"question":"Which of the following is the main purpose of optimization by a compiler?","answer_label":"To reduce the execution time of a program","answer_id":5540},{"id":6067,"question":"How many tracks are required to store a sequentially organized data file including a total of 10,000 records on the hard disk drive under the following conditions?  Here, each track can contain multiple blocks, but each block cannot be stored across multiple tracks.\n\n[Conditions]\n\nRecord length:  300 bytes/record\n\nTrack capacity:  30,000 bytes/track\n\nInter-block gap:  400 bytes\n\nBlocking factor:  20 records/block","answer_label":"125","answer_id":24484},{"id":3330,"question":"According to ISO 9241-210: 2010, which of the following is defined as the “extent to\nwhich a system, product, or service can be used by specified users to achieve specified\ngoals with effectiveness, efficiency, and satisfaction in a specified context of use”?","answer_label":"Usability","answer_id":14257},{"id":798,"question":"Which of the following is an appropriate role for a device driver?","answer_label":"It directly controls hardware according to requests from an application program.","answer_id":4919},{"id":2191,"question":"For a multiprogramming switching procedure of processes shown in the figure below,\nwhich of the following is an appropriate combination of OS processing for A through C?\n![](https://learn.viblo.asia/uploads/9/2/9258f6e4-8772-4dc6-ac26-13a00de3d50a.png)","answer_label":"c","answer_id":9871},{"id":6068,"question":"The head of a hard disk drive is currently positioned at cylinder number 100, and the cylinder numbers 120, 90, 70, 80, 140, 110, and 60 are lined up in the I/O request queue. What is the total number of cylinders that the head moves under the following conditions?\n\n[Conditions]\n\n(1) The seek optimization method reorders the I/O requests so that the head can move as much as possible in a single direction, and the requests are processed in order of cylinder number.\n\n(2) The requests so far are in the direction where the cylinder numbers increase.\n\n(3) When there are no more requests in the current direction, the direction of head movement is reversed.\n\n(4) The results are unaffected by the processing order of the requests.\n\n(5) New requests do not occur during the process.","answer_label":"120","answer_id":24486},{"id":524,"question":"When two computers have been prepared, and the computer in use fails, which of the following is the system that continues processing by promptly switching to the backup computer that has started the same online processing programs as those on the currently- used computer in advance, and is on standby?","answer_label":"Hot standby system","answer_id":5527},{"id":6375,"question":"A system has a main memory access time of 60 nanoseconds (ns) and a cache memory access time of 10 ns. When the effective access time for accessing the main memory via the cache memory is 15 ns, what is the hit ratio of the cache memory?","answer_label":"0.9","answer_id":25629},{"id":2931,"question":"There is a logic circuit shown below. When the input values are A = 1, B = 0, and C = 1, which of the following is the combination of the values of E and Y?\n![](https://learn.viblo.asia/uploads/4/0/40c3d455-0401-413d-84a8-a1209e639ad3.png)","answer_label":"E = 1, Y = 1","answer_id":12712},{"id":3818,"question":"Which of the following is an appropriate reason for using a real-time OS in an embedded system?","answer_label":"There is a mechanism available to respond within the limited time.","answer_id":16162},{"id":3457,"question":"Which of the following is an appropriate explanation of flash memory?","answer_label":"Data is written or erased electrically and erased either all at once or in blocks.","answer_id":14753},{"id":4306,"question":"Which of the following is a system where one computer is in standby mode when the other computer is functioning normally?","answer_label":"Duplex system","answer_id":18087},{"id":721,"question":"Which of the following is an appropriate description concerning the recording method of RAID5?","answer_label":"It distributes the data over multiple hard disk drives, writes the data in units of blocks, and distributes and writes the parity on multiple hard disk drives.","answer_id":5223},{"id":3812,"question":"In the RAID0 and RAID1 systems using two disks, when one disk has a reliability rate of 99% and the other has a reliability rate of 97%, which of the following is the appropriate combination of each failure rate (in percentage) of RAID0 and RAID1? Here, the failure rate is calculated by using the formula below.\r\n  failure rate (%) = 100% – reliability rate (%)\r\n![](https://learn.viblo.asia/uploads/7/6/761ed749-5e1e-41bf-b015-f71616dba8d1.png)","answer_label":"D","answer_id":16138},{"id":3449,"question":"In memory pool management for real-time systems that use memory resources of various sizes, which of the following is an appropriate characteristic of the fixed-length method in comparison with the variable-length method?","answer_label":"Memory efficiency is low, and processing speed to allocate or release memory is fast and constant.","answer_id":14720},{"id":448,"question":"Which of the following is an appropriate characteristic of a web system implemented in a three-layer client/server system configuration?","answer_label":"A business process is executed on the server side, and the client software displays the\nresult on a screen according to the HTML coding.","answer_id":5924},{"id":459,"question":"When a storage location is to be calculated from a key value, which of the following methods enables the same calculation result to be obtained from different key values?","answer_label":"Hash index","answer_id":5954},{"id":1615,"question":"Among the descriptions concerning database models, which of the following is an appropriate explanation of the network model?","answer_label":"Its records can have multiple parent records and multiple child records.","answer_id":7590},{"id":1817,"question":"The logic circuit below shows a JK flip-flop. Which of the following is the appropriate truth table for the JK flip-flop. Here, the state of each output signal is affected only when the clock signal CLK changes from 0 to 1. “No Change” means that each output signal maintains its previous state, and “Toggle” means that each output signal switches (or toggles) its state “from 0 to 1” or “from 1 to 0.”\n![](https://learn.viblo.asia/uploads/d/a/da74ecab-0a96-497b-bb89-44c9eab7e4c1.png)","answer_label":"a","answer_id":8475},{"id":728,"question":"A real-time OS performs preemptive scheduling on a priority basis and schedules two (2) tasks A and B. When A has a higher priority than B, which of the following is an appropriate task management by the real-time OS?","answer_label":"When A is launched during the execution of B, B is assigned a “ready” status and A is executed.","answer_id":5198},{"id":5099,"question":"When a 60-minute monaural audio signal is digitalized using a PCM format with a sampling frequency of 44.1 kHz and a quantization bit rate of 16 bits, what is the approximate data volume in Mbytes? Here, the data is not compressed.","answer_label":"320","answer_id":20871},{"id":6297,"question":"![](https://learn.viblo.asia/uploads/9/f/9f373744-7ad9-4be6-bbcb-b677c6c14c62.png)","answer_label":"c","answer_id":25339},{"id":5098,"question":"Which of the following is the logic gate that is equivalent to the logic circuit shown below?\n![](https://learn.viblo.asia/uploads/0/b/0b4242e0-09d3-47a7-9165-3d6b4cd61fd1.png)","answer_label":"XOR","answer_id":20868},{"id":2925,"question":"As shown in the figure below, one (1) server, three (3) clients, and two (2) printers are connected via a LAN. This system prints data located on the server in response to instructions from the clients. When the availability of each device is as shown in the table below, which of the following is the expression that represents the availability of the system? Here, the system is considered available when the server, one (1) of the three (3) clients, and one (1) of the two (2) printers are running.\n![](https://learn.viblo.asia/uploads/d/b/dbdc184a-dbb9-4f2e-9bbb-e8e77ce54f3f.png)","answer_label":"a(1-(1-b)³)(1-(1-c)²)","answer_id":12688},{"id":3804,"question":"As shown in the table below, when a computer executes three types of instructions A, B, and C, what is the performance in MIPS of the computer?\r\n![](https://learn.viblo.asia/uploads/3/5/359179c8-8eb5-4e43-86c0-597b48479527.png)","answer_label":"40","answer_id":16106},{"id":449,"question":"In input/output management, which of the following is an appropriate function of a buffer?","answer_label":"Reducing the difference in processing speed by establishing a special area of memory\nbetween an input/output device and a processing device","answer_id":5931},{"id":6368,"question":"Which of the following is an appropriate description concerning registers in processors?","answer_label":"A complement register generates integer complements in order to perform operations in the adder circuit.","answer_id":25599},{"id":5961,"question":"When a microprocessor works at a clock speed of 200 MHz and the average CPI (“cycles per instruction” or “clocks per instruction”) is 4, how long does it take to execute one instruction on average?","answer_label":"20 nanoseconds","answer_id":24056},{"id":6371,"question":"Which of the following is the appropriate description of CPU clock frequencies for PCs?","answer_label":"The instruction execution timing in a CPU varies depending on the clock frequency. The higher the frequency, the faster the instruction execution speed gets.","answer_id":25611},{"id":1630,"question":"There exists an OS that can independently set the reading, writing, or execution rights for a file as the attribute information of the file. One bit is used for each of these three rights to set whether they are permitted or not. When these three bits are set using an octal value from 0 through 7, which of the following is an appropriate description considering the trial results below?\n\n  [Trial results]\n    (i) When 0 is set, reading, writing, and execution are not permitted.\n    (ii) When 3 is set, reading and writing are permitted, but execution is not permitted.\n    (iii) When 7 is set, reading, writing, and execution are permitted.","answer_label":"When 4 is set, only execution is permitted.","answer_id":7648},{"id":4764,"question":"Which of the following is an explanation of USB?","answer_label":"A serial interface that connects devices in a tree topology via hubs","answer_id":19690},{"id":3615,"question":"Which of the following stands for the processor architecture in which a single stream of instructions can operate on multiple pieces of data in parallel?","answer_label":"SIMD","answer_id":15377},{"id":2040,"question":"Which of the following is an appropriate explanation concerning a fault tolerant system?","answer_label":"A system that is designed so that the functions required for the overall system can\ncontinue to operate even in the event of a partial failure","answer_id":9320},{"id":1604,"question":"Which of the following statement is true for DMA Controller?","answer_label":"DMA controller enables data transfer directly between input/output devices and the\r\nmemory while the CPU can perform some other operations.","answer_id":7543},{"id":3821,"question":"Which of the following is the case where outline fonts rather than bitmap fonts are effective and suitable for use on an output device such as a display or a printer?","answer_label":"Characters are enlarged using a given scale factor.","answer_id":16174},{"id":5962,"question":"Which of the following is a method that serves to enhance the reliability of memory access and makes it possible to automatically correct some of data errors?","answer_label":"ECC","answer_id":24061},{"id":3328,"question":"Which of the following is an OSS tool that is provided as the IDE (Integrated\nDevelopment Environment) of software?","answer_label":"Eclipse","answer_id":14247},{"id":3817,"question":"Which of the following is an appropriate explanation of the LRU method that is used as a page replacement algorithm?","answer_label":"The page that has not been used for the longest time is replaced.","answer_id":16156},{"id":3456,"question":"On a seven-segment LED lighting circuit as illustrated below, when 6D in hexadecimal is written out to the output port, which of the following is displayed? Here, P7 is the MSB (Most Significant Bit), and P0 is the LSB (Least Significant Bit). When 1 is written to a port, the corresponding LED segment is turned on.\n![](https://learn.viblo.asia/uploads/3/4/347189c3-5975-4cd6-9561-9891da163aaa.png)","answer_label":"c","answer_id":14748},{"id":2922,"question":"Which of the following is an appropriate explanation of USB 3.0?","answer_label":"It uses a serial interface that has a 5 Gbps data transfer mode called super speed.","answer_id":12673},{"id":517,"question":"Which of the following is an appropriate explanation of a memory leak?","answer_label":"Part of main memory reserved during operation is not released because of a bug in the OS or an application, and as a result, the usable area of main memory decreases.","answer_id":5552},{"id":4304,"question":"The table shows the priorities of five tasks A to E. When each task is independently executed, the processing sequences and times associated with CPU and I/O devices are also shown in the table. Which of the tasks B to E should be combined together with task A assigned a “high” priority so that there may be no idle time of CPU from starting of execution of the combined tasks to ending of both tasks? Here, I/O operations never conflict with each other, and any overhead involved in the OS can be ignored. The number in parentheses denotes each processing time.\n![](https://learn.viblo.asia/uploads/d/a/dafd3460-6b48-4ae8-8663-1d23fa829fe4.png)","answer_label":"c","answer_id":18080},{"id":6374,"question":"Which of the following is used in ECC memory to detect 2-bit errors and correct 1-bit errors?","answer_label":"Hamming code","answer_id":25624},{"id":1865,"question":"A company performs a full backup every Sunday night and differential backups every night other than Sunday night. If the failure occurs on Wednesday morning, which of the following backups is least needed to restore the system?","answer_label":"The latest full and the latest differential backups from Tuesday.","answer_id":8669},{"id":4386,"question":"How many memory cells (or latches for holding 1 bit each) are implemented in SRAM with 24 address lines and 16 data lines?\n![](https://learn.viblo.asia/uploads/f/9/f981b41f-e03a-4e0e-ad66-b3f9bbee64e8.png)","answer_label":"d","answer_id":18392},{"id":2935,"question":"An audio signal is sampled 11,000 times per second while each sample is recorded as an 8-bit data. When a 512×10⁶ -byte capacity flash memory is used, what is the maximum number of minutes to record such data?","answer_label":"775","answer_id":12727},{"id":4587,"question":"Which of the following interrupts can signal to OS that a program might have gone\ninto an infinite loop?","answer_label":"Timer Interrupt","answer_id":19066},{"id":1759,"question":"Round robin (with a time allocation of 3 seconds) is used as a scheduling method for three processes in the order of P1, P2, and P3, shown in the table below. What is the total waiting time (in seconds) of P3 that elapses before its execution completes? Here, the arrival time is the time at which a process joins the ready queue.![](https://learn.viblo.asia/uploads/a/0/a0e1fb0c-265d-45f2-a0a5-43b3474d9878.png)","answer_label":"35","answer_id":8243},{"id":516,"question":"There exists a device with an MTBF of forty-five (45) hours and an MTTR of five (5) hours. What is the availability of a system that connects two (2) such devices in series?","answer_label":"0.81","answer_id":5554},{"id":2789,"question":"Which of the following is the name of a phenomenon where multiple ON/OFF signals are generated within a few milliseconds after a push-button switch with a mechanical contact is pressed once?","answer_label":"Chattering","answer_id":12156},{"id":5100,"question":"Among the descriptions concerning three-dimensional computer graphics, which of the following is an explanation of polygon?","answer_label":"It is a basic element that is used for constituting a polyhedron taking the form of a closed solid or for approximating a quadric surface or a free-form surface.","answer_id":20873},{"id":6079,"question":"Which of the following is the appropriate description concerning the performance evaluation of a computer system?","answer_label":"In the case of a system in operation, a software monitor can be used to collect and analyze statistical data, thereby permitting performance-related problems to be grasped.","answer_id":24532},{"id":6039,"question":"Backup sites, which are used during system downtime, are classified into three types: warm, cold, and hot sites. In general, which of the following is the list arranged in order from shortest to longest recovery time?","answer_label":"Hot site, warm site, cold site","answer_id":24369},{"id":13792,"question":"Which of the following is an appropriate equation of the XOR operator? Here, “・” represents the logical AND, “+” represents the logical OR, and P represents the inverse of P in the logical expression. \n\n![](https://learn.viblo.asia/uploads/6/e/6e4cc09d-9a71-414a-acb9-ffbfcdd0a5f2.png)","answer_label":"b","answer_id":53419},{"id":2039,"question":"Among the RAID systems, which of the following should be used in cases where maximum storage capacity is required but data redundancy or fault tolerance is not a requirement?","answer_label":"RAID 0","answer_id":9314},{"id":2031,"question":"Which of the following is an appropriate input for a common anode seven-segment display to display a character shown as output? Here, A represents the most significant bit (MSB) and G represents the least significant bit (LSB). \n\n![](https://learn.viblo.asia/uploads/f/1/f1a66383-44df-4f5f-abeb-972dedd21f76.png)","answer_label":"0110000","answer_id":9282},{"id":720,"question":"There exists a storage system in which one (1) block is composed of eight (8) sectors of 500 bytes each, and the storage area is block-wise allocated to the files. When a 2,000-byte file and 9,000-byte file are to be saved, what is the total number of sectors that is allocated to these two (2) files? Here, the sectors that are occupied by the directory information and other such management information can be ignored.","answer_label":"32","answer_id":5229},{"id":4762,"question":"There is a hard disk drive that has the following specifications.\n![](https://learn.viblo.asia/uploads/b/4/b4183486-ed8f-4a3b-8e77-b65538e5e3d0.png)\nHow many bytes can be stored in one track of this hard disk drive? Here, each track has the same capacity. 1 GByte is 10 9 bytes, and 1 Mbyte is 10 6 bytes.","answer_label":"50 Mbytes","answer_id":19684},{"id":1857,"question":"In a CPU with a four (4) stage pipeline composed of fetch, decode, execute, and write back, each stage takes 10, 6, 8, and 8 ns, respectively. Which of the following is an approximate average instruction execution time in nanoseconds (ns) in the CPU? Here, the number of instructions to be executed is sufficiently large. In addition, the overhead for the pipelining process is negligible, and the latency impact from all hazards is ignored.","answer_label":"10","answer_id":8637},{"id":6074,"question":"Which of the following has the feature whereby only minimally limited OS functions, such as memory management and process management, are supported and other OS functions, such as the file system, are implemented as server processes?","answer_label":"Microkernel","answer_id":24510},{"id":1861,"question":"Which of the following is an appropriate description concerning cache memory?","answer_label":"Multiprocessors where each has a cache memory need to synchronize values within the\ncache to maintain coherency.","answer_id":8652},{"id":3451,"question":"Which of the following is an appropriate description concerning the use of an application on a computer with virtual memory?","answer_label":"Insufficient main memory causes excessive page faults during running the application and reduces the system throughput.","answer_id":14728},{"id":3630,"question":"Which of the following is the appropriate explanation of DRAM?","answer_label":"It can represent one bit, depending on whether the capacitor is electrically charged or not. It is often used as main memory.","answer_id":15437},{"id":3326,"question":"Which of the following is an appropriate explanation of a benchmark test for computer\nsystems?","answer_label":"The relative processing power of each system is measured and evaluated by executing\na computer program, a set of programs, or other operations selected in accordance\nwith the purpose of usage.","answer_id":14239},{"id":3619,"question":"Which of the following is an appropriate explanation of memory-mapped I/O?","answer_label":"is a technology for assigning the registers of I/O devices to the specifically dedicated I/O address space in main memory.","answer_id":15391},{"id":5097,"question":"The figure below shows a logic circuit representing a full adder.    When 1, 0, and 1 are entered  into  x, y,  and  z  respectively,  which  of  the  following  is  the  appropriate  combination of the output values of c (carry) and s (sum)?  \n![](https://learn.viblo.asia/uploads/2/c/2c573482-26c3-448d-b364-b9643c6c1556.png)","answer_label":"c = 1; s = 0","answer_id":20863},{"id":2927,"question":"Which of the following is an appropriate usage method of the priority-based preemptive scheduling that is used in an embedded real-time operating system?","answer_label":"It is used when tasks are processed according to their importance and urgency.","answer_id":12694},{"id":1809,"question":"Which of the following is the most appropriate method for the implementation of a fault tolerant system?","answer_label":"The system is multiplexed with two or more computers instead of using a single computer.","answer_id":8445},{"id":6063,"question":"There is a processor with a clock frequency of 1 GHz. When the instruction set of this processor is composed of two types of commands as shown in the table below, what is the approximate processing performance in MIPS?\n![](https://learn.viblo.asia/uploads/a/d/ad074cfc-ce41-40b2-83c3-eebdd08597da.png)","answer_label":"125","answer_id":24467},{"id":4310,"question":"Which of the following is an appropriate description concerning a tracer that is used as a debugging tool?","answer_label":"It outputs history information such as execution sequences and execution results of program instructions.","answer_id":18102},{"id":1815,"question":"Which of the following is an appropriate explanation of optimization in a compiler?","answer_label":"Generating an object code with improved run-time processing efficiency by analyzing the source code","answer_id":8470},{"id":3805,"question":"Which of the following is a computer architecture where each instruction is divided into multiple stages (e.g., fetch, decode, and execute) in the processor, and multiple functional units execute two or more instructions in parallel by slightly shifting the instructions in stages?","answer_label":"Pipeline","answer_id":16108},{"id":3815,"question":"Among the explanations of task scheduling methods, which of the following has the highest possibility that a specific task continues to wait for the allocation of CPU time?","answer_label":"The processing is executed from the task with the estimated shortest processing time. The subsequent task is started when the processing being executed is either completed or has been suspended for some reason.","answer_id":16150},{"id":3806,"question":"Which of the following is an appropriate explanation of memory interleaving?","answer_label":"Main memory is divided into multiple banks, and each bank is concurrently accessed in order to accelerate access from the CPU to main memory.","answer_id":16114},{"id":2790,"question":"Which of the following shows the path information from the front page of a web site to the current page, a user is currently viewing?","answer_label":"Breadcrumbs","answer_id":12159},{"id":827,"question":"Which of the following are components of a UML2.x (including 2.0 and later versions) state diagram?","answer_label":"State and Transition","answer_id":4801},{"id":6382,"question":"Which of the following is the appropriate explanation of RPC in a client/server system?","answer_label":"It is a method of communication between programs, where parts of the process are assigned to another computer.","answer_id":25654},{"id":2781,"question":"Which of the following is an appropriate graph that shows the relationship between CPU utilization and average response time in an online real-time system? Here, transactions occur according to a Poisson distribution, and the processing time for a transaction follows an exponential distribution.","answer_label":"![](https://learn.viblo.asia/uploads/6/2/6280db51-ea55-43c0-924d-53796dd8a692.png)","answer_id":12123},{"id":1859,"question":"Which of the following is an addressing mode that provides an offset to the program counter (PC) content to determine the address of the operand?","answer_label":"Relative addressing mode","answer_id":8646},{"id":802,"question":"Which of the following is an appropriate description concerning MTBF and MTTR?","answer_label":"MTBF of a system increases through preventive maintenance.","answer_id":4904},{"id":1612,"question":"Which of the following is an appropriate explanation of DRAM?","answer_label":"It is memory that needs to be refreshed, and is used for main memory in a PC.","answer_id":7575},{"id":3632,"question":"The half adder in the diagram below adds one-digit binary numbers x and y, and produces z (the first digit of the sum) and c (carry) as output. Which of the following is the appropriate combination of elements A and B?\n![](https://learn.viblo.asia/uploads/8/e/8eaa2d7a-1497-4dfa-9a43-1edbb603c732.png)\n![](https://learn.viblo.asia/uploads/5/3/53373bd3-bb38-4641-b7ba-158b706ccfb3.png)","answer_label":"a","answer_id":15443},{"id":4594,"question":"The FIFO method is used as the page-replacing algorithm in virtual memory. There\nare 3 page frames available for a program in main memory, and the page numbers\nreferred to by a program are 4 → 3 → 2 →1 → 3 → 5 → 2 in this order. How many\ntimes does page-in occur during execution of the program? Here, nothing is loaded\ninto main memory in the initial state.","answer_label":"5","answer_id":19093},{"id":4301,"question":"Which of the following is a display, with low-voltage operation and low-power consumption, which does not need backlighting because it emits light when voltage is applied?","answer_label":"OLED","answer_id":18067},{"id":1807,"question":"Which of the following is an appropriate purpose of the parity check of a memory module?","answer_label":"To detect the occurrence of an error during reading","answer_id":8436},{"id":1868,"question":"Which of the following is a sequential circuit that has two (2) stable states?","answer_label":"Flip-flop","answer_id":8680},{"id":3621,"question":"As shown in the figure, this configuration consists of two systems. One performs on-line processing as an active system, and the other prepares for failure of the active system as a standby system. The standby system usually performs batch processing. What is this system configuration called?","answer_label":"Duplex system","answer_id":15400},{"id":2044,"question":"A power supply unit has a rated output power of 500 watts and an efficiency of 80%. In order to obtain an output power of 500 watts from this power supply unit, how many watts is the minimum input power?","answer_label":"625","answer_id":9336},{"id":13787,"question":"Assume that there are three pages in the real memory that can be allocated by the LRU method. Which of the following is the number of page faults for the page reference string shown below? Here, three pages are initially empty, and filling of an empty page is not considered as a page replacement operation. The numbers are the page IDs that come to the system from left to right. \n![](https://learn.viblo.asia/uploads/c/1/c1b99798-b6d1-410f-a6e6-7c5696b36336.png)","answer_label":"7","answer_id":53401},{"id":6036,"question":"Which of the following is the appropriate purpose of defragmentation of hard disks?","answer_label":"To access disk files faster and more efficiently","answer_id":24356},{"id":6069,"question":"Which of the following technologies is used to divide each data file into blocks at constant length and to store them across multiple hard disks that can be accessed in parallel, thereby speeding up file access?","answer_label":"Disk striping","answer_id":24492},{"id":3809,"question":"When a 12-point character is displayed in bitmap on a 96-dpi display screen, how many dots are used for the height of a square font? Here, 1 point is 1/72 inch.","answer_label":"16","answer_id":16126},{"id":4589,"question":"Which of the following appropriately describes cache memory?","answer_label":"Two methods exist: one is to rewrite both the cache and main memory when a write\ninstruction is executed; the other is to rewrite only the cache memory while the main\nmemory is not rewritten until the data is removed from the cache memory.","answer_id":19074},{"id":6081,"question":"When the operational model of a system is shown in the figure below, which of the following represents the correct combination of MTBF and MTTR of the system? Here, $t_i (i = 1, 2, …, n)$ denotes the operating time of the system, and $r_i (i = 1, 2, …, n)$ denotes the repair time of the system.\n![](https://learn.viblo.asia/uploads/1/0/10cc97e9-cdda-4af9-9278-c077cc629273.png)","answer_label":"b","answer_id":24539},{"id":4756,"question":"Which of the following logic circuits (i), (ii), and (iii) is or are equivalent to the circuit shown in Figure 1?\nHere, A and B are input signals and F is an output signal. ![](https://learn.viblo.asia/uploads/e/d/ed81e493-152d-4cf8-a6fa-3e999b0411c1.png)\n stands for an OR gate, ![](https://learn.viblo.asia/uploads/9/e/9e1a4aa0-2caf-44ee-8fe5-5c2cbaab2052.png) for an AND gate, ![](https://learn.viblo.asia/uploads/e/b/ebb56b55-bb8b-4180-933f-4d2890ce13b6.png) for a NAND gate, and ![](https://learn.viblo.asia/uploads/9/0/905f6e18-0823-41c7-845a-af3e0d4fd634.png) for a NOT gate.\n![](https://learn.viblo.asia/uploads/7/8/78cfe53e-5305-4bfd-b7a5-d9326a9bf12d.png)","answer_label":"(i), (ii), and (iii)","answer_id":19661},{"id":736,"question":"In a client/server system, which of the following is the mechanism that reduces the network load between the client and server by placing the frequently used commands on the DBMS on the server in advance?","answer_label":"Stored procedure","answer_id":5168},{"id":1806,"question":"There exists a system that requires the execution of 800,000 instructions per transaction. When the processor performance is 200 MIPS and the utilization rate of the processor is 80%, what is the processing power in transactions per second?","answer_label":"200","answer_id":8432},{"id":2045,"question":"Which of the following is an appropriate description concerning flash memory?","answer_label":"It can write data electrically and erase it electrically in units of blocks.","answer_id":9339},{"id":5082,"question":"When  the average instruction execution time of a computer is 20 nanoseconds, what is the performance of this computer in MIPS?","answer_label":"50","answer_id":20804},{"id":4765,"question":"When an image file is transferred from a PC at hand to another PC separated by a partition without any connection cables, which of the following interfaces can be used?","answer_label":"Bluetooth","answer_id":19694},{"id":4759,"question":"In a certain intrusion detection system, a detector is driven by a 4 KHz crystal clock oscillator and checks intrusion every 1,000 clock pulses. How many times per minute does the detector check intrusion in this system?","answer_label":"240","answer_id":19672},{"id":4588,"question":"Which of the following appropriately explains the pipeline processing method of\nprocessors?","answer_label":"Method whereby one processor simultaneously executes multiple instructions with\nslight delays in time","answer_id":19070},{"id":733,"question":"In 3D computer graphics, which of the following is an explanation of hidden-line removal or hidden-surface removal in rendering?","answer_label":"For the target object, only the portion that is viewable from a specified viewpoint is rendered.","answer_id":5180},{"id":3452,"question":"A certain computer system runs in a multi-programming environment using a non-preemptive algorithm. In this system, two processes A and B are stored in the process queue, and A has a higher priority than B. The table below shows estimated execution time for each process; for example, process A uses CPU, I/O, and then CPU sequentially for 30, 60, and 30 milliseconds respectively. Which of the following is the estimated time in milliseconds to complete both A and B? Here, the multi-processing overhead of OS is negligibly small. In addition, both CPU and I/O operations can be executed concurrently, but I/O operations for A and B cannot be performed in parallel.\n![](https://learn.viblo.asia/uploads/6/d/6daedb6b-d5a9-45bb-a926-fa31a91b8f1c.png)","answer_label":"135","answer_id":14731},{"id":5956,"question":"Which  of  the  following  expressions  shows  the  output  $Z$  of  the  combinational  circuit  using NAND gates as shown below?    Here, “・” stands for the logical product, “+” for the logical sum, and $\\overline {X}$  for the logical negation of $X$.    \n![](https://learn.viblo.asia/uploads/1/8/181ccb93-dffc-4501-9fca-31503bd9a904.png)","answer_label":"b","answer_id":24036},{"id":5959,"question":"Which of the following architectures in a uniprocessor requires multiple functional units that can execute two or more instructions in parallel during a clock cycle by simultaneously dispatching the instructions to the functional units?","answer_label":"Superscalar","answer_id":24049},{"id":1605,"question":"Consider a disk drive that has a capacity of 8 GB. The drive has 5 platters with two surfaces, 10,000 tracks per surface and 200 sectors per track. How many bytes are in each sector? Here, 1GB is 1,000,000,000 bytes","answer_label":"400","answer_id":7549},{"id":2032,"question":"Which of the following is a structural design pattern that allows classes with incompatible interfaces to work together and that can be implemented in either form in the two diagrams below?\n\n![](https://learn.viblo.asia/uploads/1/9/19308b15-5b48-42b7-abb4-44de2bbec5af.png)","answer_label":"Adapter","answer_id":9286},{"id":5968,"question":"The LRU method can be used as one of the methods for replacing blocks between the cache memory and the main memory. Which of the following blocks is subject to replacement by this method?","answer_label":"The block with the longest time since it was referenced last","answer_id":24086},{"id":6376,"question":"Which of the following storage devices has the fastest access time?","answer_label":"CPU register","answer_id":25631},{"id":718,"question":"Which of the following is an appropriate characteristic of SRAM compared to DRAM? Here, SRAM and DRAM are compared in products manufactured in the same or similar semiconductor geometric process.","answer_label":"SRAM uses more transistors in a memory cell compared to DRAM.","answer_id":5237},{"id":521,"question":"Which of the following is the average cycles per instruction (CPI) of a computer that can execute 1 billion instructions per second with a clock rate of 2.4 GHz?","answer_label":"2.4","answer_id":5536},{"id":5973,"question":"There are four hard disk subsystems A, B, C, and D including two or three disks with designated MTBF values as shown in the table below. Which of the following hard disk subsystems can provide the highest reliability? Here, if one of the disks fails in each subsystem, it is regarded as a failure of the entire hard disk subsystem.\n![](https://learn.viblo.asia/uploads/f/a/fac400eb-ed45-488e-b1e4-68e8ba887610.png)","answer_label":"C","answer_id":24105},{"id":6121,"question":"Multiple directories having the names “A” and “B” are managed in the structure shown below.\n![](https://learn.viblo.asia/uploads/7/f/7f3d21cf-23b3-44dc-b568-c8abd98c68ce.png)\nWhen the current directory is changed in order of “\\A\\B → .. → ..\\B → .\\A”, which of the following is the resulting current directory? Here, directories are specified as follows: \n[Methods to specify directories] \n(1) A directory is referenced as “directory name\\···\\directory name”, where the directories on the path are listed and separated with “\\” (backslash) in sequence, followed by “\\”and the directory name.\n(2) The current directory is represented by “.” (one period). \n(3)The directory one level above is represented by “..” (two periods). \n(4) When a reference begins with “\\”, it is assumed that the root directory is omitted from the beginning of the reference.\n(5) When a reference does not start with “\\”, “.”, or “..”, it is assumed that “.\\”, which means that the reference is under the current directory, is omitted from the beginning of the reference.","answer_label":"\\B\\A","answer_id":24701},{"id":1609,"question":"A real-time OS, which performs preemptive scheduling based on priority, schedules the tasks A and B. When A has a higher priority than B, which of the following is an appropriate action that is performed by the real-time OS?","answer_label":"When A is launched during the execution of B, B is put into a “ready” state and A is\r\nexecuted.","answer_id":7563},{"id":4295,"question":"The sequence of virtual page numbers shown below is encountered in the course of execution of programs on a computer with virtual memory.\n\n[Sequence of virtual page numbers]\n\n3 4 2 6 4 7 1 3 2 6 3 5 1 2 3\n\nIn the computer, the LRU page replacement policy is adopted. Main memory has a capacity of 5 pages for programs, and each page is initially empty. What is the page hit ratio (percentage of times that the referenced page is found in main memory) rounded to the nearest integer value?","answer_label":"33","answer_id":18043},{"id":4305,"question":"Which of the following functions can reduce the network load by placing a frequently-used instruction set on the server in advance, when accessing a database in a client/server system?","answer_label":"Stored procedure function","answer_id":18084},{"id":5972,"question":"Which of the following is an appropriate explanation of fault-tolerant systems?","answer_label":"Even in the event of a partial system failure, the system as a whole can provide necessary operational capabilities.","answer_id":24099},{"id":6031,"question":"In a certain CPU, a floating point adder unit uses a total of 40 percent of the execution time. If the floating point adder unit is replaced with a new unit whose speed is ten times faster than the original unit, approximately how many times faster is the new CPU than the original one? Here, there is no modification in the instruction set of the new CPU.","answer_label":"1.56","answer_id":24338},{"id":4760,"question":"Which of the following addressing modes is shown in the figure below?\n![](https://learn.viblo.asia/uploads/8/b/8b4015dd-6b1f-4e80-932a-d91820bdc1a0.png)","answer_label":"Indexed addressing mode","answer_id":19675},{"id":3453,"question":"Which of the following is the appropriate CASE tool that is prepared especially for the software development phases including program design, programming, and testing?","answer_label":"Lower CASE tool","answer_id":14736},{"id":3811,"question":"The table below shows the number of failures per day and the average repair time (in minutes) per failure that are observed during the first 2 days in a newly installed system. What is the approximate availability of the system during that period? Here, the system is expected to operate for 24 hours every day.\r\n![](https://learn.viblo.asia/uploads/d/f/df1fa8bb-4cb8-4b5a-b917-16f69f2335e7.png)","answer_label":"0.83","answer_id":16134},{"id":4772,"question":"Which of the following is the system configuration with the highest availability? Here, multiple systems connected in parallel are considered operating if at least one system is operating.","answer_label":"Three identical systems with each availability of 80% in parallel connection","answer_id":19724},{"id":1614,"question":"In the process of creating animation, which of the following is used to incorporate the natural movement of objects, humans and animals, by using sensors and video cameras?","answer_label":"Motion capture","answer_id":7585},{"id":3318,"question":"Which of the following is the appropriate course of actions to be taken by a processor\nat the occurrence of an interrupt?\n(1) Saving of the program register (i.e., program counter)\n(2) Transition from the user mode to the privilege mode\n(3) Determination of the start address of the interrupt processing routine\n(4) Execution of the interrupt processing routine","answer_label":"2->1->3->4","answer_id":14208},{"id":1607,"question":"Which of the following is an appropriate description concerning the reliability of a computer system?","answer_label":"Preventive maintenance of systems is performed to increase MTBF","answer_id":7557},{"id":6381,"question":"Which of the following is the appropriate set of major functions supported by an OS?","answer_label":"Data management, job management, and task management","answer_id":25651},{"id":6061,"question":"Which of the following is the highest priority process just after execution of each instruction on CPU?","answer_label":"Check if there are any interrupts waiting","answer_id":24458},{"id":5089,"question":"Which of the following is an appropriate description concerning MTBF and MTTR?","answer_label":"MTBF increases through the preventive maintenance of a system.","answer_id":20830},{"id":3808,"question":"Which of the following is widely used as storage media for image data in digital cameras or for music data in portable music players?","answer_label":"Flash memory","answer_id":16120},{"id":3454,"question":"Which of the following is a language processor that can be used to create a program suited to the processing objectives, based on necessary conditions, such as input, process, and output, specified by parameters?","answer_label":"Generator","answer_id":14740},{"id":4288,"question":"Which of the following is the correct combination of various addressing modes? Here, $X_1$ is an address which is stored in a program counter. $X_2$ is an address part of an instruction which is addressed by $X_1$. $X_3$ is an address in which an operand needed to execute an instruction is stored. $X_4$ is a value in an index register. ($X_2$) means the contents of location $X_2$.\n![](https://learn.viblo.asia/uploads/6/1/61735dcc-3232-492e-943d-d4512b9ef45f.png)","answer_label":"b","answer_id":18015},{"id":6367,"question":"The figure shown below represents a logic gate and its timing chart. Which of the following is an appropriate logical function of this gate? Here, both A and B are the input signals and F is the output signal.\n![](https://learn.viblo.asia/uploads/2/f/2f68463c-bb25-4eec-a1b9-1b9f5106b497.png)","answer_label":"Exclusive-NOR","answer_id":25595},{"id":4771,"question":"When a certain job is executed in a computer system, 35 percent of the total processing time of the job is used for CPU and the rest is spent waiting for I/O to complete. If a newer CPU whose speed is three times faster than the current one is installed, approximately how many times faster is the new system than the current system? Here, the system environment except for the CPU remains unchanged.","answer_label":"1.3","answer_id":19719},{"id":5970,"question":"Which of the following descriptions about file storage is appropriate as the explanation of an archive?","answer_label":"It bundles multiple files into one file and stores it in a storage device.","answer_id":24091},{"id":2784,"question":"In a paged virtual memory system, the LRU method is used in the page replacement algorithm. When the page frame assigned to the main memory is 4, and pages are accessed in the order of 1, 2, 3, 4, 5, 2, 1, 3, 2, 6, which of the following page is replaced at the time of accessing page 6? Here, no page exists in the main memory in the initial state.","answer_label":"5","answer_id":12138},{"id":4294,"question":"There is a hard disk drive with specifications shown below. When a record of 15 Kilobytes is processed, which of the following is the average access time in milliseconds? Here, the record is stored in one track.\n\n[Specifications]\n\nCapacity: 25 Kilobytes/track\n\nRotation speed: 2,400 revolutions/minute\n\nAverage seek time: 10 milliseconds","answer_label":"37.5","answer_id":18039},{"id":6373,"question":"A processor with a 256-Mbyte address space is using the address “35E3C03” to access a 16-Mbyte memory device. What are the highest and lowest addresses in the memory map of the 16-Mbyte memory device?    Here, the memory addresses are expressed in hexadecimal. \n![](https://learn.viblo.asia/uploads/e/6/e61672e2-efea-4112-8ed0-de6a3fb5a656.png)","answer_label":"b","answer_id":25619},{"id":1864,"question":"When the multiplicity of processing is increased in the virtual memory of a computer system, page-in and page-out operations occur very frequently, and the response speed of the system decreases suddenly. What is this phenomenon called?","answer_label":"Thrashing","answer_id":8666},{"id":3322,"question":"Which of the following is a technique of dividing the data of each file into blocks of a\nfixed size, distributing and deploying those data blocks on multiple hard disks that can\nbe accessed in parallel, and thereby improving the file access speed?","answer_label":"Disk striping","answer_id":14224},{"id":6124,"question":"The figure below shows a logic circuit representing a full adder. When 1, 0, and 1 are entered into x, y, and z respectively, which of the following is the appropriate combination of the output values of c (carry) and s (sum)?\n![](https://learn.viblo.asia/uploads/9/f/9fc836b7-07dd-4e01-a3a2-190722d64352.png)","answer_label":"c","answer_id":24712},{"id":13780,"question":"Which of the following is an appropriate characteristic of SRAM compared with DRAM?","answer_label":"SRAM does not need to be refreshed periodically as flips flops retain data, and DRAM needs to be refreshed at fixed intervals to retain data.","answer_id":53372},{"id":13785,"question":"When the number of concurrently running programs is increased in a virtual storage system with a small and insufficient main memory capacity, which of the following is the state in which the overhead of the system increases and the processor utilization of the applications decreases","answer_label":"Thrashing","answer_id":53393},{"id":803,"question":"In virtual memory management, which of the following page replacement methods replaces the page for which the most time has passed since it was last used?","answer_label":"LRU","answer_id":4901},{"id":2921,"question":"When a 1-megabyte memory is connected to the MPU as shown in the figure below, what is the minimum number of signal lines (represented as n ) required by address buses? Here, the memory is accessed in units of bytes. In addition, 1 megabyte = 1,024 kilobytes and 1 kilobyte = 1,024 bytes.\n![](https://learn.viblo.asia/uploads/6/d/6d1fcf28-fa81-46f7-b85d-cf24a512c73f.png)","answer_label":"20","answer_id":12671},{"id":4768,"question":"When a printing operation is performed under the conditions shown below, what is the minimum number of megabytes necessary as the total capacity of the spool file?\n[Conditions]\n(1) The same job is executed continuously four times with multiplicity 1.\n(2) It takes 20 minutes to execute the job in a standalone mode.\n(3) The standalone job secures a 400-Mbyte print-spool file, where the printing data is stored.\n(4) After the job is executed, the contents of the spool file are processed by the printing function of the OS.\n(5) The OS deletes the spool file at the completion of the printing. Here, the time for this deletion can be ignored.\n(6) There is exactly one printer, and its printing speed is 10 Mbytes per minute.\n(7) Job execution and printing can be performed in parallel without one affecting the other.","answer_label":"1,200","answer_id":19708},{"id":1813,"question":"When SRT (Shortest Remaining Time), also known as SRTF (Shortest Remaining Time First), is used as a scheduling method for three processes P1 through P3 shown in the table below, what is the total waiting time (in seconds) of P2 that elapses before its execution completion?![](https://learn.viblo.asia/uploads/5/4/5454b63f-c6f1-41de-bc49-dc807bdd5051.png)","answer_label":"15","answer_id":8461},{"id":5086,"question":"Which of the following is the most appropriate explanation of cloud computing?","answer_label":"It  provides  the  resources  of  a  computer  via  a  network  so  that  the  user  can  easily  receive services with high scalability and availability.","answer_id":20820},{"id":4592,"question":"In a multiprogramming environment, there is a need to limit access to shared\nresources; that is, the current process has exclusive use of the assigned resources for\nsome period of time. Which of the following appropriately describes the function to\nsuccessfully implement this type of exclusive control?","answer_label":"A semaphore variable is used to indicate the status of common resource.","answer_id":19084}]