[{"id":13868,"question":"Công ty ABC áp dụng chính sách sao lưu ba thế hệ. Hệ thống của công ty ABC tự động thực hiện sao lưu toàn bộ vào ngày 10, 17 và 25 của mỗi tháng. Nếu bản sao lưu gần nhất được thực hiện vào ngày 17 tháng 9, đâu là ngày thông tin cũ nhất được sao lưu?","answer_label":"25 tháng 8","answer_id":53723},{"id":13454,"question":"Một bộ chuyển đổi D/A với sự phân giải của 8 bit tạo ra một điện áp đầu ra 0 vôn cho một giá trị đầu vào số là 0, và điện áp đầu ra 2,5 vôn cho một giá trị đầu vào số 128. Khi bit 1 thấp nhất của giá trị đầu vào số được thay đổi, đáp án nào sau đây là sự thay đổi (tính bằng vôn) của điện áp đầu ra được tạo ra bởi bộ chuyển đổi D/A?","answer_label":"2.5/128","answer_id":52066},{"id":13456,"question":"Mạch nào sau đây tương đương với mạch logic được hiển thị bên dưới?\n![](https://learn.viblo.asia/uploads/4/9/4939cdc7-0ef1-4687-864c-094fed6bdf13.jpg)","answer_label":"![](https://learn.viblo.asia/uploads/3/f/3fdde26d-095b-43c5-a518-27a30eccaed0.jpg)","answer_id":52076},{"id":13343,"question":"Lựa chọn nào sau đây là kiến trúc máy tính ở đó một bộ xử lý thực thi cùng một lệnh trên nhiều dữ liệu?","answer_label":"SIMD","answer_id":51624},{"id":13346,"question":"Lựa chọn nào sau đây là mô tả thích hợp liên quan đến bộ nhớ cache?","answer_label":"Các bộ đa xử lý ở đó bộ nhớ cache cần để đồng bộ các giá trị bên trong cache để duy trì liên lạc","answer_id":51635},{"id":13347,"question":"Lựa chọn nào sau đây là kỹ thuật của việc phân đoạn và lưu trữ dữ liệu trên nhiều ổ đĩa cứng như trong hình minh họa? Ở đây b0 tới b15 thể hiện dãy mà trong đó dữ liệu được lưu trữ trên các đĩa dữ liệu theo từng bit một.\n![](https://learn.viblo.asia/uploads/9/6/96b7c478-2803-44cd-b458-d03affa2a6ff.jpg)","answer_label":"Phân dải (Striping)","answer_id":51641},{"id":13480,"question":"Lựa chọn nào sau đây là một mạch tuần tự mà có hai (2) trạng thái ổn định?","answer_label":"Flip-flop","answer_id":52171},{"id":14090,"question":"Lựa chọn nào dưới đây được phân loại như chức năng của công cụ kiểm thử tĩnh?","answer_label":"Phát hiện một lỗi trong một chương trình nhờ việc phân tích mã nguồn","answer_id":54435},{"id":13430,"question":"Khi hệ số nhân của việc xử lý được tăng lên trong bộ nhớ ảo của một hệ thống máy tính, các thao tác page-in và page-out xuất hiện thường xuyên, và tốc độ phản hồi của hệ thống giảm đột ngột. Hiện tượng này gọi là gì?","answer_label":"Thrashing","answer_id":51973},{"id":13444,"question":"Thiết bị nào sau đây là thiết bị đầu ra cho máy tính?","answer_label":"Máy in","answer_id":52028},{"id":14092,"question":"Một bộ chuyển đổi D/A (số-sang-tương-tự) với một độ phân giải 8 bit sinh ra điện áp đầu ra 0 vôn đối với giá trị đầu vào số 0, và điện áp đầu ra 2,5 vôn đối với giá trị đầu vào số 128. Khi một bit thấp nhất của giá trị đầu vào số được thay đổi, lựa chọn nào sau đây là sự thay đổi (tính theo vôn) của điện áp đầu ra mà được sinh ra bởi bộ chuyển đổi D/A?","answer_label":"2.5/128","answer_id":54442},{"id":13433,"question":"Có một hệ thống được tạo bởi hai (2) CPU, và CPU không dùng sẽ được gán cho một tác vụ mà đối với nó có một yêu cầu thực thi. Khi hai (2) tác vụ A và B chạy trên hệ thống này, các tác vụ này sử dụng duy nhất một tài nguyên chung R. Hình bên dưới cho thấy các giai đoạn sử dụng của các CPU và tài nguyên R với hai tác vụ A và B, và thứ tự các tác vụ này chạy. Khi việc thực thi cả hai tác vụ được bắt đầu đồng thời, mất bao nhiêu thời gian, tính theo mili-giây, cần thiết đến khi hoàn thành việc xử lý cả hai tác vụ? Ở đây, cả CPU và tài nguyên R đều sẵn dùng khi các tác vụ A và B bắt đầu.\n![](https://learn.viblo.asia/uploads/b/e/beb5a788-1d4a-4b2d-849d-7f46c7634b31.jpg)","answer_label":"140","answer_id":51983},{"id":13481,"question":"Lựa chọn nào sau đây là đầu vào thích hợp đối với một màn hình bảy đoạn dương cực thông dụng để hiển thị ký tự được xem như đầu ra? Ở đây, A là bit có trọng số lớn nhất (MSB) và G là bit có trọng số nhỏ nhất (LSB).\n![](https://learn.viblo.asia/uploads/a/e/ae90476e-e944-4a01-93e8-e6246ad81c5d.jpg)","answer_label":"0110000","answer_id":52174},{"id":14083,"question":"Lựa chọn nào sau đây là phương thức phù hợp nhất cho việc cài đặt một hệ thống chịu lỗi?","answer_label":"Hệ thống được ghép nối với hai hoặc nhiều hơn các máy tính thay vì dùng một máy tính đơn lẻ.","answer_id":54408},{"id":13445,"question":"Lựa chọn nào sau đây là độ trễ quay vòng trung bình của ổ cứng tính bằng mili giây khi tốc độ quay là 2000 vòng/phút?","answer_label":"15","answer_id":52031},{"id":13861,"question":"Phương án nào dưới đây là từ thích hợp để mô tả hiện tượng khi các tệp được tạo ra trong quá trình lưu tệp nằm rải rác tại những phần khác nhau trên toàn bộ đĩa cứng chứ không liên tục trên các liên cung?","answer_label":"Phân mảnh","answer_id":53695},{"id":14093,"question":"Lựa chọn nào sau đây là một mô-đun bộ nhớ mà dùng một mạch lật trong một ô nhớ?","answer_label":"SRAM","answer_id":54449},{"id":13434,"question":"Theo Định nghĩa Phần mềm Mở của OSI (Open Source Initiative), lựa chọn nào sau đây là mô tả phù hợp liên quan đến giấy phép mã mở?","answer_label":"Giấy phép yêu cầu rằng mã nguồn của một chương trình phải được thực hiện sẵn sàng cho việc sử dụng miễn phí hoặc với một chi phí tái sản xuất hợp lý.","answer_id":51989},{"id":13452,"question":"Với thủ tục chuyển giữa nhiều chương trình của các tiến trình thể hiện trong hình bên dưới, đáp án nào sau đây là sự kết hợp thích hợp của việc xử lý hệ điều hành từ A đến C?\n![](https://learn.viblo.asia/uploads/2/7/27dc4c49-db7e-46a2-8c92-fcccd836574b.jpg)","answer_label":"A: Lưu lại trạng thái chạy\r\nB: Lựa chọn tiến trình\r\nC: Phục hồi trạng thái chạy","answer_id":52060},{"id":13858,"question":"Phương án nào dưới đây là kiến trúc máy tính có bộ xử lý thực hiện nhiều luồng lệnh và nhiều luồng dữ liệu song song?","answer_label":"MIMD","answer_id":53682},{"id":13447,"question":"Điều nào sau đây là một đặc tính của cụm cấu hình HA (High Availability) dựa trên một phương pháp dự phòng nóng khi nó được so sánh với cụm cấu hình phân phối tải sử dụng bộ cân bằng tải?","answer_label":"Một máy chủ có cùng đặc điểm kỹ thuật là cần thiết như một máy chủ thứ cấp, nhưng vì các tiến trình được chuyển qua máy chủ thứ cấp trong trường hợp hỏng hóc chính nên thông lượng có thể được duy trì ngay cả trong trường hợp hỏng hóc.","answer_id":52038},{"id":13431,"question":"Một công ty thực hiện sao lưu toàn bộ vào mỗi tối Chủ Nhật và sao lưu khác biệt vào mỗi tối khác ngoài tối Chủ Nhật. Nếu lỗi xuất hiện vào sáng thứ Tư, các sao lưu nào dưới đây là cần thiết ít nhất để khôi phục hệ thống?","answer_label":"Các sao lưu khác biệt mới nhất và sao lưu toàn bộ mới nhất từ thứ Ba.","answer_id":51976},{"id":13864,"question":"Lựa chọn nào sau đây là mô tả thích hợp liên quan đến MTBF và MTTR?","answer_label":"MTBF của một hệ thống tăng lên thông qua bảo trì dự phòng.","answer_id":53708},{"id":13862,"question":"Phương án nào sau đây là lời giải thích hợp lý về điện toán lưới?","answer_label":"Một tác vụ tính toán được phân chia cho một số máy tính trong mạng để đạt được năng lực tính toán cần thiết.","answer_id":53698},{"id":13869,"question":"Phương án nào dưới đây là một phương pháp thực hiện việc tích hợp các mô-đun cấu hình một chương trình trong thời gian thực thi chương trình?","answer_label":"Liên kết động","answer_id":53726},{"id":13860,"question":"Phương án nào sau đây thích hợp với vai trò của một bộ điều khiển thiết bị (device driver)?","answer_label":"Nó trực tiếp quản lý phần cứng theo các yêu cầu từ chương trình ứng dụng.","answer_id":53691},{"id":13450,"question":"Trong một tệp tin tổ chức trực tiếp có nhiều địa chỉ lưu trữ từ một (1) đến sáu (6), dữ liệu được lưu trữ dưới các điều kiện phía dưới đây. Giá trị khóa nào của dữ liệu được lưu trữ trong địa chỉ một (1)?\n\n[Điều kiện]\n\n(1) Dữ liệu được lưu trữ theo thứ tự các giá trị khóa ba (3), bốn (4), tám (8), 13, 14, và 18.\n\n(2) Địa chỉ lưu trữ là giá trị mà phần còn lại thu được bằng cách chia giá trị dữ liệu quan trọng cho năm (5) và sau đó thêm một (1) vào.\n\n(3) Nếu địa chỉ lưu trữ đã bị chiếm, dữ liệu được lưu trữ trong địa chỉ kế tiếp. Quá trình này được lặp lại cho đến khi dữ liệu được lưu trữ. Địa chỉ tiếp theo của địa chỉ cuối cùng là địa chỉ đầu tiên. \n\n(4) Trong trạng thái ban đầu, không có gì được lưu trữ trong tệp tin.","answer_label":"13","answer_id":52051},{"id":14082,"question":"Lựa chọn nào sau đây là mô tả thích hợp của bảng cảm ứng điện dung?","answer_label":"Một trường điện được hình thành trên bề mặt của bảng điều khiển cảm ứng, và vị trí chạm được phát hiện bằng cách bắt sự thay đổi của điện tích bề mặt.","answer_id":54402},{"id":13451,"question":"Điều nào sau đây được phân loại như một chức năng của một công cụ kiểm tra tĩnh?","answer_label":"Phát hiện một lỗi trong chương trình bằng cách phân tích mã nguồn","answer_id":52055},{"id":14085,"question":"Có tồn tại hai thiết bị giống nhau, mỗi thiết bị có MTBF là 45 giờ và MTTR là 5 giờ. Đâu là mức độ sẵn dùng của một hệ thống mà kết nối tuần tự hai thiết bị này?","answer_label":"0.81","answer_id":54414},{"id":14084,"question":"Lựa chọn nào sau đây là giải thích phù hợp nhất của một kiểm tra điểm chuẩn đối với một hệ thống máy tính?","answer_label":"Hiệu năng xử lý của một hệ thống được so sánh với các hệ thống khác về các điểm số nhận được nhờ việc thực hiện phần mềm cho việc đo kiểm.","answer_id":54412},{"id":13432,"question":"Lựa chọn nào sau đây là giải thích phù hợp về phương pháp lập lịch không ưu tiên?","answer_label":"Một tác vụ không thể di chuyển đến một trạng thái đang hoạt động cho đến khi một tác vụ khác trong trạng thái đang hoạt động hoặc tự nó chuyển sang trạng thái chờ đợi hoặc kết thúc.","answer_id":51978},{"id":13449,"question":"Phương án nào sau đây là lỗi trang trong một hệ thống bộ nhớ ảo?","answer_label":"Truy cập vào một trang được ánh xạ trong bộ nhớ ảo, nhưng không được tải trong bộ nhớ vật lý","answer_id":52046},{"id":14086,"question":"Trong các mô tả liên quan tới việc lập lịch tiến trình, lựa chọn nào sau đây là một giải thích phù hợp về phương pháp xoay vòng?","answer_label":"Các tài nguyên CPU được cấp phát cho tiến trình có thể thực thi đầu tiên trong hàng đợi khi một ngắt theo khoảng thời gian được tạo ra.","answer_id":54420},{"id":13446,"question":"Điều nào sau đây là một phương pháp làm tăng tốc độ dữ liệu vào / ra bằng cách chia dữ liệu tuần tự logic và ghi dữ liệu được chia thành nhiều đĩa cứng?","answer_label":"Striping","answer_id":52036},{"id":13455,"question":"Các mạch cộng bán phần trong sơ đồ dưới đây cộng hai (2) số nhị phân một chữ số x và y, và có z (số đầu tiên của tổng) và c (bit nhớ) là đầu ra. Đáp án nào sau đây là sự kết hợp thích hợp của các thiết bị cổng A và B?\n![](https://learn.viblo.asia/uploads/e/0/e0f5d9ad-09a4-4395-8d0f-ba23d32eb793.jpg)","answer_label":"A: Exclusive logical sum (XOR)\r\nB: Logical product (AND)","answer_id":52070},{"id":13479,"question":"![](https://learn.viblo.asia/uploads/3/b/3b79dbc7-bfe8-4c9f-8a90-aadd9e443796.jpg)","answer_label":"![](https://learn.viblo.asia/uploads/d/d/dd193ad5-fff1-4445-8463-48d764628562.jpg)","answer_id":52169},{"id":13857,"question":"Lựa chọn nào sau đây là phương thức đánh địa chỉ mà lệnh chứa địa chỉ đó và địa chỉ đó được thay đổi bởi giá trị từ thanh ghi khác?","answer_label":"Phương thức đánh địa chỉ chỉ số","answer_id":53679},{"id":14091,"question":"Mạch logic dưới đây cho biết một mạch lật JK. Lựa chọn nào sau đây là bảng chân lý phù hợp đối với mạch lật JK. Ở đây, trạng thái của mỗi tín hiệu đầu ra bị ảnh hưởng chỉ khi tín hiệu đồng hồ CLK thay đổi từ 0 sang 1. “Không đổi” nghĩa là mỗi tín hiệu đầu ra duy trì trạng thái trước đó của nó, và “Chuyển” nghĩa là mỗi tín hiệu đầu ra thay đổi (hoặc chuyển đổi) trạng thái của nó “từ 0 sang 1” hoặc “từ 1 sang 0.”\n![](https://learn.viblo.asia/uploads/1/e/1e1e7dc7-d49a-4fff-b4da-cc5d60bba313.png)","answer_label":"a","answer_id":54438},{"id":13448,"question":"Câu nào sau đây là mô tả thích hợp liên quan đến độ sẵn sàng của hệ thống?","answer_label":"Nếu MTTR có thể được rút ngắn mà không thay đổi MTBF, độ sẵn sàng của hệ thống được cải thiện.","answer_id":52043},{"id":13863,"question":"Xem xét một hệ thống RAID 0 (tức là, phân chia cấp độ khối, không sử dụng chẵn lẻ hoặc phản chiếu) với hai đĩa; Khi dữ liệu được phân bố đều trên hai đĩa và cả hai đĩa đều có tỷ lệ lỗi là 0,1% thì tỷ lệ lỗi chung của hệ thống RAID là bao nhiêu? Ở đây, tỷ lệ thất bại tổng thể đề cập đến xác suất mà hệ thống không thể lấy được dữ liệu từ một trong hai đĩa.","answer_label":"0.1999","answer_id":53704},{"id":13859,"question":"Phương án nào dưới đây là một giải thích thích hợp về việc chèn bộ nhớ?","answer_label":"Nó cho phép CPU truy cập các băng của bộ nhớ chính đồng thời","answer_id":53686},{"id":13345,"question":"Lựa chọn nào sau đây được dùng để dịch địa chỉ logic được sinh ra bởi CPU thành một địa chỉ vật lý?","answer_label":"Memory Management Unit (MMU)","answer_id":51632},{"id":13443,"question":"Một máy tính có hai mức bộ nhớ, bộ nhớ cache và bộ nhớ chính, với thời gian truy cập là 0,01 μs và 0,1 μs tương ứng. Nếu tỷ lệ truy cập của bộ nhớ cache là 90%, lựa chọn nào sau đây là thời gian truy cập bộ nhớ trung bình cho hệ thống này? Trong trường hợp này, nếu dữ liệu nằm trong bộ nhớ cache, bộ xử lý sẽ truy cập dữ liệu trực tiếp với thời gian truy cập là 0,01 μs. Tuy nhiên, nếu truy cập bộ nhớ cache thất bại, trước tiên dữ liệu phải được chuyển từ bộ nhớ chính vào bộ nhớ cache, sau đó được truy cập từ bộ nhớ cache. Do đó, thời gian truy cập là 0.11 μs.","answer_label":"0,020 µs","answer_id":52024},{"id":13348,"question":"Lựa chọn nào sau đây là mô tả thích hợp về thông lượng?","answer_label":"Spooling, liên quan tới việc tạm thời tiết kiệm đầu ra cho một máy in trong một đĩa cứng, rất hữu ích trong việc cải thiện thông lượng.","answer_id":51644},{"id":13872,"question":"Mạch nào trong các mạch logic sau đáp ứng các điều kiện được mô tả dưới đây?\n\n[Điều kiện]\nĐèn được bật và tắt bằng cách sử dụng các công tắc A và B ở đầu và cuối cầu thang. Đèn có thể được bật và tắt bằng cách sử dụng một công tắc, bất kể trạng thái của công tắc kia.\n\n![](https://learn.viblo.asia/uploads/6/c/6c8f6f60-31f8-4092-a4d6-227f2ce91d88.png)","answer_label":"XOR","answer_id":53741},{"id":13442,"question":"Lựa chọn nào trong các phương thức đánh địa chỉ sau đây xác định địa chỉ có hiệu lực bằng cách thêm giá trị của thanh ghi địa chỉ lệnh (bộ đếm chương trình) vào giá trị được ghi trong phần địa chỉ của lệnh?","answer_label":"Địa chỉ tương đối","answer_id":52021},{"id":14080,"question":"Có tồn tại một hệ thống mà yêu cầu việc thực hiện 800.000 lệnh trên mỗi giao tác. Khi hiệu năng bộ xử lý là 200 MIPS và tỷ lệ hiệu dụng của bộ xử lý là 80%, đâu là công suất xử lý theo số giao tác mỗi giây?","answer_label":"200","answer_id":54395},{"id":14081,"question":"Lựa chọn nào sau đây là mục đích phù hợp của kiểm tra chẵn lẻ của một mô-đun bộ nhớ?","answer_label":"Để phát hiện sự xuất hiện của một lỗi trong khi đọc","answer_id":54399},{"id":13453,"question":"Điều nào sau đây là chức năng thích hợp của trình liên kết?","answer_label":"Tạo một mô-đun tải từ nhiều mô-đun đối tượng bằng cách thực hiện các hoạt động như phân giải chéo tham chiếu","answer_id":52062},{"id":13871,"question":"Phương án nào sau đây là mạch logic tạo ra “1” là tín hiệu đầu ra Z, chỉ khi tín hiệu đầu vào X và Y có cùng giá trị?\n![](https://learn.viblo.asia/uploads/0/8/08707157-bb53-40ff-b88e-02d56d421ae9.png)","answer_label":"c","answer_id":53736},{"id":13866,"question":"Trong việc quản lý bộ nhớ ảo, phương pháp thay thế trang nào sau đây sẽ thay thế trang đã chiếm nhiều thời gian nhất kể từ lần sử dụng cuối cùng?","answer_label":"LRU","answer_id":53717},{"id":13867,"question":"Các phương pháp biểu diễn kết quả phân tích cú pháp trong trình biên dịch có định dạng bộ tứ.\n(Toán tử, Toán hạng 1, Toán hạng 2, Kết quả)\nĐịnh dạng này chỉ ra việc áp dụng Toán tử đối với Toán hạng 1 và Toán hạng 2 để cho ra Kết quả. Biểu thức nào sau đây là kết quả của chuỗi bộ tứ biểu diễn cho việc phân tích cú pháp? Ở đây, T1, T2, và T3 chỉ ra các biến tạm thời.\n\n\t\t\t(*,B,C,T1 )\n\t\t\t(/,T1 ,D,T2 )\n\t\t\t(+,A,T2 ,T3 )","answer_label":"A+B*C/D","answer_id":53718},{"id":14079,"question":"Như đã cho trong hình và bảng bên dưới, có hai kiểu CPU X và Y mà có cùng cấu hình ngoại trừ việc thời gian truy cập bộ nhớ cache và bộ nhớ chính là khác nhau. Mọi điều kiện khác của hai CPU này là như nhau.\nKhi một chương trình được thực thi bởi cả hai CPU X và Y, thời gian xử lý của mỗi CPU là như nhau. Dưới những điều kiện này, đâu là tỷ lệ thả trúng của bộ nhớ cache? Ở đây, không có ảnh hưởng gì khác ngoài việc xử lý CPU.\n![](https://learn.viblo.asia/uploads/c/e/ce5b4ec6-475a-4da1-905b-525e89ecd904.png)","answer_label":"0.9","answer_id":54391},{"id":13341,"question":"Một CPU với một đường ống bốn trạng thái gồm nạp, giải mã, thực thi, và ghi lại, mỗi trạng thái mất tương ứng 10, 6, 8, và 8 ns. Lựa chọn nào sau đây là thời gian thực thi lệnh trung bình tính theo nanô-giây (ns) của CPU? Ở đây, số lệnh được thực thi là đủ lớn. Ngoài ra, phụ phí của tiến trình pipeline là không đáng kể, và tác động gây trễ của tất cả các xung đột được bỏ qua.","answer_label":"10","answer_id":51616},{"id":13865,"question":"Round robin (với thời gian phân bổ 3 giây) được sử dụng làm phương pháp lập lịch cho ba tiến trình theo thứ tự P1, P2, và P3, thể hiện trong bảng dưới đây. Tổng thời gian chờ đợi (tính bằng giây) của P3 trước khi nó được thực hiện hoàn chỉnh là bao nhiêu? Ở đây, thời gian tới là thời gian mà tại đó một tiến trình nhập vào hàng đợi sẵn sàng.\n\n![](https://learn.viblo.asia/uploads/0/b/0bf2ac12-ef40-497c-a7ad-99bb240c322b.png)","answer_label":"35","answer_id":53710},{"id":14088,"question":"Lựa chọn nào sau đây là giải thích về chức năng của bộ lưu trữ mà là một trong các công cụ quản lý dữ liệu?","answer_label":"Là việc gộp vài tệp vào trong một tệp, hoặc trả một tệp về điều kiện ban đầu của nó để thực hiện việc sao lưu và phân phối dữ liệu","answer_id":54426},{"id":13870,"question":"Phương án nào dưới đây là đặc điểm của DRAM?","answer_label":"Cấu trúc các ô nhớ đơn giản, vì vậy có thể tích hợp cao để có được mức giá thấp cho mỗi bit","answer_id":53732},{"id":13344,"question":"Lựa chọn nào sau đây là phương thức đánh địa chỉ cung cấp offset cho nội dung bộ đếm chương trình (PC) để quyết định địa chỉ của toán hạng?","answer_label":"Phương thức đánh địa chỉ tương đối","answer_id":51629},{"id":13429,"question":"Lựa chọn nào sau đây là giá trị thời gian trung bình giữa các lỗi (MTBF) của toàn bộ hệ thống ở đó đơn vị A và đơn vị B được ghép nối tiếp và cả hai đơn vị hoạt động như một hệ thống? Giá trị MTBF của đơn vị A và đơn vị B lần lượt là 200 và 300 giờ.","answer_label":"250","answer_id":51967},{"id":14089,"question":"Lựa chọn nào sau đây là một giải thích phù hợp của việc tối ưu trong một bộ biên dịch?","answer_label":"Việc sinh ra một mã đối tượng với hiệu quả quá trình chạy được cải tiến nhờ việc phân tích mã nguồn","answer_id":54433},{"id":14087,"question":"Khi SRT (Thời gian còn lại ngắn nhất), cũng được biết đến là SRTF (Thời gian còn lại ngắn nhất trước tiên), được dùng như một phương pháp lập lịch đối với ba tiến trình từ P1 tới P3 được cho trong bảng dưới đây, đâu là tổng thời gian chờ (tính theo giây) đã qua của P2 trước khi nó hoàn tất việc thực thi của mình?\n![](https://learn.viblo.asia/uploads/f/2/f2875e38-26c8-43bb-aabb-aaa11019bfae.png)","answer_label":"15","answer_id":54424}]