[{"id":6010,"question":"Which of the following shows the appropriate sequence of items 1 through 3 that are required for establishing ISMS according to ISO/IEC27001:2005? \n[Items] \n1. Prepare a Statement of Applicability \n2. Select control objectives and controls for the treatment of risks \n3. Analyze and evaluate the risks","answer_label":"3 → 2 → 1","answer_id":24254},{"id":648,"question":"Which of the following is an appropriate description of the scope of software protection under Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS)?","answer_label":"Both source programs and object programs are protected.","answer_id":5276},{"id":486,"question":"Which of the following situation is judged as appropriate when conducting an audit on a Business Continuity Plan (BCP)?","answer_label":"An emergency contact list of employees is created and updated to the latest version.","answer_id":5837},{"id":4699,"question":"When a publisher’s lead editor omits a section of an author’s manuscript without obtaining the consent of the author, which of the following is infringed according to the international treaty called the Berne Convention for the Protection of Literary and Artistic Works?","answer_label":"Moral rights","answer_id":19477},{"id":4818,"question":"Which of the following is the explanation of a control chart?","answer_label":"Variation of data occurring in time sequence is expressed by a line graph; it is used to find an abnormal behavior, with an upper limit and a lower limit specified.","answer_id":19909},{"id":6175,"question":"Which of the following sets of standards should be applied for the purpose of developing the new products that are expected to be employed by government agencies of countries who are members of the WTO?","answer_label":"ISO standards","answer_id":24917},{"id":646,"question":"When a company sells a product at 17 dollars per unit, and the fixed costs and the variable costs are as shown in the tables below (in dollars), how many units does the company have to sell to earn a profit of 42,000 dollars?\n\nFixed costs:\n| Administration costs | 130,000 |\n| --- | --- |\n| R&D costs | 10,000|\n\nVariable costs per unit:\n|  Raw material costs  | 4 |\n| --- | --- |\n| Administration costs | 3 |","answer_label":"18,200","answer_id":5285},{"id":1789,"question":"Which of the following is a management organization that has a characteristic of both project and functional organizations to flexibly respond to changes in the business environment?","answer_label":"Matrix organization","answer_id":8366},{"id":6427,"question":"Which is the method of solving a problem of the following type: “How can we distribute a resource subject to constraints that can be expressed by first-degree equations so as to obtain a maximum effect?”","answer_label":"Linear programming","answer_id":25836},{"id":647,"question":"Which of the following inventory evaluation methods calculates the inventory unit price by dividing the total purchase amount by the total quantity of items purchased at the end of the accounting period?","answer_label":"Periodic average method","answer_id":5281},{"id":1790,"question":"Company A has two media plans. One plan is for a series of 30-second radio advertisements (ads) and the other is for 60-second TV ads. Exposure is rated in points. The company is considering an exposure of at least 60 points in the city and at most 40 points outside the city. The table below shows the cost and exposure of both TV and radio ads. Which of the following is the set of expressions that can determine the number of media ads to minimize the total cost?\n\n![](https://learn.viblo.asia/uploads/c/0/c0195c2d-eaf3-4111-b663-410324b2fca1.png)","answer_label":"b","answer_id":8368},{"id":6018,"question":"Three products A, B, and C are processed by two machines M1 and M2. Processing must be performed in order of M1→M2 (M1 first and then M2). The table shows the time required to process each product on each machine.In this case, which of the following shows the order of processing these three products so that the time required from the start of the process to the completion of the process for all the products may be the shortest? Here, when processing of a product at M1 is completed, another product can be processed consecutively at M1. Preparation time, such as setup time, is ignored.\n![](https://learn.viblo.asia/uploads/a/d/ad4d9514-425b-40bc-96a3-f0abd7702111.png)","answer_label":"B→A→C","answer_id":24284},{"id":6011,"question":"The projected annual purchase amount and the actual annual transaction value of each client company are plotted on the graph. Which of the following is the appropriate description concerning the future sales policy?\n![](https://learn.viblo.asia/uploads/6/d/6dc28f3d-065b-43cb-b6c3-f3ee8604b8ab.png)","answer_label":"A client in area A has the potential of becoming a major customer, so it is better to strengthen sales activities.","answer_id":24255},{"id":4698,"question":"Which of the following is a financial statement that represents the assets, liabilities, and net assets of a company at a certain point in time and indicates the financial condition of the company?","answer_label":"Balance sheet","answer_id":19472},{"id":4816,"question":"When ABC analysis is done on the products shown in the table below, which of the following is a set of the product numbers that should be handled as management items of Group A?\n![](https://learn.viblo.asia/uploads/1/1/115b5681-6db5-4885-ae1b-97bf12739125.png)","answer_label":"2 and 5","answer_id":19899},{"id":1658,"question":"Break-even point of the new product is 12,000 units a month. Fixed cost is 800,000 dollars a month and variable cost is 20 dollars per unit. Based on the information above, which of the following is a selling price of the new product?","answer_label":"86.67","answer_id":7761},{"id":13845,"question":"Break-even point (BEP) is a point where total costs and total revenue are equal. The table below shows the fixed costs, price per unit, variable costs per unit, and BEP in units for Company A and Company B. \n![](https://learn.viblo.asia/uploads/0/7/07088495-0a9b-4038-a789-eb2da86d297f.png)","answer_label":"d","answer_id":53633},{"id":5227,"question":"An acceptance inspection is to be conducted on a purchased component that has a non-defective ratio of 0.9 and a defective ratio of 0.1. Four plans A though D are proposed for this acceptance inspection. The costs per non-defective and per defective for each plan are shown in the table below. Which of the following is the plan that has the lowest expected cost?\n![](https://learn.viblo.asia/uploads/6/b/6bbfde85-2585-4aca-89f9-2a790c9c0133.png)","answer_label":"C","answer_id":21383},{"id":1794,"question":"Which of the following is not protected by “copyright” that is based on the World Trade Organization’s Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS)?","answer_label":"Programming language and its conventions","answer_id":8385},{"id":497,"question":"To secure transparency of business administration, which of the following is a concept that supervises and monitors a company ’ s activities from the perspective of questions such as for whom the company runs its business, what the structure of the top management is like, and whether the organization has self-improvement capabilities?","answer_label":"Corporate governance","answer_id":5789},{"id":6013,"question":"The table shows the sales, cost, and profit for a certain product in the current period. When the sales unit price of this product is 5 dollars, at least how many should be sold to earn twice or more in profit during the next period?\n![](https://learn.viblo.asia/uploads/3/9/397efabb-0297-4b33-a9c8-9f62edb20fd1.png)","answer_label":"3000","answer_id":24265},{"id":6012,"question":"Which of the following financial statements indicates the assets, liabilities, and net assets of a company at a specific time and shows the financial condition of the company?","answer_label":"Balance sheet","answer_id":24259},{"id":5228,"question":"The table below shows the income statement for a certain company. Which of the following is the amount of sales (in million dollars) at the break-even point?\n![](https://learn.viblo.asia/uploads/c/6/c63068a0-b290-41c6-86d2-8268187d9c27.png)","answer_label":"625","answer_id":21388},{"id":5230,"question":"Which of the following is the globally recognized model that is used for measuring the maturity level of software and systems development processes and providing guidance for quality processes across a project, a division, or an entire organization?","answer_label":"CMMI","answer_id":21393},{"id":499,"question":"Which of the following type of financial statements shows the financial position of an enterprise at a particular point of time?","answer_label":"Balance sheet","answer_id":5780},{"id":5979,"question":"Which of the following software, as represented by Linux, requires the freedom to redistribute, inclusion of the source code at redistribution, and consent to modify derived software?","answer_label":"Open source software","answer_id":24129},{"id":2989,"question":"Which of the following is an appropriate order of the workflow from transaction records to closing accounts?","answer_label":"Journal Book → General Ledger → Trial Balance Sheet→ Work Sheet → Financial Statements","answer_id":12943},{"id":1656,"question":"Peter plans to open his own coffee shop. He uses break-even analysis to evaluate the feasibility. He needs to rent a coffee making machine at 20 dollars per day. The average cost of coffee ingredients is 0.40 dollars per cup and the cost of a plastic cup is 0.10 dollars. He sets a price at 1.50 dollars per cup. What is the sales revenue a day at the break-even point?","answer_label":"30","answer_id":7753},{"id":13844,"question":"Which of the following is a process of discovering useful patterns and relationships by the analysis of large volume of data?","answer_label":"Data mining","answer_id":53627},{"id":490,"question":"Which of the following descriptions corresponds to the CSR procurement?","answer_label":"Indicating procurement standards that consider the environment, human rights, etc., and\nrequesting suppliers to comply with these","answer_id":5822},{"id":1793,"question":"Which of the following is a method of making decisions based on the discount rate at which the net present value of the payback amount and the investment amount are equal?","answer_label":"Internal Rate of Return method","answer_id":8379},{"id":3681,"question":"Which of the following is the appropriate description concerning the CSV data format?","answer_label":"It separates character and numeric data by a comma and data records by line feeds. Character data may be enclosed in quotation marks.","answer_id":15642},{"id":6014,"question":"Which of the following is the work sampling method?","answer_label":"It specifies the number of observations and observation time, and estimates working hours from the ratio of the number of observation points by actual observation based on statistical theory.","answer_id":24270},{"id":783,"question":"Which of the following is a major role of a CIO?","answer_label":"The CIO creates a plan for optimizing the effect of investment on the information resources of the entire company to support the business strategy when a computerization strategy is established.","answer_id":4978},{"id":13846,"question":"An investor purchased property A for$500,000. Two years later, the investor sold the property for $1,000,000. Which of the following is the ROI of this investment (%)?","answer_label":"100","answer_id":53635},{"id":2846,"question":"Among the descriptions of personal data, which of the following is not an appropriate description from the viewpoint of “OECD Guidelines on the Protection of Privacy and Transborder Flows of Personal Data”?","answer_label":"Personal data should be allowed to be acquired without announcing the acquisition of such data.","answer_id":12383},{"id":6428,"question":"A certain company has installed an online computer for the purpose of improving its inventory control system. When the company anticipates sales of 15,000 units per year, ordering cost of $60 per order, and annual holding cost of $20 per unit, what is the optimal order quantity (in units) per order? Here, the fixed order quantity model can be applied.","answer_label":"300","answer_id":25838},{"id":6016,"question":"A certain factory has recorded the number of defective products in the past on a root cause basis. Which of the following is the graph that indicates the factors that are ranked high for defective products and their rates, based on this record?\n![](https://learn.viblo.asia/uploads/b/e/bed51419-1c03-4ceb-9e63-ca183839a074.png)","answer_label":"a","answer_id":24275},{"id":6017,"question":"You want to invest in one of the stocks A through D, all of which are 100 dollars at the current price. The table shows the predicted price increase of each stock when the growth of the economy is high, medium, or low. When the “maximin” principle is applied, which of the following stocks should be invested in?\n![](https://learn.viblo.asia/uploads/c/1/c1776e71-c79a-40b0-9021-3ca42268c18a.png)","answer_label":"A","answer_id":24279},{"id":1639,"question":"According to ISO/IEC 20000-1, which of the following is an activity in the PDCA of the Service Delivery Processes?","answer_label":"Evaluating the projected capacity and performance for service requests, new\r\ntechnologies, and upgrade procedures","answer_id":7685},{"id":1791,"question":"When the FIFO method is applied to the purchase and selling record shown below, what is the inventory value at the end of March?\n![](https://learn.viblo.asia/uploads/1/5/15707dec-4ce4-4752-83bf-d5bcf27e7ea7.png)","answer_label":"214","answer_id":8371},{"id":5229,"question":"Among various types of license agreements for a software package, which of the following is the most appropriate explanation of a site license?","answer_label":"A software package can be installed on any and all computers, such as PCs, workstations, and servers, at a given location in a company or an organization.","answer_id":21391},{"id":4819,"question":"Which of the following is a characteristic of IC tags (RFIDs)?","answer_label":"IC tags are dirt-resistant, and the information recorded on them can be read even from outside the package.","answer_id":19910},{"id":1659,"question":"Which of the following is an appropriate description of the protection scope of software under the WTO’s Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS)?","answer_label":"Both source programs and object programs are protected by the agreement","answer_id":7765},{"id":6426,"question":"Company A and Company B can expect profits as shown in the table below when each of them implements two different strategies. Which of the following is the profit of Company A when both companies carry out the maximum in strategy? In each cell of the table, the left value indicates the profit of A, and the right value indicates the profit of B.\n![](https://learn.viblo.asia/uploads/a/1/a16ff09e-94ce-4105-af84-2ade0b53380a.png)","answer_label":"5","answer_id":25832},{"id":6019,"question":"Which of the following explains a volume license agreement?","answer_label":"The agreement offers a master to a bulk buyer of the software, such as a company, and determines the maximum installable number of licenses beforehand.","answer_id":24288},{"id":498,"question":"Which of the following items should be put under “Liabilities and Stockholder’s Equity” in a balance sheet?","answer_label":"Common stock","answer_id":5785},{"id":3680,"question":"Which of the following appropriately explains “patent right” according to the WTO’s Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS)?","answer_label":"It is a right to exclusively utilize a new invention suitable for industrial use, which is granted upon application to and examination by the competent authority.","answer_id":15636},{"id":784,"question":"Which of the following is a characteristic of the OJT?","answer_label":"Because the boss or a senior associate imparts hands-on knowledge and technical education by staying close to practical affairs, the required competency can be acquired.","answer_id":4975},{"id":2087,"question":"When a single-license software package is purchased in a company, which of the following is an activity that is usually permitted in conformity with the concept of the WTO’s Agreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS)?","answer_label":"Making a backup copy of software for the limited purposes, such as the licensee’s personal use or a temporary copy for maintenance","answer_id":9507},{"id":2088,"question":"Among the descriptions concerning personal data, which of the following is not an appropriate description from the viewpoint of “OECD Guidelines on the Protection of Privacy and Transborder Flows of Personal Data”?","answer_label":"Personal data should be allowed to be acquired without announcing the acquisition of such data.","answer_id":9510},{"id":2043,"question":"When the source code based on OSS licensed under GPL is not released to the public, which of the following is regarded as a violation of the license?","answer_label":"A company obtains, modifies, and sells OSS through the company’s own operations or activities.","answer_id":9331},{"id":6174,"question":"Which of the following is a law that protects coded expressions of programs rather than ideas or algorithms in programs?","answer_label":"Copyright law","answer_id":24910},{"id":500,"question":"Which of the following is the role of a CIO?","answer_label":"To make a computerization strategy from a corporate level perspective, and confirm and\nevaluate its consistency with business strategy","answer_id":5777},{"id":3422,"question":"Which of the following is NOT protected by “copyright” that is based on the WTO’s\nAgreement on Trade-Related Aspects of Intellectual Property Rights (TRIPS)?","answer_label":"Programming language and its conventions","answer_id":14613},{"id":4817,"question":"The figure below is the OC curve (Operating Characteristic curve) that shows the result of a sampling inspection of a certain product lot. Which of the following appropriately describes what this figure indicates?\n![](https://learn.viblo.asia/uploads/c/7/c78ed05d-ab08-44e4-ae6a-89e3bee10967.png)","answer_label":"The probability that a lot with a fraction defective greater than p2% passes the inspection is at most L2.","answer_id":19903},{"id":13847,"question":"Which of the following is software whose copyright is abandoned and that can be used free of charge?","answer_label":"Public Domain Software","answer_id":53640}]