[{"id":13565,"question":"Lựa chọn nào sau đây là một lời giải thích cho sơ đồ tương đồng?","answer_label":"Đó là một phương pháp thu thập thông tin được thu thập trên cơ sở mối quan hệ lẫn nhau, và những vấn đề cần giải quyết được làm rõ.","answer_id":52512},{"id":13531,"question":"Lựa chọn nào sau đây là một biểu đồ Pareto thích hợp?","answer_label":"![](https://learn.viblo.asia/uploads/0/6/06cfbb5c-9f1e-4d56-a3ad-f27d00cf7f4d.jpg)","answer_id":52375},{"id":13927,"question":"Lựa chọn nào sau đây KHÔNG được bảo vệ bằng “bản quyền” theo Hiệp định của Tổ chức Thương mại Thế giới về các khía cạnh liên quan đến thương mại của Quyền Sở hữu trí tuệ (TRIPS)?","answer_label":"Ngôn ngữ lập trình và quy định của nó","answer_id":53960},{"id":13535,"question":"Lựa chọn nào sau đây là một hành vi phạm tội liên quan đến virus máy tính theo Công ước về tội phạm công nghệ?","answer_label":"Một người tìm thấy virus của một người lạ, lưu trữ virus đó nhằm mục đích sau này có thể chạy nó trên máy tính của người khác","answer_id":52392},{"id":13925,"question":"Khi áp dụng phương pháp FIFO với bản ghi mua bán như hiển thị dưới đây, giá trị hàng tồn kho vào cuối tháng ba là bao nhiêu?\n![](https://learn.viblo.asia/uploads/8/c/8cc02d5c-79ec-4737-a40f-183e885e7820.png)","answer_label":"214","answer_id":53950},{"id":13569,"question":"Khi giá đơn vị hàng tồn kho được xác định bằng cách chia tổng số tiền mua cho tổng số lượng hàng đã mua, Lựa chọn nào sau đây là một phương pháp kiểm kê thích hợp được sử dụng?","answer_label":"Phương pháp định kỳ trung bình","answer_id":52527},{"id":13566,"question":"Lựa chọn nào sau đây là một ví dụ của CNTT Xanh?","answer_label":"Sử dụng hội thảo qua web thay vì di chuyển để gặp nhau","answer_id":52517},{"id":13570,"question":"Lựa chọn nào sau đây là mô tả thích hợp về phạm vi bảo vệ phần mềm theo Hiệp định của WTO về Các khía cạnh liên quan đến Thương mại của Quyền sở hữu trí tuệ (TRIPS)?","answer_label":"Cả chương trình nguồn và các chương trình đối tượng được bảo vệ.","answer_id":52532},{"id":13924,"question":"Công ty A có hai kế hoạch truyền thông. Kế hoạch cho các quảng cáo 30 giây trên radio và kế hoạch cho các quảng cáo 60 giây trên truyền hình. Quảng cáo được đánh giá theo điểm. Công ty đang xem xét quảng cáo để đạt ít nhất 60 điểm trong thành phố và nhiều nhất 40 điểm bên ngoài thành phố. Bảng dưới đây cho thấy chi phí và quảng cáo cả truyền hình và radio. Lựa chọn nào sau đây là tập biểu thức có thể xác định số lượng quảng cáo trên phương tiện truyền thông để tổng chi phí là tối thiểu?\n\n![](https://learn.viblo.asia/uploads/1/1/114b05ad-50f2-47a6-9b49-4d14b9be447f.png)","answer_label":"b","answer_id":53947},{"id":13563,"question":"Lựa chọn nào sau đây là một tổ chức quản lý tạo ra một nhóm chức năng chéo giữa dự án và các tổ chức chức năng để linh hoạt đáp ứng với những thay đổi trong môi trường kinh doanh?","answer_label":"Tổ chức ma trận","answer_id":52504},{"id":13923,"question":"Lựa chọn nào sau đây là một tổ chức quản lý có cả đặc tính của dự án và của tổ chức dạng chức năng để linh hoạt ứng phó với những thay đổi trong môi trường kinh doanh?","answer_label":"Tổ chức kiểu ma trận","answer_id":53945},{"id":13564,"question":"Lựa chọn nào sau đây là vai trò thích hợp của người hướng dẫn trong cuộc họp?","answer_label":"Khuyến khích những người tham gia cuộc họp đưa ra nhận xét và tổ chức luồng các cuộc thảo luận từ một vị trí trung lập và vô tư","answer_id":52507},{"id":13532,"question":"Với số lượng chuyển sang từ tháng trước và số lượng giao dịch hàng tồn kho của một sản phẩm được thể hiện như trong bảng dưới đây, đơn giá sản phẩm cho giai đoạn tiếp theo tính theo phương pháp bình quân định kỳ là bao nhiêu?\n![](https://learn.viblo.asia/uploads/3/4/3452adb0-7bb2-4375-9b90-371d0b6df204.jpg)","answer_label":"65,00","answer_id":52379},{"id":13533,"question":"Báo cáo kiểm kê kho của Công ty Bất động sản Build-Up mô tả tình trạng tồn kho từ đầu năm 2014. Nếu công ty này sử dụng phương pháp vào trước - ra trước (FIFO) để định giá tài sản kiểm kê, thì giá trị hàng tồn kho vào cuối năm 2014 là bao nhiêu?\n![](https://learn.viblo.asia/uploads/8/9/894ea5cb-299c-4957-911d-b0be1372b4eb.jpg)","answer_label":"7600","answer_id":52383},{"id":13534,"question":"Một công ty có kế hoạch cung cấp một sản phẩm với chi phí cố định là 128.000 đôla, chi phí biến đổi trên một đơn vị sản phẩm là 48 đôla, và giá bán mỗi đơn vị sản phẩm là 80 đô. Vậy điểm hòa vốn là bao nhiêu?","answer_label":"320.000","answer_id":52387},{"id":13530,"question":"Sản phẩm A, B, C và D là được giới thiệu ra thị trường. Bảng dưới đây cho thấy lợi nhuận dự kiến cho từng sản phẩm với ba (3) dự báo bán hàng (cao, trung bình, và thấp) ước tính sẽ xảy ra với xác suất trong bảng. Sản phẩm nào sau đây là sản phẩm được kỳ vọng sẽ có lợi nhuận cao nhất theo nguyên tắc giá trị kỳ vọng?\n![](https://learn.viblo.asia/uploads/6/6/6623b63a-0737-44be-9ba1-fc13a596bb16.jpg)","answer_label":"B","answer_id":52371},{"id":13926,"question":"Phương pháp nào sau đây là dùng để ra quyết định dựa trên tỷ lệ chiết khấu khi giá trị thu hồi vốn thuần hiện tại và số tiền đầu tư là bằng nhau?","answer_label":"Phương pháp Tỷ lệ hoàn vốn nội bộ","answer_id":53954},{"id":13568,"question":"Công ty A đặt mục tiêu kiếm được khoản lợi nhuận 36.000 đô la Mỹ theo các điều kiện được trình bày trong bảng dưới đây. Doanh thu bán hàng tối thiểu cho công ty để đạt được mục tiêu của nó là gì?\n![](https://learn.viblo.asia/uploads/5/a/5a5d8066-5183-4fdd-b1d0-add47f8d8d8f.jpg)","answer_label":"260.000","answer_id":52525},{"id":13567,"question":"Một nhà máy đã ghi lại số lần xuất hiện của sản phẩm bị lỗi theo nguyên nhân của khiếm khuyết. Dựa trên bản ghi này, biểu đồ nào sau đây là biểu đồ Pareto cho thấy các nguyên nhân hàng đầu của sự cố sản phẩm bị lỗi và tổng số phần trăm tích lũy?","answer_label":"![](https://learn.viblo.asia/uploads/1/d/1dc36a97-657c-4ef1-95c1-a166405eaeeb.jpg)","answer_id":52518}]