[{"id":5197,"question":"The class diagram below shows part of an ordering system used for mail order and teleshopping. Which of the following is the most appropriate combination of relations that should be inserted into blanks A through D in order to complete the diagram?\n![](https://learn.viblo.asia/uploads/7/1/71e300db-57a0-407d-a75b-8a4e4d02ddbc.png)","answer_label":"a","answer_id":21261},{"id":3458,"question":"When a GUI screen is designed for both users who are familiar with keyboard operation and users who are not, which of the following is an appropriate consideration to implement a user interface with good usability?","answer_label":"Both mouse and keyboard interfaces should be provided for as many operations as possible, in order to increase operational flexibility.","answer_id":14754},{"id":6146,"question":"In software development, it is a good practice to develop highly independent modules. When module independence depends primarily on two measures, module strength (or cohesion) and module coupling, which of the following is the appropriate combination of good programming practices?\n![](https://learn.viblo.asia/uploads/8/6/864dc888-893a-49f9-adde-9e2b321ceb47.png)","answer_label":"b","answer_id":24799},{"id":13819,"question":"Which of the following is an explanation of reverse engineering of software","answer_label":"The existing software is analyzed, and its specification and structure are clarified.","answer_id":53527},{"id":6149,"question":"Which of the following is the software development process model that incorporates the best features of both the classic lifecycle and the prototyping approaches, by beginning each repeated development cycle with extensive risk analysis throughout the entire software development life cycle for large-scale applications?","answer_label":"Spiral model","answer_id":24812},{"id":13815,"question":"Which of the following is an appropriate description of a UML use case diagram?","answer_label":"It shows the scenarios for what the system will do, from the point of view of actors (i.e., external users or machines).","answer_id":53513},{"id":6117,"question":"The following table shows the duration for the optimistic, most likely, and pessimistic\r\nscenarios in a program development. How many hours are required to complete all the\r\nactivities on a “three point estimate” basis?\n\n![](https://learn.viblo.asia/uploads/7/9/79c6308b-6fb3-4aa9-81f3-75f805318da0.png)","answer_label":"14.5","answer_id":24683},{"id":4779,"question":"Which of the following is the most appropriate description concerning software reuse?","answer_label":"More person-hours are required for development of reusable components than for regular software development of the same scale.","answer_id":19751},{"id":3480,"question":"In software development, which of the following is the most appropriate primary purpose of performing a system test?","answer_label":"To verify the functionality and operability of the deliverables principally on developer’s own responsibility in the production environment","answer_id":14842},{"id":4417,"question":"![](https://learn.viblo.asia/uploads/4/4/446c62ed-a20f-4583-9878-3ef49cbff5b1.png)","answer_label":"b","answer_id":18473},{"id":3652,"question":"Which of the following is an example of the relationship between the base class and the subclass in object orientation?","answer_label":"“Figure” and “triangle”","answer_id":15525},{"id":5122,"question":"Which of the following is the software development process model that aims to achieve a high degree of completion of a system by dividing the system into some subsystems and repeating the development cycle for each subsystem in consideration of minimizing the risk in each cycle?","answer_label":"Spiral model","answer_id":20963},{"id":758,"question":"Among the software development activities, which of the following corresponds to refactoring, which is also emphasized in agile development?","answer_label":"To improve the maintainability of a software, the internal structure of a program is changed without any change in the external specifications.","answer_id":5078},{"id":1896,"question":"Among the items to be written into an audit report by a system auditor, which of the following deviates from the scope of work of an auditor?","answer_label":"Ordering improvements","answer_id":8792},{"id":6111,"question":"Which of the following appropriately explains benchmarking used in business\r\nmanagement?","answer_label":"It is to make comparisons with the strongest competitors or advanced companies in\r\norder to scope out best practices for setting business goals, and to gain an\r\nunderstanding of products, services, and practical methods qualitatively and\r\nquantitatively.","answer_id":24658},{"id":1654,"question":"Which of the following is an appropriate explanation of the concurrent engineering?","answer_label":"A technique that executes processes such as product design and production planning in\r\nparallel during the new product development procedure","answer_id":7745},{"id":4314,"question":"Which of the following is an appropriate description concerning object-oriented design?","answer_label":"A class can inherit attributes and methods from its base class.","answer_id":18118},{"id":5118,"question":"In UML, the state machine diagram (previously called statechart diagram) is used for describing the state machine model of a target system. Which of the following is an appropriate description of the state machine diagram?","answer_label":"It shows how the system responds to internal and external events.","answer_id":20946},{"id":4317,"question":"In the module design of software, which of the following is the appropriate technique for improving reliability and maintainability?","answer_label":"Module cohesion is increased, and module coupling is weakened.","answer_id":18130},{"id":5981,"question":"In the DFD for a sales management system shown below, which of the following is appropriate for item A?\n![](https://learn.viblo.asia/uploads/f/3/f31e90e9-1bec-4513-b242-671cd32dfe54.png)","answer_label":"Unit price list","answer_id":24138},{"id":4330,"question":"In order to shorten the cumulative duration of activities on the critical path by one day, which of the following is the appropriate action to be taken?\n![](https://learn.viblo.asia/uploads/0/6/06003877-02d3-4576-8436-83295887eb6a.png)","answer_label":"To shorten the activity I by one day","answer_id":18184},{"id":2064,"question":"When an integration test is performed by using the top-down approach, which of the following is particularly necessary?","answer_label":"Stub","answer_id":9417},{"id":1842,"question":"In the UML diagram shown below, which of the following is described in the blank box?\n![](https://learn.viblo.asia/uploads/b/7/b70ea328-80fd-478c-8e20-b2c3d46f45f5.png)","answer_label":"Class name","answer_id":8577},{"id":2812,"question":"Which of the following is the most appropriate explanation of the deployment diagram defined in UML 2.x (including 2.0 and later versions)?","answer_label":"It shows a static view of the run-time configuration of processing nodes, such as servers and clients, as well as the components that run on these nodes.","answer_id":12249},{"id":756,"question":"Which of the following can generally be called a subclass of an “automobile” based on the concept of object orientation?","answer_label":"Truck","answer_id":5089},{"id":1765,"question":"When a software component is tested, which of the following is an appropriate combinations of X and Y ?\n\nX : It calls the software component to be tested.\nY : It is called from the software component to be tested.\n![](https://learn.viblo.asia/uploads/4/d/4d9bd7fa-8edf-4670-b088-5c58ca607f72.png)","answer_label":"b","answer_id":8268},{"id":4326,"question":"Which of the following is an appropriate description concerning CRM (Customer Relationship Management)?","answer_label":"It is an approach for increasing customer satisfaction and ultimately revenues by sharing information and raising the service levels, not only in the sales division but in all customer related channels within a company.","answer_id":18168},{"id":1889,"question":"The integration test for a software that is composed of a set of modules arranged in a hierarchical structure is performed from a low-level module. In such a case, which of the following is a test module used as a substitute for a higher level module?","answer_label":"Driver","answer_id":8763},{"id":5198,"question":"![](https://learn.viblo.asia/uploads/8/a/8ada182e-299e-48b9-9957-6b502864780c.png)","answer_label":"Data store","answer_id":21266},{"id":2022,"question":"Which of the following is a work that is performed when nonfunctional requirements are defined?","answer_label":"Creating development criteria and standards based on programming language used in\nsystem development","answer_id":9247},{"id":2817,"question":"According to PMBOK, which of the following is an appropriate explanation of project definition?","answer_label":"It is a temporary endeavor undertaken to create a unique product, service, or result.","answer_id":12269},{"id":1846,"question":"Among the software development activities, which of the following is an explanation of refactoring?","answer_label":"In order to improve the maintainability of a program, its internal structure is modified without any change of the external specifications.","answer_id":8591},{"id":4319,"question":"Which of the following is an appropriate statement in regard to a module unit test?","answer_label":"The module interface falls outside the scope of the unit test because the module interface cannot be tested using a single module.","answer_id":18139},{"id":6148,"question":"Which of the following is the test that is performed to ensure that the components and modulesof a system can communicate with one another in accordance with the functional specifications and design?","answer_label":"Integration test","answer_id":24806},{"id":6095,"question":"Which of the following appropriately explains the function point method, which is one\nof the estimation methods used in system development?","answer_label":"It is a method for estimating the system size by evaluating system functions\r\nquantitatively on the basis of the amount of input/output data, the number of files,\r\netc. and by making proper adjustments based on the complexity and characteristics of\r\nthe application.","answer_id":24595},{"id":13818,"question":"Among the different types of software tests, which of the following is a test that is performed with the purpose of checking whether or not a location that must not be affected by changes made for software maintenance is affected","answer_label":"Regression test","answer_id":53524},{"id":2818,"question":"A project has been defined to contain the activities along with their required times for completion as shown in the table below. Which of the following is the critical path for this project?\n![](https://learn.viblo.asia/uploads/c/2/c23a7c31-9e00-4daa-909b-fe2232608c10.png)","answer_label":"1-2-4-7-9-10","answer_id":12273},{"id":4600,"question":"Which of the following characteristics can be found in well-designed modules with a\nhigh degree of independence?","answer_label":"Low coupling and high cohesion","answer_id":19117},{"id":3494,"question":"From the viewpoint of internal controls, which of the following is a framework that can secure data integrity by means of a check and balance system in the organization?","answer_label":"The information systems department remains independent of the user departments that enter data, in order to ensure that the user departments can maintain the precision and accuracy of data.","answer_id":14899},{"id":4327,"question":"The figures show the break-even point for two companies A and B. Which of the following is an appropriate statement with regard to the profit/loss analysis of Companies A and B?\n![](https://learn.viblo.asia/uploads/6/9/690f48e5-0bec-4edf-bdc3-72ba17c15037.png)","answer_label":"Company A has low variable costs per unit of product, so when sales exceed the break-even point, Company A‘s profits are larger than Company B.","answer_id":18171},{"id":1844,"question":"In software development, which of the following is an appropriate explanation of a test that uses stubs?","answer_label":"When a top-down test is performed, a dummy lower-level module that is called by the upper-level module is prepared to stand in for an unfinished portion of the program.","answer_id":8585},{"id":472,"question":"Which of the following is the most appropriate description of polymorphism in object oriented design?","answer_label":"It is the provision of a single interface to entities of different types.","answer_id":5891},{"id":1635,"question":"Which of the following is the process of changing a software system in such a way that it does not alter the external behavior of the code yet improves its internal structure?","answer_label":"Refactoring","answer_id":7668},{"id":3651,"question":"Which of the following appropriately describes “efficiency” that is one of six software quality characteristics defined in ISO/IEC 9126-1?","answer_label":"The capability of the software product to provide appropriate performance, relative to the amount of resources used, under stated conditions","answer_id":15522},{"id":2062,"question":"Which of the following is an appropriate deliverable that must be approved when the external design of a system is completed?","answer_label":"Screen layout","answer_id":9408},{"id":6389,"question":"Which of the following is the method which analyzes the source or object code to retrieve information concerning program specifications and design?","answer_label":"Reverse engineering","answer_id":25685},{"id":1646,"question":"According to the ISO/IEC 12207, the activities of the requirements definition process include stakeholder identification, requirements identification, requirements evaluation, and requirements agreement. Among these activities, which of the following is a task that is implemented in requirements identification?","answer_label":"Eliciting requirements from stakeholders, and clarifying constraints and operational\r\nscenarios","answer_id":7713},{"id":476,"question":"Which of the following is a method for analyzing a source and object codes, and extract program specifications and design information?","answer_label":"Reverse engineering","answer_id":5875},{"id":5117,"question":"During system development, a domain model is often created as part of the business modeling activities. Among the diagrams in UML, which of the following is the diagram that contains the implementation view of the entities in the domain model?","answer_label":"Class diagram","answer_id":20941},{"id":619,"question":"Among eXtreme Programming (XP) practices, which of the following is adopted to improve program quality in program development through smooth communication between programmers by exchanging their roles and checking each other’s work?","answer_label":"Pair programming","answer_id":5391},{"id":6115,"question":"When the moving average method is applied to the receipt/shipment ledger shown\nbelow, how much in dollars is the closing inventory value of August?\n\n![](https://learn.viblo.asia/uploads/f/c/fcd949b1-3ae4-485f-b41a-774e5d9faf7b.png)","answer_label":"1300","answer_id":24676},{"id":6114,"question":"The selling price per unit of product Z is set to $250, and sales for the coming year are expected to be 500 units. If the company requires a return of 15% in the coming year on its investment of $250,000 in product Z, what is the target variable cost per unit for the coming year? Here, the fixed cost is $10,000 per annum.","answer_label":"$155","answer_id":24671},{"id":616,"question":"In the development process, which of the following is an activity that should be performed in software architecture design?","answer_label":"Converting the requirements for a software item into an architecture that represents the top-level structure and identifies software components","answer_id":5402},{"id":6118,"question":"Which of the following is the appropriate combination of processing modes in banking\nactivities?\n![](https://learn.viblo.asia/uploads/c/a/ca9387bd-7b15-489b-9ca9-7602087ec239.png)","answer_label":"c","answer_id":24688},{"id":3657,"question":"Which of the following is the model that can be used to guide process improvement and to assess the capability level and the maturity level of a project, a division, or an entire organization?","answer_label":"CMMI","answer_id":15543},{"id":13817,"question":"Test data about the part of a program shown in the flowchart below is specified by decision condition coverage (branch coverage). When this test data is changed to being specified by multiple-condition coverage, which of the following is the appropriate test data to be added? Here, the part enclosed by parentheses () represents the set of test data. \n![](https://learn.viblo.asia/uploads/2/b/2b680fa7-566b-452a-982e-5c204d05952a.png)","answer_label":"(A = 7, B = 0), (A = 8, B = 2)","answer_id":53521},{"id":5991,"question":"Which of the following is an appropriate description concerning maintenance of applications?","answer_label":"Record the completion of maintenance in order to prevent maintenance activities from being left uncompleted.","answer_id":24176},{"id":6088,"question":"Which of the following is the appropriate program that supports dynamic processing in a Web environment and runs only on a Web server?","answer_label":"Java servlet","answer_id":24568},{"id":4323,"question":"An implementation plan for a system development project was drawn up, and the critical path was determined. Which of the following tasks can be identified by the critical path?","answer_label":"Tasks directly connected with the delay of the entire project","answer_id":18153},{"id":6144,"question":"The diagram shown below depicts who can use the system and in what ways the users (or external systems) expect to interact with the system. What is this type of diagram called?\n![](https://learn.viblo.asia/uploads/d/5/d5a800f0-1779-4dd2-aca8-669c2ebe03fa.png)","answer_label":"Use case diagram","answer_id":24793},{"id":6087,"question":"Which of the following is the appropriate characteristic of “data oriented design” as compared with “process oriented design?”","answer_label":"It is possible to consider data as shared resources and to manage it in a unified manner.","answer_id":24564},{"id":617,"question":"Which of the following is the testing technique that uses the different unique combination of input conditions to check whether the corresponding result is delivered based on the design rules as specified for the system?","answer_label":"Decision table testing","answer_id":5399},{"id":1845,"question":"Which of the following is an appropriate explanation of the state transition diagram that is used for requirements analysis and design in system development?","answer_label":"The triggers that change the state, such as the passage of time and the change in control\nsignal, and the operations performed as a result are described.","answer_id":8590},{"id":4603,"question":"Which of the following appropriately explains a tracer as one of the dynamic\ndebugging tools?","answer_label":"It outputs the contents of the memory and registers in order to monitor the results of\nthe program execution in chronological order.","answer_id":19130},{"id":3483,"question":"In a software test phase, when a bug control chart is used to evaluate test progress and software quality, which of the following is the most appropriate perspective to consider?","answer_label":"If the cumulative total number of completed test items, the cumulative total number of bugs, and the number of unresolved bugs all remain unchanged, it is necessary to check if the software has a bug that is hard to resolve.","answer_id":14854},{"id":3479,"question":"Which of the following is the most appropriate statement concerning the use of frameworks in software development?","answer_label":"Frameworks can shorten the development period for software projects by taking advantage of the work and experience of others.","answer_id":14839},{"id":6090,"question":"Which of the following design tasks is performed from the standpoint of the system developer, based on the deliverables of external design and in consideration of the implementation method and processing efficiency?","answer_label":"b) Functional decomposition and structured design","answer_id":24575},{"id":3841,"question":"Among the diagrams used in UML 2.x, which of the following is the diagram that can represent the interactions based on messages sent or received between objects?","answer_label":"Sequence diagram","answer_id":16252},{"id":5121,"question":"When the data model conforms to the notation described below, which of the following is an appropriate description concerning the interpretation of the E-R diagram shown below?\n![](https://learn.viblo.asia/uploads/9/5/95854f7a-96f9-4ef9-8b67-c5f4467032de.png)","answer_label":"A single order is not made from multiple suppliers.","answer_id":20957},{"id":4316,"question":"A systems design is represented using several diagrams. When a system analyst wants to confirm the design information such as the relationships among functions and the interface among modules in a hierarchical manner, which of the following is the most appropriate diagram that should be inspected by the analyst?","answer_label":"Structured chart","answer_id":18128},{"id":3346,"question":"Which of the following is an appropriate description concerning test data for a white box\ntest?","answer_label":"Test data is created on the basis of internal structures.","answer_id":14319},{"id":4602,"question":"Which of the following is the method in which the designer and a group of involved\npersonnel review the design documents at the completion of each design for the\npurpose of early detection of design errors?","answer_label":"Walk-through","answer_id":19126},{"id":6398,"question":"Which of the following is the appropriate interpretation of the testing-process quality control graph shown below and follow-on actions to be taken?\n![](https://learn.viblo.asia/uploads/5/5/55d5daf7-fdbd-4caf-b84d-77d9f1b904e2.png)","answer_label":"The resulting quality is generally rather poor, so it is necessary to take strong measures against places in which errors occur frequently; the quality status of the preceding process should be reviewed and do it over again if necessary.","answer_id":25721},{"id":6396,"question":"Which of the following is the test to verify interfaces both between modules and between subsystems?","answer_label":"Integration test","answer_id":25710},{"id":5982,"question":"Which of the following is the appropriate description of the relationship between a class and an instance in the object-oriented approach?","answer_label":"An instance is generated based on the definition of a class.","answer_id":24140},{"id":4679,"question":"When a declining metered rate method is applied to the total charge for usage of a computer system, the charge per unit of usage decreases as the system usage increases. \nWhich of the following is a graph that shows this method?\n![](https://learn.viblo.asia/uploads/5/7/57c03604-bb59-4cac-8c3c-5354f3ee3bc8.png)","answer_label":"c","answer_id":19398},{"id":477,"question":"According to the ISO/IEC 12207 (Systems and software engineering – Software life cycle processes (SLCP)), the Software Implementation Process has the following lower-level processes:\n\n    1) Construction Process\n    2) Requirements Analysis Process\n    3) Architectural and Detailed Design Process\n    4) Integration and Testing process\n\nWhich of the following is an appropriate order for the Software Implementation Process?","answer_label":"2) -> 3) -> 1) -> 4)","answer_id":5869},{"id":5116,"question":"Which of the following is an appropriate description concerning a use case diagram in UML?","answer_label":"It is used to show what system functions are performed for which actor, from the user’s perspective.","answer_id":20940},{"id":473,"question":"In the development process, which of the following is an activity that should be performed in software architectural design?","answer_label":"Transforming the requirements for the software item into an architecture that describes\nits top-level structure and identifies the software components","answer_id":5887},{"id":4606,"question":"Which of the following is an appropriate description concerning countermeasures to\nonline system failures?","answer_label":"The master file should be backed up not only at the completion of online service but\nat times corresponding to the characteristics of the system.","answer_id":19142},{"id":4332,"question":"There are various types of e-commerce, depending on the transaction: B2B, B2C, C2C, m-commerce, etc. Which of the following refers to the activities associated with the selling and buying of goods and services via the Internet such as an online auction website and an online flea market?","answer_label":"C2C (Consumer to Consumer)","answer_id":18191},{"id":6145,"question":"Which of the following is an appropriate combination of the fundamental object-oriented concepts?","answer_label":"Abstraction, encapsulation, inheritance, class","answer_id":24794},{"id":13816,"question":"Among the design techniques that are used in system development, which of the following is an explanation of a decision table?","answer_label":"It represents a combination of conditions and the corresponding operations.","answer_id":53514},{"id":6394,"question":"In DFD illustrated below, DFi is used for data flow i, Pj for process j, Ek for source or destination of data k, and DSl for data storage l. There are three errors (rule violations) in this DFD. One is in P2; that is, P2 must have at least one output data flow. The other two are in data flows. Which of the following combinations includes two rule violations, one for each data flow?\n![](https://learn.viblo.asia/uploads/4/2/42cea0e6-41b0-4b9c-bf01-287eee62c202.png)","answer_label":"DF1 and DF5","answer_id":25703},{"id":2813,"question":"In software development for small projects, which of the following is an appropriate explanation of test driven development (TDD)?","answer_label":"Development is done in increments of functionality where test cases are executed and the code is developed to pass the test cases before moving to the next increment.","answer_id":12253},{"id":5983,"question":"Module coupling needs to be weakened in order to increase module independence. Which of the following has the weakest level of module coupling among methods of information transfers between modules?","answer_label":"Only data items are passed as arguments between modules.","answer_id":24145},{"id":509,"question":"In object-oriented programming, which of the following is an explanation of overriding that achieves polymorphism?","answer_label":"A feature that allows a class to provide a specific implementation of a method that is already provided by one of its super classes","answer_id":5562},{"id":3345,"question":"In a UML class diagram, which of the following is a direct relationship between one\nobject in a class and another object in another class and is graphically represented as a\nsolid line with or without an arrow?","answer_label":"Association","answer_id":14314},{"id":4778,"question":"Which of the following tasks is performed in the external design phase of the waterfall model?","answer_label":"Code design","answer_id":19746},{"id":2815,"question":"Which of the following is an appropriate category of system maintenance preformed for the purpose of modifying the system to cope with changes in the software environment (e.g.DBMS, Operating system)?","answer_label":"Adaptive maintenance","answer_id":12259},{"id":4329,"question":"The figure below shows plots of the relationship between values of a certain factor x, in the product manufacturing process, and values of quality characteristics y. Which of the following is an appropriate description concerning this figure?\n![](https://learn.viblo.asia/uploads/4/e/4e42be88-3bbf-4cf7-88fe-ff60b168367b.png)","answer_label":"The coefficient of correlation between x and y is negative.","answer_id":18177},{"id":2078,"question":"Which of the following is an explanation concerning non-functional requirements definition?","answer_label":"It clearly defines the quality requirements, technical requirements, and operational requirements necessary to implement business requirements.","answer_id":9473},{"id":4328,"question":"Which of the following is an appropriate statement concerning a radar chart?","answer_label":"The degree of attainment of the benchmarking goal is plotted on the radial axis which corresponds to each item. All such plotted points are connected by a line, thereby making a comparison of overall balance.","answer_id":18175},{"id":618,"question":"Which of the following is an appropriate test to ensure that the interfaces and linkages between different parts of software work properly?","answer_label":"Integration test","answer_id":5395},{"id":475,"question":"Which of the following is an appropriate description concerning a state transition test in a system integration test?","answer_label":"A method that checks whether a system behaves according to the designed combinations\nof events and internal states.","answer_id":5877},{"id":755,"question":"Which of the following is an explanation of encapsulation in object orientation?","answer_label":"Combination of the data and procedures that operate the data into a single object, and their concealment from outside the object","answer_id":5091},{"id":4784,"question":"Which of the following is an appropriate execution sequence in the test phase of the waterfall model?","answer_label":"Unit test → Integration test → System test → Operational test","answer_id":19772},{"id":4313,"question":"Which of the following is an appropriate description in regard to a waterfall model?","answer_label":"System development proceeds in the order of process flow, so going back upstream results in a significant loss of efficiency.","answer_id":18113},{"id":4601,"question":"In object orientation, the term “open (white box) reuse” refers to the reusing of\nbase-class data and functions by creating subclasses for the base class. Which of the\nfollowing is the appropriate description concerning the reuse technology in object\norientation of this method?","answer_label":"Only differences between the data and functions defined by the base class and those\nof subclasses can be stated in subclasses, so development is highly efficient.","answer_id":19120},{"id":4677,"question":"In software development that uses the waterfall model, which of the following is an appropriate description concerning the cost of fixing errors detected during an operational test?","answer_label":"External design errors affect not only the program but also manuals and other documents, so those errors cost more to fix than coding errors.","answer_id":19389},{"id":3493,"question":"Which of the following is pertinent to an audit finding in an audit of a user acceptance test?","answer_label":"The test is conducted by the information systems department without involving users, and the test results are approved by the person in charge of the department.","answer_id":14896},{"id":1632,"question":"Among UML 2.x, (including 2.0 and later versions) diagrams, which of the following is the most appropriate diagram that can gives a graphic overview of the actors involved in a system, different functions needed by those actors and how these different functions are interacted?","answer_label":"Use Case diagram","answer_id":7658},{"id":1890,"question":"Which of the following is a term for the process of generating a Unified Modeling Language (UML) class diagram from a program?","answer_label":"Reverse engineering","answer_id":8770},{"id":5119,"question":"In the course of object oriented design, which of the following can be regarded as a subclass of the base class “automobile”?","answer_label":"Truck","answer_id":20952},{"id":754,"question":"In the UML class diagram, which of the following represents the relationship between the classes as shown in the figure below?\n\n![](https://learn.viblo.asia/uploads/5/1/51cd3cb9-6c57-4d3c-ab11-4d17aa1d87df.png)","answer_label":"Generalization","answer_id":5097},{"id":757,"question":"In the flowchart below, what is the minimum number of test cases that satisfies the decision condition coverage (branch coverage)?\n![](https://learn.viblo.asia/uploads/f/9/f93544e2-305a-4474-8cc3-84a010de92c4.png)","answer_label":"2","answer_id":5083},{"id":1764,"question":"As shown in the list below, there are three types of coupling. Which of the following is the most appropriate combination of the type of coupling?\n\nCoupling A: One module passes an element of control to the other module.\nCoupling B: One module passes the data structure as a parameter to the other module. Coupling C: Two modules have access to the same global data.\n![](https://learn.viblo.asia/uploads/d/7/d7838cc5-5a84-4b5e-822a-66309349fc61.png)","answer_label":"d","answer_id":8266},{"id":1634,"question":"Which of the following is the purpose of a stress test?","answer_label":"To confirm the operation at the limits of processing capability that is required for a\r\nsystem","answer_id":7664},{"id":6086,"question":"Which of the following is the appropriate combination of basic concepts of object-oriented approach?","answer_label":"Abstraction, encapsulation, inheritance, and class","answer_id":24558},{"id":2816,"question":"Which of the following is an appropriate order of six phases used in every SDLC (Software Development Life Cycle) model?","answer_label":"![](https://learn.viblo.asia/uploads/6/5/65ce6b77-83c8-4f26-95b8-e34a3a447380.png)","answer_id":12264},{"id":4320,"question":"Which of the following is an appropriate statement in regard to program testing?","answer_label":"In the program testing, it is necessary to check not only whether the program works as intended but also whether there are any unintended operations.","answer_id":18141},{"id":5120,"question":"The integration test for software that is composed of a set of modules arranged in a hierarchical structure is performed from a high-level module. In such a case, which of the following is a test module that is used as a substitute for the low-level module?","answer_label":"Stub","answer_id":20956},{"id":1633,"question":"Which of the following is an appropriate description of how to design test cases for a black box test?","answer_label":"Test cases are designed according to the program’s functional specifications and\r\ninterface specifications.","answer_id":7659},{"id":4783,"question":"Which of the following combinations is described in a UML class diagram?","answer_label":"Attribute, operation, role name","answer_id":19767},{"id":4325,"question":"When the system development division and the operations divisions are separately organized, which of the following is an appropriate method for ensuring that the transition from development to operation proceeds smoothly and efficiently?","answer_label":"The operations division participates actively in system development to provide assistance from the viewpoint of operability.","answer_id":18164},{"id":2819,"question":"In the Earned Value Management technique, which of the following is used to calculate the Cost Performance Index (CPI)?","answer_label":"Earned Value (EV) / Actual Cost (AC)","answer_id":12278},{"id":4782,"question":"Which of the following is an explanation of encapsulation in the object-oriented paradigm?","answer_label":"Data and its related operational procedures are hidden inside objects.","answer_id":19764},{"id":6306,"question":"![](https://learn.viblo.asia/uploads/4/7/470efe9f-4963-4199-a019-a7df57647dd5.png)","answer_label":"b","answer_id":25370},{"id":5980,"question":"Which of the following is the activity performed during the external design phase in system development?","answer_label":"Logical data design","answer_id":24131},{"id":824,"question":"Which of the following is an appropriate test to verify the efficacy of security measures by attempting an actual intrusion?","answer_label":"Penetration test","answer_id":4812},{"id":4318,"question":"The entity-relationship diagrams A and B shows the relationships between three entities in a school: teacher, class, and classroom. Which of the following is an appropriate interpretation concerning the diagrams? Here, “1    1” shows a one-to-one relationship while “1    *” shows a one-to-many relationship.\n![](https://learn.viblo.asia/uploads/9/c/9c964f47-aef7-4312-83a2-49ac9842c8f2.png)","answer_label":"In A, a teacher is responsible for one class only. In B, a teacher may be responsible for one or more classes.","answer_id":18133},{"id":3481,"question":"In object-oriented design, which of the following is a way to form new classes using classes that have already been defined and to take over data structures and procedures of the pre-existing classes referred to as base classes?","answer_label":"Inheritance","answer_id":14848},{"id":4599,"question":"Which of the following is an appropriate description concerning the spiral model?","answer_label":"The design and implementation of an application is performed for a unit of\ncomponent, and then this process is repeated successively for every component.","answer_id":19114},{"id":6397,"question":"A certain program contains the complex decision shown below: \n“Condition 1” OR (“Condition 2” AND “Condition 3”) \nWhen testing based on decision-condition coverage (branch coverage), which of the following is appropriate for an additional test item? \n[Test items completed] \n(1)“Condition 1” is true, “Condition 2” is false, and “Condition 3” is false. \n(2)“Condition 1” is false, “Condition 2” is true, and “Condition 3” is true.\n![](https://learn.viblo.asia/uploads/7/7/776abcfc-c0ed-4533-abfb-9aa29ef27153.png)","answer_label":"a","answer_id":25714},{"id":4777,"question":"Which of the following software development models is an appropriate description of the spiral model?","answer_label":"It is a model in which a large-scale system is developed by enlarging its scale of functions through the repetition of the development cycles of design, implementation, and testing on each independent subsystem.","answer_id":19743},{"id":5985,"question":"Which of the following is the appropriate purpose of design review?","answer_label":"To find specification defects and design errors at an early stage, and reduce the person hours for rework","answer_id":24151},{"id":2063,"question":"In terms of the test coverage of a program module, which of the following is an appropriate explanation of the relationship between path coverage, branch coverage, and statement coverage?","answer_label":"100% path coverage implies both 100% branch coverage and statement coverage.","answer_id":9412},{"id":4680,"question":"Which of the following is an appropriate description concerning application maintenance?","answer_label":"The completion of maintenance is recorded in order to prevent maintenance activities from being left unfinished.","answer_id":19400},{"id":6112,"question":"Which of the following appropriately describes a cause-and-effect diagram?","answer_label":"It systematically arranges the relation between cause and effect in a fishbone format\r\nand clarifies which causes are related to particular effects.","answer_id":24665},{"id":4604,"question":"Full backup and differential backup are two methods of backing up a database.\nWhich of the following appropriately describes the differential backup method?","answer_label":"To recover a database, the full backup data is restored and then the differential\nbackup data is added.","answer_id":19134},{"id":6150,"question":"Which of the following is an appropriate description concerning the maturity level in the staged representation of CMMI?","answer_label":"At the “managed” level, processes are documented and followed.","answer_id":24816},{"id":4315,"question":"Which of the following is a UML diagram that can be used to describe interactions among a number of objects in terms of an exchange of messages?","answer_label":"Sequence diagram","answer_id":18123},{"id":3482,"question":"Which of the following is an activity to be performed in software architecture design within the development process?","answer_label":"Determining how to implement software requirements already defined","answer_id":14851},{"id":6388,"question":"CASE tools can be classified on the basis of the applicable development processes and phases. Which of the following classifications includes support functions for requirements analysis?","answer_label":"Upstream","answer_id":25681},{"id":3653,"question":"Which of the following is the appropriate purpose of regression test?","answer_label":"To verify the functionality of the upgraded system against a baseline system to ensure that any existing system capabilities have not been adversely impacted","answer_id":15530},{"id":4781,"question":"The figure below shows an example of a DFD used in structured analysis. What does the symbol “ ” in the figure represent?\n![](https://learn.viblo.asia/uploads/0/c/0cc54925-f8c2-4085-98cb-434e370886ac.png)","answer_label":"Process","answer_id":19761},{"id":1894,"question":"Which of the following term indicates the amount of data transactions allowed to be lost\nafter a downtime occurs?","answer_label":"Recovery Point Objective (RPO)","answer_id":8784},{"id":5984,"question":"Which of the following is the appropriate point to notice at the time of creating the test data for a white box test?","answer_label":"The internal structures, such as the algorithm, for the program","answer_id":24149},{"id":6391,"question":"Which of the following should be done in the internal design phase of software development processes?","answer_label":"Designing physical data structure","answer_id":25692},{"id":3348,"question":"Which of the following is a type of integration test in which all the related program\nmodules are combined and tested at once regardless of the hierarchical structure after\nthe unit test for each module is completed?","answer_label":"Big bang test","answer_id":14326},{"id":1843,"question":"In object-oriented development, it is possible to make settings such that the user is not affected even if the internal structure of an object is changed. Thus, it is possible to create a situation where the user of an object is not necessarily aware of the internal structure of the object. Which of the following is the term that represents the concept of implementing such development?","answer_label":"Encapsulation","answer_id":8580},{"id":1903,"question":"Which of the following is an explanation of consumer generated media (CGM)?","answer_label":"It enables the distribution of digital content that an individual reader creates, and it enables sharing of such content between users.","answer_id":8820},{"id":6116,"question":"In a production process of 1,000 units of product X, “material cost” incurred is $10,000,\r\nand “direct labor cost” is $20,000. “Production overhead” is 100% of direct labor cost.\r\n“Selling and distribution cost” is $10,000. How much in dollars is the unit cost of\r\nproduct X?","answer_label":"50","answer_id":24680},{"id":1893,"question":"According to ISO/IEC 20000-1 (Information technology - Service management -\nPart 1: Service management system requirements), which of the following is an appropriate\ndescription of problem management?","answer_label":"It is a process used to identify the root cause of an incident, minimize the adverse impact\nof the incident, and prevent it from occurring again.","answer_id":8780},{"id":3656,"question":"The number of remaining bugs in software is estimated by bug-embedding method. The number of captured bugs by testing is 48. The number of bugs found by testing is 16 out of 22 embedded bugs. How many bugs are estimated to be still hidden? Here, the number of the embedded bugs found in the test is proportional to the number of the bugs found in the software.","answer_label":"18","answer_id":15541},{"id":4786,"question":"An automated ticketing system for motorists is installed for a highway with a minimum speed limit of 60 kph (kilometers per hour) and a maximum speed limit of 100 kph. When the system is tested based on “equivalence partitioning” as a black box, which of the following is an appropriate set of speed values in kph?","answer_label":"40, 80, 120","answer_id":19779},{"id":615,"question":"In object orientation, which of the following is the name of being able to use the attributes and functions of a class in a subclass of that class?","answer_label":"Inheritance","answer_id":5407},{"id":6393,"question":"Which of the following is the appropriate sequence for drawing up a DFD model that is used to develop a new system based on the current system? \n1. Current logical model \n2. Current physical model \n3. New logical model \n4. New physical model","answer_label":"2 → 1 → 3 → 4","answer_id":25700},{"id":6390,"question":"Based on the concept of object orientation, which of the following can be commonly regarded as a subclass of the class “automobile”?","answer_label":"Truck","answer_id":25689},{"id":4324,"question":"From multiple types of slips, data in items specified for each type is inputted. Which of the following is the appropriate initial process to be executed in the program to confirm that all the required data is inputted?","answer_label":"A comparison is made between the number of items specified for each slip type and the number of items inputted.","answer_id":18157},{"id":1891,"question":"Which of the following is an action that is carried out during the work breakdown structure (WBS) creation process in project scope management?","answer_label":"Subdividing the work hierarchically","answer_id":8774},{"id":3655,"question":"The test data about the part of a program shown in the flowchart is specified by “decision condition coverage” (branch coverage). If this test data is specified by “multiple condition coverage,” which of the following is the appropriate data to add? Here, the part enclosed in parentheses indicates the pair of test data elements.\n![](https://learn.viblo.asia/uploads/0/b/0b9047fc-4444-4a53-8c82-5532300eea62.png)\nThe test data used by “decision condition coverage” (branch coverage):\n(A = 4, B = 1), (A = 5, B = 0)\n![](https://learn.viblo.asia/uploads/c/c/cc2f85aa-7443-4820-91c7-46820e9b934f.png)","answer_label":"d","answer_id":15538},{"id":4420,"question":"![](https://learn.viblo.asia/uploads/d/7/d7e7c3e3-cce4-430e-ade9-0ecd066ca416.png)","answer_label":"The number of bugs detected by the test is reaching the saturation level in\nSubsystem A compared to Subsystem B , so Subsystem A can be considered superior\nin quality.","answer_id":18486},{"id":6395,"question":"Which of the following is the appropriate characteristic of object-oriented models?","answer_label":"Data is hidden from the outside and indirectly handled by procedures called methods.A program is a collection of data and methods.","answer_id":25708},{"id":2042,"question":"In a white box test, which of the following is used to evaluate the proportion of lines of code that are executed?","answer_label":"Test coverage analysis","answer_id":9329},{"id":4678,"question":"Which of the following is a chart or a diagram that shows the quality of a product in order of time and is used for determining whether or not the production process is in a stable state within the control limits?","answer_label":"Control chart","answer_id":19393},{"id":6147,"question":"As shown in the figure below, all the lines show signs of leveling off in the control chart of a program test. Which of the following can be inferred from this condition?\n![](https://learn.viblo.asia/uploads/4/8/48a7724e-36cb-44ae-830d-2294d8169264.png)","answer_label":"The process is facing some bugs that are difficult to resolve, and subsequent tests are not proceeding.","answer_id":24805},{"id":474,"question":"Which of the following is the most appropriate description of stack-trace in relation to debugging a program?","answer_label":"A trace of call stack methods/functions/subroutines","answer_id":5880},{"id":3349,"question":"Among the maintenance activities of a system, which of the following is an appropriate\ndescription of adaptive maintenance?","answer_label":"The system is modified to cope with changes in the external environments.","answer_id":14333},{"id":4785,"question":"In a narrow sense, which of the following is the most appropriate description concerning the function of a tracer that can be used for debugging purposes?","answer_label":"It can record program flow, such as the sequence and results of execution of the program instructions.","answer_id":19777},{"id":3654,"question":"Which of the following is the appropriate description concerning standardization in programming?","answer_label":"Defining programming conventions is effective for preventing errors that programmers tend to make.","answer_id":15531},{"id":3842,"question":"When a system is developed by using object-oriented approach, which of the following is the effect of encapsulation?","answer_label":"When the internal data structure or the implementation of a method for an object is changed, other objects are not susceptible to the change.","answer_id":16258},{"id":4780,"question":"A certain program module directly refers to the content of another module. It executes a single unique function, and some concept, data structure, or resource is hidden within the single module. From a standpoint of module independence, which of the following combinations appropriately shows the “module strength” and “module coupling” of this module?\n![](https://learn.viblo.asia/uploads/b/d/bd7260f7-3617-42bb-814a-4c65752d3b8c.png)","answer_label":"a","answer_id":19754},{"id":3478,"question":"Which of the following is a diagram used in UML2.0 for the purpose of depicting the interactions between the system, external systems, and users, or graphically describing who uses the system and in what ways the user expects to interact with the system?","answer_label":"Use case diagram","answer_id":14837},{"id":828,"question":"Which of the following is an appropriate description concerning test data for the black box testing?","answer_label":"Test data is created based on external specification.","answer_id":4796},{"id":4787,"question":"Which of the following is used for estimating the scale of system development with the function point method?","answer_label":"Number of screens","answer_id":19784},{"id":6392,"question":"In the flowchart below, which of the following indicates the relationship between the initial values a and b that are given in m and n in the process (1) in order to carry out these processes in the order shown below? \n(1) → (2) → (3) → (5) → (2) → (3) → (4) → (2) → (6) \nHere, a and b are both positive integers.\n![](https://learn.viblo.asia/uploads/d/e/dee4f7aa-2ee3-441a-8d84-b7e2a1366a01.png)","answer_label":"3a = 2b","answer_id":25697},{"id":4321,"question":"Which of the following software test methods is performed to verify whether changes made for software maintenance are not affecting other portions of the software?","answer_label":"Regression test","answer_id":18147},{"id":3650,"question":"Which of the following systems is the most suitable for a design using a state transition diagram?","answer_label":"A greenhouse control system, which keeps the optimum environment in a greenhouse based on the information of the installed sensors","answer_id":15515},{"id":6402,"question":"In software maintenance, which of the following tests is performed to ensure that fixes or modifications do not affect other, unchanged parts of the software?","answer_label":"Regression test","answer_id":25737},{"id":4605,"question":"Which of the following most appropriately describes the handling of control\ninformation in system operation management?","answer_label":"The system should be managed by a small group of managers. Each manager\nshould be given an exclusive and separate account. Control information should be\ndisclosed to the general user after its security level and other factors are considered.","answer_id":19138},{"id":6113,"question":"Which of the following is the appropriate statement concerning how to use management\r\nscience methodology?","answer_label":"The time-series analysis method is used to forecast product sales in the market.","answer_id":24669},{"id":4413,"question":"![](https://learn.viblo.asia/uploads/7/7/77a6854f-4f1c-43ba-a2df-40dfc06ad862.png)","answer_label":"c","answer_id":18458},{"id":4331,"question":"Three products A, B, and C are produced from raw materials at plant X. The production time per unit volume of each product, the required quantity of raw materials, and the profit amounts are shown in the table below. The maximum production hours per month at this plant total 240 hours, and the amount of raw materials that can be fed for production is 150 kg per month.\n\nUnder these conditions, management would like to know how many of A, B, and C should be manufactured so as to yield maximum profits. Which of the following is an appropriate method for solving this problem?\n![](https://learn.viblo.asia/uploads/b/1/b1afe633-567f-48ab-acdf-6583ee31dfeb.png)","answer_label":"Linear programming method","answer_id":18187},{"id":1895,"question":"In the Information Technology Infrastructure Library (ITIL), lowering an indicator that represents maintainability is given as an example of a key performance indicator (KPI) for availability management. Which of the following corresponds to this indicator?","answer_label":"Mean time to restore services","answer_id":8789},{"id":4322,"question":"A check digit for a 4-digit number $X_1X_2X_3X_4$ can be calculated as follows:\n$$\\bmod ((X_1\\times 4+X_2\\times 3+X_3\\times 2+X_4\\times 1), 10)$$\nWhen the check digit for the 4-digit number “$7X_242$″ is equal to 6, which of the following is the correct number to be put in $X_2$? Here, mod(a,b) returns the remainder after “a” is divided by “b.”","answer_label":"6","answer_id":18150},{"id":2814,"question":"There is a program module that is executed only when the value of integer x is ![](https://learn.viblo.asia/uploads/a/e/ae536171-acd6-4fe9-a340-ca14bc2e7b7b.png) When this module is tested using the boundary value analysis, which of the following is an appropriate combination of values to be tested?","answer_label":"24, 25, 49, 50","answer_id":12255},{"id":3347,"question":"When the quality of a software product is evaluated using the ISO/IEC 25000 series of\nstandards, which of the following is an appropriate quality characteristic that means the\ncapability of the software product to maintain a specified level of performance when it\nis used under specified conditions?","answer_label":"Reliability","answer_id":14325}]