[{"id":13508,"question":"Mẫu thiết kế có cấu trúc nào sau đây cho phép các lớp có giao diện không tương thích làm việc với nhau và điều đó có thể thực hiện được trong cả hai dạng sơ đồ dưới đây?\n![](https://learn.viblo.asia/uploads/5/4/547d392a-d55c-4264-b697-1ad7934601c1.jpg)","answer_label":"Adapter","answer_id":52282},{"id":13506,"question":"Lựa chọn nào sau đây là một cơ chế cho phép một số lớp con có chung lớp cha mẹ được định nghĩa lại cùng một phương pháp với các hành vi khác nhau?","answer_label":"Đa hình","answer_id":52277},{"id":13536,"question":"Điều nào sau đây phải được khách hàng chấp thuận khi thiết kế bên ngoài của một hệ thống được hoàn thành?","answer_label":"Bố trí màn hình","answer_id":52396},{"id":13540,"question":"Phương pháp nào dưới đây là phương pháp sử dụng công cụ mô hình hóa để tạo ra một tài liệu thiết kế được mô tả với sơ đồ E-R hoặc các biểu diễn khác từ thông tin định nghĩa trong cơ sở dữ liệu hoạt động?","answer_label":"Kỹ nghệ ngược","answer_id":52412},{"id":13505,"question":"Trong kiểm thử đơn vị, các hoạt động nào sau đây là bộ phận của “kiểm thử hộp trắng”?","answer_label":"Kiểm thử điều kiện","answer_id":52271},{"id":13509,"question":"Thuật ngữ nào sau đây chỉ tiến trình tạo ra một sơ đồ lớp của UML từ một chương trình?","answer_label":"Kỹ thuật đảo ngược","answer_id":52289},{"id":13539,"question":"Kiểm thử tích hợp cho phần mềm gồm các mô-đun được sắp xếp theo cấu trúc phân cấp được thực hiện từ một mô-đun cấp cao. Trong trường hợp như vậy, lựa chọn nào sau đây là một mô đun kiểm thử được sử dụng thay thế cho một mô-đun cấp thấp?","answer_label":"Stub","answer_id":52409},{"id":13895,"question":"Như thể hiện trong danh sách dưới đây, có ba loại kết nối. Lựa chọn nào sau đây là tổ hợp phù hợp nhất của các loại kết nối? \n\nKết nối A: Một mô-đun chuyển một yếu tố điều khiển tới mô-đun khác.\nKết nối B: Một mô-đun chuyển cấu trúc dữ liệu như một tham số cho mô-đun khác.\nKết nối C: Hai mô-đun có quyền truy cập vào cùng dữ liệu toàn cầu. \n\n![](https://learn.viblo.asia/uploads/c/5/c5d3263f-b20f-4049-a5d0-2e6d89173ac3.png)","answer_label":"d","answer_id":53833},{"id":13538,"question":"Để tăng tính độc lập mô đun, mức độ khớp nối mô đun phải thấp. Phương pháp trao đổi thông tin giữa các mô đun nào sau đây có mức khớp nối mô đun thấp nhất?","answer_label":"Chỉ các mục dữ liệu cần thiết cho đầu vào và đầu ra được truyền như là đối số giữa các mô-đun","answer_id":52403},{"id":13892,"question":"Lựa chọn nào sau đây là một phương pháp thích hợp để ngăn chặn tấn công tràn bộ đệm?","answer_label":"Thực hiện việc kiểm tra ranh giới trên mọi biến chuỗi trong chương trình để khẳng định rằng chiều dài của chuỗi đầu vào không vượt quá kích thước của biến đích","answer_id":53821},{"id":13893,"question":"Các công ty thường cung cấp phương tiện cho lực lượng lao động di động của họ để truy cập vào mạng công ty một cách an toàn trên Internet thông qua các kênh không an toàn như mạng không dây mở tại khách sạn hoặc quán cà phê. Lựa chọn nào sau đây là công nghệ thích hợp có thể được sử dụng cho mục đích này?","answer_label":"VPN (Virtual Private Network)","answer_id":53825},{"id":13504,"question":"Theo tiêu chuẩn ISO/IEC 25010 (Hệ thống và công nghệ phần mềm – Hệ thống và Yêu cầu chất lượng phần mềm và Đánh giá (SQuaRE) – Hệ thống và các mô hình chất lượng phần mềm), lựa chọn nào sau đây là một đặc tính chất lượng thích hợp mà có nghĩa là mức độ mà một sản phẩm hoặc hệ thống cung cấp chức năng thỏa mãn các quy định và bao hàm cần thiết khi được sử dụng trong các điều kiện xác định?","answer_label":"Phù hợp chức năng","answer_id":52266},{"id":13537,"question":"Lựa chọn nào sau đây là sự kết hợp thích hợp của các khái niệm cơ bản về hướng đối tượng?","answer_label":"Trừu tượng, đóng gói, kế thừa, lớp","answer_id":52398},{"id":13507,"question":"Việc kiểm thử tích hợp đối với một phần mềm gồm các mô-đun bố trí theo cấu trúc phân cấp được tiến hành từ một mô-đun cấp thấp. Trong trường hợp đó, lựa chọn nào sau đây là mô đun kiểm thử được dùng thay thế cho một mô-đun cấp cao hơn?","answer_label":"Phần mềm điều khiển","answer_id":52278},{"id":13894,"question":"Lựa chọn nào sau đây là các thành phần của một sơ đồ trạng thái UML2.x (bao gồm 2.0 và các phiên bản sau)?","answer_label":"Trạng thái và Chuyển đổi","answer_id":53829},{"id":13897,"question":"Khi kiểm thử một thành phần phần mềm, lựa chọn nào sau đây là một sự kết hợp phù hợp của X và Y?\n\n  X: Nó gọi thành phần phần mềm sẽ được kiểm thử  \n  Y: Nó được gọi từ thành phần phần mềm sẽ được kiểm thử.        \n![](https://learn.viblo.asia/uploads/4/d/4d9bd7fa-8edf-4670-b088-5c58ca607f72.png)","answer_label":"b","answer_id":53839},{"id":13896,"question":"Lựa chọn nào sau đây là một mô tả phù hợp liên quan đến dữ liệu kiểm thử cho kiểm thử hộp đen?","answer_label":"Dữ liệu kiểm thử được tạo ra theo đặc tả kỹ thuật bên ngoài.","answer_id":53836},{"id":13891,"question":"Lựa chọn nào sau đây là một kiểm thử thích hợp để xác minh tính hiệu quả của các biện pháp an ninh bằng cách thử xâm nhập vào?","answer_label":"Kiểm thử thâm nhập","answer_id":53816}]