[
  {
    "id": 13324,
    "question": "Một thanh ghi lưu một giá trị số nguyên dưới dạng nhị phân. Cho x là số nguyên dương được lưu trữ trong thanh ghi, sau đó thực hiện các phép toán dưới đây.\n\n(1) Dịch chuyển nội dung của thanh ghi sang bên trái 2 bit\n\n(2) Cộng x vào thanh ghi\n\nGiá trị của thanh ghi lớn hơn bao nhiêu lần so với số nguyên x?",
    "answer_label": "5",
    "answer_id": 51551
  },
  {
    "id": 13326,
    "question": "Lựa chọn nào sau đây là giá trị thập phân tương đương với phân số thập lục phân 0.B1?!",
    "answer_label": "![](https://learn.viblo.asia/uploads/1/1/11e26150-9030-4e80-983c-2942d1e25543.jpg)",
    "answer_id": 51560
  },
  {
    "id": 13327,
    "question": "Lựa chọn nào sau đây là lời giải cho biểu thức logic với biến X bên dưới? Ở đây, A, B và C là các hằng số logic; các toán tử “+”, “∙”, và “¯” biểu thị tương ứng OR logic, AND logic, và NEGATION.\n![](https://learn.viblo.asia/uploads/c/a/ca5adfde-024e-4e2f-aa63-598435be1171.jpg)",
    "answer_label": "![](https://learn.viblo.asia/uploads/3/a/3ae04185-a36d-48ba-b85a-011421fe5bc7.jpg)",
    "answer_id": 51564
  },
  {
    "id": 13328,
    "question": "Alice và Mary có một buổi thi toán. Xác suất đỗ tương ứng của Alice và Mary là 2/3 và 3/5. Đâu là xác suất để ít nhất một trong hai người đỗ?",
    "answer_label": "13/15",
    "answer_id": 51568
  },
  {
    "id": 13329,
    "question": "Tần suất tới trong mô hình hàng đợi M/M/1 là phân bố gì?",
    "answer_label": "Phân bố Poisson",
    "answer_id": 51572
  },
  {
    "id": 13330,
    "question": "Với phiên bản ngẫu nhiên của thuật toán sắp xếp nhanh, ở đó phần tử chốt được chọn ngẫu nhiên, lựa chọn nào sau đây cho biết các độ phức tạp trung bình và xấu nhất? Ở đây O( ) được dùng để biểu thị thứ tự của mức độ phức tạp.",
    "answer_label": "![](https://learn.viblo.asia/uploads/3/d/3d2f77ff-e068-4a17-99f3-421e16ad736b.jpg)",
    "answer_id": 51574
  },
  {
    "id": 13332,
    "question": "Có một ngôn ngữ được định nghĩa bởi ngữ pháp phi-ngữ cảnh với các luật sinh như sau: \n![](https://learn.viblo.asia/uploads/a/d/ad47b73a-dc37-4c9d-9470-dc2f829d8873.jpg)\nTrong ngữ pháp này, các ký hiệu chưa kết thúc là E, T, F, và C; các ký hiệu kết thúc là dấu ngoặc, dấu cộng, dấu hoa thị, và các số; E là dấu hiệu bắt đầu. Lựa chọn nào sau đây cho biết rằng biểu thức 7 + 3 * (6 + 4) là một câu của ngôn ngữ này.",
    "answer_label": "![](https://learn.viblo.asia/uploads/c/6/c6b0646f-e4c3-4ec8-8436-64196e174893.jpg)",
    "answer_id": 51582
  },
  {
    "id": 13333,
    "question": "Cho A là một mảng số nguyên kích thước 10, có phần tử thứ i được biểu diễn bởi A[i] với i=0 cho tới 9, và giá trị khởi tạo của mảng là 0. Đối với một số nguyên dương k, các luật bên dưới xác định phần tử lưu giá trị k. Khi các số nguyên 16, 43, 73, 24, và 85 được xử lý theo thứ tự này, giá trị cuối cùng 85 được lưu trong phần \r\ntử nào? Ở đây, x mod y là phần dư sau khi chia x cho y.\r\n[Các luật]\r\n(1) Nếu A[k mod 10] = 0, thì lưu k trong A[k mod 10].\r\n(2) Ngược lại, nếu A[(k + 1) mod 10] = 0, thì lưu k trong A[(k + 1) mod 10].\r\n(3) Ngược lại, Nếu A[(k + 4) mod 10] = 0, thì lưu k trong A[(k + 4) mod 10].\r\n(4) Ngược lại, loại bỏ k.",
    "answer_label": "A[9]",
    "answer_id": 51589
  },
  {
    "id": 13334,
    "question": "Đặc trưng của kiểu dữ liệu danh sách thường được biểu diễn theo hai cách là bằng mảng hoặc bằng con trỏ. Lựa chọn nào sau đây mô tả một đặc điểm của cách biểu diễn bằng mảng?",
    "answer_label": "Bất kể số lượng thực sự các phần tử có trong danh sách, sẽ có một vài khoảng trống không được sử dụng mặc dù các khoảng trống này đã được cấp phát tối đa cho các phần tử",
    "answer_id": 51593
  },
  {
    "id": 13335,
    "question": "Để các lưu đồ dưới đây là tương đương, sự kết hợp nào sau đây là thích hợp với các nhãn A và B? Ở đây, biểu thị phủ định của P.\n![](https://learn.viblo.asia/uploads/9/0/901b3dfc-f20f-4d8c-93f4-cc9fe7cb566c.jpg)",
    "answer_label": "![](https://learn.viblo.asia/uploads/7/5/75cccb3f-c64b-402d-9e0b-3a1f2269604c.jpg)",
    "answer_id": 51594
  },
  {
    "id": 13341,
    "question": "Một CPU với một đường ống bốn trạng thái gồm nạp, giải mã, thực thi, và ghi lại, mỗi trạng thái mất tương ứng 10, 6, 8, và 8 ns. Lựa chọn nào sau đây là thời gian thực thi lệnh trung bình tính theo nanô-giây (ns) của CPU? Ở đây, số lệnh được thực thi là đủ lớn. Ngoài ra, phụ phí của tiến trình pipeline là không đáng kể, và tác động gây trễ của tất cả các xung đột được bỏ qua.",
    "answer_label": "10",
    "answer_id": 51616
  },
  {
    "id": 13342,
    "question": "Giá trị nào là kết quả biểu thức toán học của việc duyệt trung-thứ-tự cây nhị phân bên dưới?\n![](https://learn.viblo.asia/uploads/a/e/ae4beb94-588d-44c7-b6d6-8dcb4387d5f3.jpg)",
    "answer_label": "20",
    "answer_id": 51619
  },
  {
    "id": 13343,
    "question": "Lựa chọn nào sau đây là kiến trúc máy tính ở đó một bộ xử lý thực thi cùng một lệnh trên nhiều dữ liệu?",
    "answer_label": "SIMD",
    "answer_id": 51624
  },
  {
    "id": 13344,
    "question": "Lựa chọn nào sau đây là phương thức đánh địa chỉ cung cấp offset cho nội dung bộ đếm chương trình (PC) để quyết định địa chỉ của toán hạng?",
    "answer_label": "Phương thức đánh địa chỉ tương đối",
    "answer_id": 51629
  },
  {
    "id": 13345,
    "question": "Lựa chọn nào sau đây được dùng để dịch địa chỉ logic được sinh ra bởi CPU thành một địa chỉ vật lý?",
    "answer_label": "Memory Management Unit (MMU)",
    "answer_id": 51632
  },
  {
    "id": 13346,
    "question": "Lựa chọn nào sau đây là mô tả thích hợp liên quan đến bộ nhớ cache?",
    "answer_label": "Các bộ đa xử lý ở đó bộ nhớ cache cần để đồng bộ các giá trị bên trong cache để duy trì liên lạc",
    "answer_id": 51635
  },
  {
    "id": 13347,
    "question": "Lựa chọn nào sau đây là kỹ thuật của việc phân đoạn và lưu trữ dữ liệu trên nhiều ổ đĩa cứng như trong hình minh họa? Ở đây b0 tới b15 thể hiện dãy mà trong đó dữ liệu được lưu trữ trên các đĩa dữ liệu theo từng bit một.\n![](https://learn.viblo.asia/uploads/9/6/96b7c478-2803-44cd-b458-d03affa2a6ff.jpg)",
    "answer_label": "Phân dải (Striping)",
    "answer_id": 51641
  },
  {
    "id": 13348,
    "question": "Lựa chọn nào sau đây là mô tả thích hợp về thông lượng?",
    "answer_label": "Spooling, liên quan tới việc tạm thời tiết kiệm đầu ra cho một máy in trong một đĩa cứng, rất hữu ích trong việc cải thiện thông lượng.",
    "answer_id": 51644
  },
  {
    "id": 13429,
    "question": "Lựa chọn nào sau đây là giá trị thời gian trung bình giữa các lỗi (MTBF) của toàn bộ hệ thống ở đó đơn vị A và đơn vị B được ghép nối tiếp và cả hai đơn vị hoạt động như một hệ thống? Giá trị MTBF của đơn vị A và đơn vị B lần lượt là 200 và 300 giờ.",
    "answer_label": "250",
    "answer_id": 51967
  },
  {
    "id": 13430,
    "question": "Khi hệ số nhân của việc xử lý được tăng lên trong bộ nhớ ảo của một hệ thống máy tính, các thao tác page-in và page-out xuất hiện thường xuyên, và tốc độ phản hồi của hệ thống giảm đột ngột. Hiện tượng này gọi là gì?",
    "answer_label": "Thrashing",
    "answer_id": 51973
  },
  {
    "id": 13431,
    "question": "Một công ty thực hiện sao lưu toàn bộ vào mỗi tối Chủ Nhật và sao lưu khác biệt vào mỗi tối khác ngoài tối Chủ Nhật. Nếu lỗi xuất hiện vào sáng thứ Tư, các sao lưu nào dưới đây là cần thiết ít nhất để khôi phục hệ thống?",
    "answer_label": "Các sao lưu khác biệt mới nhất và sao lưu toàn bộ mới nhất từ thứ Ba.",
    "answer_id": 51976
  },
  {
    "id": 13432,
    "question": "Lựa chọn nào sau đây là giải thích phù hợp về phương pháp lập lịch không ưu tiên?",
    "answer_label": "Một tác vụ không thể di chuyển đến một trạng thái đang hoạt động cho đến khi một tác vụ khác trong trạng thái đang hoạt động hoặc tự nó chuyển sang trạng thái chờ đợi hoặc kết thúc.",
    "answer_id": 51978
  },
  {
    "id": 13433,
    "question": "Có một hệ thống được tạo bởi hai (2) CPU, và CPU không dùng sẽ được gán cho một tác vụ mà đối với nó có một yêu cầu thực thi. Khi hai (2) tác vụ A và B chạy trên hệ thống này, các tác vụ này sử dụng duy nhất một tài nguyên chung R. Hình bên dưới cho thấy các giai đoạn sử dụng của các CPU và tài nguyên R với hai tác vụ A và B, và thứ tự các tác vụ này chạy. Khi việc thực thi cả hai tác vụ được bắt đầu đồng thời, mất bao nhiêu thời gian, tính theo mili-giây, cần thiết đến khi hoàn thành việc xử lý cả hai tác vụ? Ở đây, cả CPU và tài nguyên R đều sẵn dùng khi các tác vụ A và B bắt đầu.\n![](https://learn.viblo.asia/uploads/b/e/beb5a788-1d4a-4b2d-849d-7f46c7634b31.jpg)",
    "answer_label": "140",
    "answer_id": 51983
  },
  {
    "id": 13434,
    "question": "Theo Định nghĩa Phần mềm Mở của OSI (Open Source Initiative), lựa chọn nào sau đây là mô tả phù hợp liên quan đến giấy phép mã mở?",
    "answer_label": "Giấy phép yêu cầu rằng mã nguồn của một chương trình phải được thực hiện sẵn sàng cho việc sử dụng miễn phí hoặc với một chi phí tái sản xuất hợp lý.",
    "answer_id": 51989
  },
  {
    "id": 13435,
    "question": "![](https://learn.viblo.asia/uploads/1/c/1c0fb16d-1713-44d5-a357-2cb7b7969e86.jpg)",
    "answer_label": "![](https://learn.viblo.asia/uploads/9/9/99002dad-9fdb-4f3b-9757-b389bd0eb4b3.jpg)",
    "answer_id": 51993
  },
  {
    "id": 13436,
    "question": "Đối với hai biến logic X và Y, phép toán logic X NAND Y được định nghĩa là một phép toán tổng hợp NOT (X AND Y). Câu nào sau đây tương đương với phép toán logic X OR Y?",
    "answer_label": "(X NAND X) NAND (Y NAND Y)",
    "answer_id": 51995
  },
  {
    "id": 13437,
    "question": "Chuỗi bit nào dưới đây được chấp nhận bởi máy tự động được mô tả trong sơ đồ chuyển trạng thái dưới đây? Ở đây, mỗi chuỗi được xử lý mỗi lần một bit theo thứ tự từ bên trái.\n![](https://learn.viblo.asia/uploads/0/f/0ff32049-e45f-49c8-9266-eda336ff39f5.jpg)",
    "answer_label": "1010",
    "answer_id": 52000
  },
  {
    "id": 13438,
    "question": "Lựa chọn nào sau đây là cây tìm kiếm nhị phân có các khóa được gán cho các nút theo thứ tự tự nhiên?",
    "answer_label": "![](https://learn.viblo.asia/uploads/2/3/234ea6eb-3aa2-499c-8e53-7c5d87073b86.jpg)",
    "answer_id": 52003
  },
  {
    "id": 13439,
    "question": "Có một mảng số nguyên hai chiều A có phần tử (i, j) A[i, j] là 2 × i + j. Giá trị của phần tử     A[A[1, 1] × 2, A[2, 2] + 1] là gì?",
    "answer_label": "19",
    "answer_id": 52009
  },
  {
    "id": 13440,
    "question": "Hàm F(n) là một hàm số nguyên được định nghĩa đệ quy để tính toán giai thừa của n cho bất kỳ số nguyên âm không n. Đáp án nào sau đây là một biểu thức thích hợp cho khoảng trắng A?\n![](https://learn.viblo.asia/uploads/c/8/c863db3f-3b0a-42d6-8b38-fe22105ba04a.jpg)",
    "answer_label": "n × F(n - 1)",
    "answer_id": 52012
  },
  {
    "id": 13441,
    "question": "Kết quả của thủ tục trong biểu đồ luồng dưới đây là gì, biết rằng x và y là số nguyên dương?\n![](https://learn.viblo.asia/uploads/b/a/ba4adb39-a2a8-472b-9ec0-a3efe09610a9.jpg)",
    "answer_label": "Giá trị của s: Thương của x ÷ y\n\nGiá trị của t: Số dư của x ÷ y",
    "answer_id": 52015
  },
  {
    "id": 13442,
    "question": "Lựa chọn nào trong các phương thức đánh địa chỉ sau đây xác định địa chỉ có hiệu lực bằng cách thêm giá trị của thanh ghi địa chỉ lệnh (bộ đếm chương trình) vào giá trị được ghi trong phần địa chỉ của lệnh?",
    "answer_label": "Địa chỉ tương đối",
    "answer_id": 52021
  },
  {
    "id": 13443,
    "question": "Một máy tính có hai mức bộ nhớ, bộ nhớ cache và bộ nhớ chính, với thời gian truy cập là 0,01 μs và 0,1 μs tương ứng. Nếu tỷ lệ truy cập của bộ nhớ cache là 90%, lựa chọn nào sau đây là thời gian truy cập bộ nhớ trung bình cho hệ thống này? Trong trường hợp này, nếu dữ liệu nằm trong bộ nhớ cache, bộ xử lý sẽ truy cập dữ liệu trực tiếp với thời gian truy cập là 0,01 μs. Tuy nhiên, nếu truy cập bộ nhớ cache thất bại, trước tiên dữ liệu phải được chuyển từ bộ nhớ chính vào bộ nhớ cache, sau đó được truy cập từ bộ nhớ cache. Do đó, thời gian truy cập là 0.11 μs.",
    "answer_label": "0,020 µs",
    "answer_id": 52024
  },
  {
    "id": 13444,
    "question": "Thiết bị nào sau đây là thiết bị đầu ra cho máy tính?",
    "answer_label": "Máy in",
    "answer_id": 52028
  },
  {
    "id": 13445,
    "question": "Lựa chọn nào sau đây là độ trễ quay vòng trung bình của ổ cứng tính bằng mili giây khi tốc độ quay là 2000 vòng/phút?",
    "answer_label": "15",
    "answer_id": 52031
  },
  {
    "id": 13446,
    "question": "Điều nào sau đây là một phương pháp làm tăng tốc độ dữ liệu vào / ra bằng cách chia dữ liệu tuần tự logic và ghi dữ liệu được chia thành nhiều đĩa cứng?",
    "answer_label": "Striping",
    "answer_id": 52036
  },
  {
    "id": 13447,
    "question": "Điều nào sau đây là một đặc tính của cụm cấu hình HA (High Availability) dựa trên một phương pháp dự phòng nóng khi nó được so sánh với cụm cấu hình phân phối tải sử dụng bộ cân bằng tải?",
    "answer_label": "Một máy chủ có cùng đặc điểm kỹ thuật là cần thiết như một máy chủ thứ cấp, nhưng vì các tiến trình được chuyển qua máy chủ thứ cấp trong trường hợp hỏng hóc chính nên thông lượng có thể được duy trì ngay cả trong trường hợp hỏng hóc.",
    "answer_id": 52038
  },
  {
    "id": 13448,
    "question": "Câu nào sau đây là mô tả thích hợp liên quan đến độ sẵn sàng của hệ thống?",
    "answer_label": "Nếu MTTR có thể được rút ngắn mà không thay đổi MTBF, độ sẵn sàng của hệ thống được cải thiện.",
    "answer_id": 52043
  },
  {
    "id": 13449,
    "question": "Phương án nào sau đây là lỗi trang trong một hệ thống bộ nhớ ảo?",
    "answer_label": "Truy cập vào một trang được ánh xạ trong bộ nhớ ảo, nhưng không được tải trong bộ nhớ vật lý",
    "answer_id": 52046
  },
  {
    "id": 13450,
    "question": "Trong một tệp tin tổ chức trực tiếp có nhiều địa chỉ lưu trữ từ một (1) đến sáu (6), dữ liệu được lưu trữ dưới các điều kiện phía dưới đây. Giá trị khóa nào của dữ liệu được lưu trữ trong địa chỉ một (1)?\n\n[Điều kiện]\n\n(1) Dữ liệu được lưu trữ theo thứ tự các giá trị khóa ba (3), bốn (4), tám (8), 13, 14, và 18.\n\n(2) Địa chỉ lưu trữ là giá trị mà phần còn lại thu được bằng cách chia giá trị dữ liệu quan trọng cho năm (5) và sau đó thêm một (1) vào.\n\n(3) Nếu địa chỉ lưu trữ đã bị chiếm, dữ liệu được lưu trữ trong địa chỉ kế tiếp. Quá trình này được lặp lại cho đến khi dữ liệu được lưu trữ. Địa chỉ tiếp theo của địa chỉ cuối cùng là địa chỉ đầu tiên. \n\n(4) Trong trạng thái ban đầu, không có gì được lưu trữ trong tệp tin.",
    "answer_label": "13",
    "answer_id": 52051
  },
  {
    "id": 13451,
    "question": "Điều nào sau đây được phân loại như một chức năng của một công cụ kiểm tra tĩnh?",
    "answer_label": "Phát hiện một lỗi trong chương trình bằng cách phân tích mã nguồn",
    "answer_id": 52055
  },
  {
    "id": 13452,
    "question": "Với thủ tục chuyển giữa nhiều chương trình của các tiến trình thể hiện trong hình bên dưới, đáp án nào sau đây là sự kết hợp thích hợp của việc xử lý hệ điều hành từ A đến C?\n![](https://learn.viblo.asia/uploads/2/7/27dc4c49-db7e-46a2-8c92-fcccd836574b.jpg)",
    "answer_label": "A: Lưu lại trạng thái chạy\r\nB: Lựa chọn tiến trình\r\nC: Phục hồi trạng thái chạy",
    "answer_id": 52060
  },
  {
    "id": 13453,
    "question": "Điều nào sau đây là chức năng thích hợp của trình liên kết?",
    "answer_label": "Tạo một mô-đun tải từ nhiều mô-đun đối tượng bằng cách thực hiện các hoạt động như phân giải chéo tham chiếu",
    "answer_id": 52062
  },
  {
    "id": 13454,
    "question": "Một bộ chuyển đổi D/A với sự phân giải của 8 bit tạo ra một điện áp đầu ra 0 vôn cho một giá trị đầu vào số là 0, và điện áp đầu ra 2,5 vôn cho một giá trị đầu vào số 128. Khi bit 1 thấp nhất của giá trị đầu vào số được thay đổi, đáp án nào sau đây là sự thay đổi (tính bằng vôn) của điện áp đầu ra được tạo ra bởi bộ chuyển đổi D/A?",
    "answer_label": "2.5/128",
    "answer_id": 52066
  },
  {
    "id": 13455,
    "question": "Các mạch cộng bán phần trong sơ đồ dưới đây cộng hai (2) số nhị phân một chữ số x và y, và có z (số đầu tiên của tổng) và c (bit nhớ) là đầu ra. Đáp án nào sau đây là sự kết hợp thích hợp của các thiết bị cổng A và B?\n![](https://learn.viblo.asia/uploads/e/0/e0f5d9ad-09a4-4395-8d0f-ba23d32eb793.jpg)",
    "answer_label": "A: Exclusive logical sum (XOR)\r\nB: Logical product (AND)",
    "answer_id": 52070
  },
  {
    "id": 13456,
    "question": "Mạch nào sau đây tương đương với mạch logic được hiển thị bên dưới?\n![](https://learn.viblo.asia/uploads/4/9/4939cdc7-0ef1-4687-864c-094fed6bdf13.jpg)",
    "answer_label": "![](https://learn.viblo.asia/uploads/3/f/3fdde26d-095b-43c5-a518-27a30eccaed0.jpg)",
    "answer_id": 52076
  },
  {
    "id": 13457,
    "question": "Khi dữ liệu đặt hàng ở định dạng dưới đây được nhập, lựa chọn nào sau đây là một phép kiểm tra thích hợp để kiểm tra xem giá trị của trường Order date là vào ngày làm việc trùng hay trước ngày nhập?\n![](https://learn.viblo.asia/uploads/0/b/0b094680-67ed-4385-8990-3199e82b81f6.jpg)",
    "answer_label": "Kiểm tra logic",
    "answer_id": 52081
  },
  {
    "id": 13458,
    "question": "Lựa chọn nào sau đây là một quá trình trong PCM để lấy các giá trị tương tự từ tín hiệu âm thanh trong một khoảng thời gian định kỳ?",
    "answer_label": "Lấy mẫu",
    "answer_id": 52085
  },
  {
    "id": 13459,
    "question": "Thuộc tính nào sau đây của giao dịch cơ sở dữ liệu đề cập đến khả năng hệ thống có thể khôi phục lại một giao dịch đã cam kết khi hệ thống hoặc phương tiện lưu trữ thất bại?",
    "answer_label": "Độ bền",
    "answer_id": 52088
  },
  {
    "id": 13460,
    "question": "Có một bảng “Delivery” có sáu (6) bản ghi. Điều nào sau đây là sự phụ thuộc chức năng mà bảng này thỏa mãn? Ở đây, “X → Y”  chỉ ra rằng X quyết định chức năng Y.\n![](https://learn.viblo.asia/uploads/7/c/7cf1f7db-ba56-4c03-9985-128eed4dfb52.jpg)",
    "answer_label": "Delivery_destination → Component_ID",
    "answer_id": 52091
  },
  {
    "id": 13461,
    "question": "Lựa chọn nào trong số các phương pháp kết hợp hai (2) bảng trong một RDBMS sau đây là mô tả của phương pháp nối hợp nhất sắp xếp?",
    "answer_label": "Tất cả các hàng trong các bảng được sắp xếp lại theo các giá trị trong cột để được nối, và chúng được nối theo thứ tự từ trên xuống.",
    "answer_id": 52094
  },
  {
    "id": 13462,
    "question": "Khi câu lệnh SQL được hiển thị bên dưới được thực hiện trên bảng “Employee” và bảng “Department”  đáp án nào là kết quả của câu lệnh? \n\nSELECT COUNT(*) FROM Employee, Department\n\n           WHERE Employee.Department = Department.Department_name AND \n\t\t\t\t\t \n           Department.Floor = 2\n![](https://learn.viblo.asia/uploads/b/1/b1d31d57-0e06-4785-9e52-fa857ec9341f.jpg)",
    "answer_label": "3",
    "answer_id": 52100
  },
  {
    "id": 13463,
    "question": "Trong một hệ thống cơ sở dữ liệu phân tán, lựa chọn nào sau đây là một phương pháp để hoàn thiện xử lý cập nhật khi một truy vấn được tạo cho nhiều trang thực hiện một chuỗi các xử lý giao dịch như việc hoàn thiện có khả thi hay không và việc hoàn thiện có thể thực hiện trên tất cả các trang hay không?",
    "answer_label": "Xác nhận hai pha",
    "answer_id": 52105
  },
  {
    "id": 13464,
    "question": "Giao thức TCP/IP nào sau đây được sử dụng để chỉ định địa chỉ IP động?",
    "answer_label": "DHCP",
    "answer_id": 52107
  },
  {
    "id": 13465,
    "question": "Trong mô hình phân cấp mạng TCP/IP, tên của Thiết bị A kết nối hai phân đoạn LAN ở tầng Internet là gì?\n![](https://learn.viblo.asia/uploads/6/8/685fdcdf-46f4-415c-997f-53d4b613c232.jpg)",
    "answer_label": "Router",
    "answer_id": 52112
  },
  {
    "id": 13467,
    "question": "Mô hình phân phối nào sau đây sử dụng ARP?",
    "answer_label": "Unicast",
    "answer_id": 52121
  },
  {
    "id": 13468,
    "question": "Một máy tính cá nhân và một máy chủ web đang giao tiếp qua HTTP. Khi một gói tin yêu cầu được gửi từ máy tính tới máy chủ web, lựa chọn nào sau đây là kết hợp số cổng của gói phản hồi. Ở đây, số của cổng nguồn và cổng đích của gói tin yêu cầu là 50001 và 80 tương ứng",
    "answer_label": "Số của cổng nguồn (Máy chủ web): 80\n\nSố của cổng đích (Máy tính cá nhân): 50001",
    "answer_id": 52122
  },
  {
    "id": 13469,
    "question": "Công nghệ nào sau đây là một công nghệ ngăn chặn việc nhập thông tin tự động từ một chương trình bằng cách yêu cầu nhập các ký tự từ một hình ảnh bị méo hoặc một hình ảnh mà một số phần của nó bị ẩn? Công nghệ này dựa trên sự khác biệt về nhận thức của những hình ảnh này giữa con người và các chương trình.",
    "answer_label": "CAPTCHA",
    "answer_id": 52126
  },
  {
    "id": 13470,
    "question": "Lựa chọn nào sau đây là một cuộc tấn công đe dọa đến tính “toàn vẹn” của thông tin?",
    "answer_label": "Giả mạo một trang web",
    "answer_id": 52131
  },
  {
    "id": 13471,
    "question": "Lựa chọn nào sau đây là tên của cuộc tấn công mà hành vi được thực hiện nhằm đặt một trang web độc hại lên đầu của kết quả tìm kiếm của một trang web?",
    "answer_label": "Nhiễm độc SEO",
    "answer_id": 52136
  },
  {
    "id": 13472,
    "question": "Lựa chọn nào dưới đây là giải thích thích hợp cho một cuộc tấn công SQL injection?",
    "answer_label": "Một cuộc tấn công mà nếu có một lỗi trong cách thức gọi cơ sở dữ liệu từ một ứng dụng web, kẻ tấn công có thể thực hiện truy xuất trái phép, sửa đổi và xóa dữ liệu trong cơ sở dữ liệu bằng cách nhập một chuỗi ký tự độc hại bằng ngôn ngữ thao tác dữ liệu của lời gọi",
    "answer_id": 52140
  },
  {
    "id": 13473,
    "question": "Trong một giao dịch thương mại điện tử sử dụng mật mã khoá công khai, vai trò của cơ quan chứng nhận (CA) là gì?",
    "answer_label": "Cấp chứng thư số cho khoá công khai của các bên tham gia giao dịch",
    "answer_id": 52143
  },
  {
    "id": 13474,
    "question": "Điều nào sau đây là mục đích thích hợp để sử dụng giá trị băm trong an ninh số?",
    "answer_label": "Để chứng minh tính giống nhau giữa bản gốc và bản sao của dữ liệu có thể được sử dụng làm bằng chứng",
    "answer_id": 52147
  },
  {
    "id": 13475,
    "question": "Lựa chọn nào sau đây là hoạt động thích hợp để xác thực người dùng sử dụng thẻ IC và mã PIN?",
    "answer_label": "Khi phát hành thẻ IC, mã PIN không được đính kèm nhưng được thông báo cho người dùng thông qua kênh khác.",
    "answer_id": 52153
  },
  {
    "id": 13476,
    "question": "Khi phần mềm độc hại đã xâm nhập thành công vào máy PC giao tiếp với máy chủ điều khiển và kiểm soát trên Internet, điều nào sau đây là lý do để sử dụng số cổng TCP 80 là cổng đích trong hầu hết các trường hợp?",
    "answer_label": "Trong trường hợp cổng này được sử dụng để duyệt các trang web, khả năng cao là việc truyền thông sẽ được tường lửa cho phép.",
    "answer_id": 52154
  },
  {
    "id": 13477,
    "question": "Khi một ổ đĩa cứng hoạt động bình thường của một máy tính mà trên đó các tập tin bí mật được lưu trữ được chuyển giao cho một nhà cung cấp chất thải công nghiệp, đáp án nào sau đây là một biện pháp đối phó thích hợp để chống rò rỉ thông tin?",
    "answer_label": "Ghi đè lên tất cả các vùng trên đĩa cứng với một chuỗi bit ngẫu nhiên nhiều lần",
    "answer_id": 52161
  },
  {
    "id": 13478,
    "question": "Lựa chọn nào sau đây là lý do VLAN được sử dụng?",
    "answer_label": "Để giảm lưu lượng mạng",
    "answer_id": 52163
  },
  {
    "id": 13479,
    "question": "![](https://learn.viblo.asia/uploads/3/b/3b79dbc7-bfe8-4c9f-8a90-aadd9e443796.jpg)",
    "answer_label": "![](https://learn.viblo.asia/uploads/d/d/dd193ad5-fff1-4445-8463-48d764628562.jpg)",
    "answer_id": 52169
  },
  {
    "id": 13480,
    "question": "Lựa chọn nào sau đây là một mạch tuần tự mà có hai (2) trạng thái ổn định?",
    "answer_label": "Flip-flop",
    "answer_id": 52171
  },
  {
    "id": 13481,
    "question": "Lựa chọn nào sau đây là đầu vào thích hợp đối với một màn hình bảy đoạn dương cực thông dụng để hiển thị ký tự được xem như đầu ra? Ở đây, A là bit có trọng số lớn nhất (MSB) và G là bit có trọng số nhỏ nhất (LSB).\n![](https://learn.viblo.asia/uploads/a/e/ae90476e-e944-4a01-93e8-e6246ad81c5d.jpg)",
    "answer_label": "0110000",
    "answer_id": 52174
  },
  {
    "id": 13482,
    "question": "Lựa chọn nào sau đây là thích hợp đối với các font outline hơn là các font bitmap?",
    "answer_label": "Để làm lớn các ký tự theo một tỷ lệ cho trước",
    "answer_id": 52181
  },
  {
    "id": 13483,
    "question": "Lựa chọn nào sau đây là giải thích về kỹ thuật tạo chất liệu?",
    "answer_label": "Nó diễn tả các đặc điểm bề mặt nhờ việc dán một ảnh trên bề mặt của một vật thể ba chiều.",
    "answer_id": 52185
  },
  {
    "id": 13484,
    "question": "Lựa chọn nào sau đây là mục đích thích hợp để chấp nhận một kiến trúc lược đồ ba-lớp của DBMS?",
    "answer_label": "Để lấy được một bảng mới từ một bảng nguồn thông qua một thao tác quan hệ, nếu như bảng mới thực sự tồn tại",
    "answer_id": 52187
  },
  {
    "id": 13485,
    "question": "Lựa chọn nào sau đây là một phương pháp phù hợp dùng để xóa bỏ dư thừa dữ liệu trong các hệ thống cơ sở dữ liệu quan hệ?",
    "answer_label": "Chuẩn hóa",
    "answer_id": 52193
  },
  {
    "id": 13486,
    "question": "Đâu là mức độ tham gia thích hợp của quan hệ “Register” giữa thực thể “Customer” và thực thể “Car” mà khớp với biểu đồ bên dưới? Ở đây, “A..B” và “C..D” tương ứng chỉ ra mức độ tham gia liên kết tối đa và tối thiểu vào quan hệ.![](https://learn.viblo.asia/uploads/8/d/8df018d0-422c-48b8-b3f5-2ed48fbad3c8.jpg)",
    "answer_label": "![](https://learn.viblo.asia/uploads/c/d/cd1af363-fb34-4f24-a811-be6f3bfb0a06.jpg)",
    "answer_id": 52195
  },
  {
    "id": 13487,
    "question": "Trong một lược đồ quan hệ R = (A, B, C, D, E), cho các phụ thuộc hàm như sau:\nA→ BC\nCD→ E\nB → D\nE → A\nLựa chọn nào sau đây là một sự kết hợp của hai khóa dự tuyển của R?",
    "answer_label": "A và E",
    "answer_id": 52198
  },
  {
    "id": 13488,
    "question": "Lựa chọn nào sau đây là mục tiêu chính của hỗ trợ giao tác trong một hệ quản trị cơ sở dữ liệu?",
    "answer_label": "Để đảm bảo rằng hoặc là tất cả các cập nhật tương ứng với một giao tác cho trước được làm hoặc không cập nhật nào cả",
    "answer_id": 52202
  },
  {
    "id": 13489,
    "question": "Lựa chọn nào sau đây là chức năng tầng liên kết dữ liệu mà cho phép bên nhận điều khiển lượng dữ liệu sẽ được nhận từ bên gửi?",
    "answer_label": "Điều khiển luồng",
    "answer_id": 52208
  },
  {
    "id": 13490,
    "question": "TCP/IP là một tập hợp được phân tầng của các giao thức truyền thông bao gồm tầng Giao tiếp mạng, tầng Internet, tầng Giao vận, và tầng Ứng dụng. Lựa chọn nào sau đây là một sự kết hợp của các giao thức tầng Giao vận?",
    "answer_label": "TCP, UDP",
    "answer_id": 52213
  },
  {
    "id": 13492,
    "question": "Lựa chọn nào sau đây là một mô tả thích hợp của Giao thức điều khiển truyền (TCP)?",
    "answer_label": "Nó đảm bảo độ tin cậy bằng cách truyền lại các phân đoạn dữ liệu nếu bất kỳ trong chúng bị mất.",
    "answer_id": 52218
  },
  {
    "id": 13493,
    "question": "Trên Internet, đôi khi một người cố tải một trang Web bằng cách chỉ rõ một URL kiểu: http://www.jitec.ipa.go.jp/, trang không thể hiển thị và trang lỗi xuất hiện thay vào đó. Tuy nhiên, người dùng có thể duyệt đúng trang bằng cách chỉ rõ địa chỉ IP kiểu: http://118.151.146.137/. Tầng TCP/IP nào sau đây chịu trách nhiệm về vấn đề này?",
    "answer_label": "Tầng Ứng dụng",
    "answer_id": 52222
  },
  {
    "id": 13494,
    "question": "Lựa chọn nào sau đây là một phương pháp thích hợp của việc xác thực người dùng nhờ dùng một mật khẩu?",
    "answer_label": "Mật khẩu được chuyển đổi thành một giá trị băm và được đăng ký, và mật khẩu được nhập trong quá trình xác thực được chuyển đổi bởi hàm băm và được so sánh",
    "answer_id": 52228
  },
  {
    "id": 13495,
    "question": "Khi phần mềm độc hại mà thực hiện một xâm nhập thành công vào một máy tính giao tiếp với một máy chủ ra-lệnh-và-kiểm-soát trên Internet, lựa chọn nào sau đây là một lý do cho việc sử dụng cổng TCP 80 như là cổng đích cho hầu hết trường hợp?",
    "answer_label": "Vì cổng này được sử dụng để duyệt các trang web, có một xác suất cao mà truyền thông được cho phép bởi tường lửa",
    "answer_id": 52230
  },
  {
    "id": 13496,
    "question": "Lựa chọn nào sau đây là một kỹ thuật mà được phân loại như là kỹ nghệ lừa đảo qua mạng xã hội?",
    "answer_label": "Thu được mật khẩu bằng cách gọi người dùng và giả vờ là một quản trị viên hệ thống",
    "answer_id": 52234
  },
  {
    "id": 13497,
    "question": "Khi ông A, người có một chứng chỉ số, dùng một email để đặt hàng với cửa hàng B, ông ta dùng khóa riêng của mình và ký số email. Cửa hàng B sau đó dùng khóa công khai của ông A để xác nhận chữ ký. Lựa chọn nào sau đây có thể đạt được nhờ dùng phương pháp này? Ở đây, chỉ ông A có thể dùng khóa riêng của mình.",
    "answer_label": "Nó được xác nhận rằng đơn hàng đang đến cửa hàng B là một đơn hàng từ ông A",
    "answer_id": 52239
  },
  {
    "id": 13498,
    "question": "Lựa chọn nào sau đây là một mô tả thích hợp của đánh giá rủi ro?",
    "answer_label": "Thứ tự ưu tiên của ứng phó với rủi ro được xác định bởi kích thước của các rủi ro dựa trên giá trị dự kiến bị mất và xác suất xảy ra",
    "answer_id": 52245
  },
  {
    "id": 13499,
    "question": "Lựa chọn nào sau đây là một mô tả về các biện pháp chống rò rỉ thông tin?",
    "answer_label": "Các nội dung của đĩa cứng của một máy tính xách tay được mã hóa",
    "answer_id": 52248
  },
  {
    "id": 13500,
    "question": "Có một mạng mà được chia thành ba (3) phân đoạn, cụ thể là, phân đoạn bên ngoài, vùng phi quân sự (DMZ), và mạng nội bộ bên trong một (1) tường lửa. Trong mạng, khi một dịch vụ cho người dùng được công bố trên Internet bằng cách sử dụng một hệ thống gồm máy chủ web và máy chủ cơ sở dữ liệu (CSDL) có chứa dữ liệu quan trọng, lựa chọn nào sau đây là phương pháp cài đặt máy chủ thích hợp nhất để bảo vệ dữ liệu quan trọng khỏi việc truy cập trái phép từ Internet? Ở đây, chỉ có một giao thức cụ thể được tường lửa cho phép giao tiếp giữa các phân đoạn bên ngoài và DMZ, và giữa DMZ và mạng nội bộ, và giao tiếp giữa các phân đoạn bên ngoài và mạng nội bộ không được phép.",
    "answer_label": "Máy chủ Web được cài đặt trong DMZ, và máy chủ CSDL được cài đặt trong một mạng bên trong",
    "answer_id": 52253
  },
  {
    "id": 13501,
    "question": "Lựa chọn nào sau đây là một mục tiêu của việc sử dụng một WAF (Tường lửa ứng dụng Web)?",
    "answer_label": "Một tấn công dựa trên một lỗ hổng gây cho một máy chủ Web và một ứng dụng Web bị khóa lại.",
    "answer_id": 52254
  },
  {
    "id": 13502,
    "question": "Lựa chọn nào sau đây là một giải thích của phương pháp so khớp mẫu được sử dụng bởi phần mềm chống virus?",
    "answer_label": "Một virus bị phát hiện thông qua việc so sánh với chữ ký của một virus đã được biết.",
    "answer_id": 52261
  },
  {
    "id": 13503,
    "question": "Lựa chọn nào sau đây có thể được cài đặt với các chức năng của HTTPS (HTTP over SSL/TLS)?",
    "answer_label": "Mã hóa giao tiếp giữa một máy chủ Web và một trình duyệt",
    "answer_id": 52263
  },
  {
    "id": 13504,
    "question": "Theo tiêu chuẩn ISO/IEC 25010 (Hệ thống và công nghệ phần mềm – Hệ thống và Yêu cầu chất lượng phần mềm và Đánh giá (SQuaRE) – Hệ thống và các mô hình chất lượng phần mềm), lựa chọn nào sau đây là một đặc tính chất lượng thích hợp mà có nghĩa là mức độ mà một sản phẩm hoặc hệ thống cung cấp chức năng thỏa mãn các quy định và bao hàm cần thiết khi được sử dụng trong các điều kiện xác định?",
    "answer_label": "Phù hợp chức năng",
    "answer_id": 52266
  },
  {
    "id": 13505,
    "question": "Trong kiểm thử đơn vị, các hoạt động nào sau đây là bộ phận của “kiểm thử hộp trắng”?",
    "answer_label": "Kiểm thử điều kiện",
    "answer_id": 52271
  },
  {
    "id": 13506,
    "question": "Lựa chọn nào sau đây là một cơ chế cho phép một số lớp con có chung lớp cha mẹ được định nghĩa lại cùng một phương pháp với các hành vi khác nhau?",
    "answer_label": "Đa hình",
    "answer_id": 52277
  },
  {
    "id": 13507,
    "question": "Việc kiểm thử tích hợp đối với một phần mềm gồm các mô-đun bố trí theo cấu trúc phân cấp được tiến hành từ một mô-đun cấp thấp. Trong trường hợp đó, lựa chọn nào sau đây là mô đun kiểm thử được dùng thay thế cho một mô-đun cấp cao hơn?",
    "answer_label": "Phần mềm điều khiển",
    "answer_id": 52278
  },
  {
    "id": 13508,
    "question": "Mẫu thiết kế có cấu trúc nào sau đây cho phép các lớp có giao diện không tương thích làm việc với nhau và điều đó có thể thực hiện được trong cả hai dạng sơ đồ dưới đây?\n![](https://learn.viblo.asia/uploads/5/4/547d392a-d55c-4264-b697-1ad7934601c1.jpg)",
    "answer_label": "Adapter",
    "answer_id": 52282
  },
  {
    "id": 13509,
    "question": "Thuật ngữ nào sau đây chỉ tiến trình tạo ra một sơ đồ lớp của UML từ một chương trình?",
    "answer_label": "Kỹ thuật đảo ngược",
    "answer_id": 52289
  },
  {
    "id": 13510,
    "question": "Lựa chọn nào sau đây là một hành động được thực hiện trong quá trình tạo cấu trúc phân chia công việc (WBS) quá trình tạo trong việc quản lý phạm vi quản lý?",
    "answer_label": "Chia nhỏ công việc theo thứ bậc",
    "answer_id": 52293
  },
  {
    "id": 13511,
    "question": "Biểu đồ mũi tên dưới đây cho thấy kế hoạch ban đầu của một dự án.\n![](https://learn.viblo.asia/uploads/3/a/3af3c046-c209-4f79-9137-cdf0addbe514.jpg)",
    "answer_label": "Ngày hoàn thành dự án không được sớm hơn cũng không bị chậm đi",
    "answer_id": 52297
  },
  {
    "id": 13512,
    "question": "Một công ty đang lập kế hoạch phát triển công việc A. Người phát triển thứ nhất có thể thực hiện công việc này một mình trong 10 ngày. Hơn nữa, người phát triển thứ nhất có thể thực hiện công việc này trong 6 ngày với người phát triển thứ hai. Vậy người phát triển thứ hai cần bao nhiêu ngày để thực hiện công việc này một mình? Ở đây, vì phải giao tiếp, nên hiệu quả công việc của mỗi người phát triển bị giảm 10% và phần thập phân được làm tròn.",
    "answer_label": "12",
    "answer_id": 52300
  },
  {
    "id": 13513,
    "question": "Lựa chọn nào sau đây là câu mô tả phù hợp nhất về sự khác biệt giữa COCOMO trung gian và COCOMO II?",
    "answer_label": "COCOMO trung gian gồm một mô hình tổng thể dựa trên các dòng lệnh, còn COCOMO II  gồm ba mô hình khác nhau, tùy thuộc vào kiến thức đã có về sản phẩm sẽ xây dựng",
    "answer_id": 52302
  },
  {
    "id": 13514,
    "question": "Theo tiêu chuẩn ISO/IEC 20000-1 (công nghệ thông tin - Quản lý dịch vụ -  Phần 1: Các yêu cầu của Hệ thống quản lý dịch vụ), lựa chọn nào sau đây là mô tả phù hợp về quản lý vấn đề?",
    "answer_label": "Đó là một quy trình được dùng để xác định nguyên nhân chính của sự cố, giảm thiểu các tác động tiêu cực của sự cố, và ngăn chặn nó xảy ra lần nữa",
    "answer_id": 52307
  },
  {
    "id": 13515,
    "question": "Thuật ngữ nào sau đây chỉ lượng giao dịch dữ liệu có thể chấp nhận mất mát sau khi thời gian chết xảy ra?",
    "answer_label": "Mục tiêu điểm phục hồi (RPO)",
    "answer_id": 52311
  },
  {
    "id": 13516,
    "question": "Trong các Thư viện hạ tầng cơ sở công nghệ thông tin (ITIL), việc hạ thấp chỉ tiêu về tính duy trì đưa ra như một ví dụ về chỉ số thực hiện chính (KPI) đối với việc quản lý sự hiện hữu. Lựa chọn nào sau đây tương ứng với chỉ số này?",
    "answer_label": "Thời gian trung bình để khôi phục dịch vụ",
    "answer_id": 52316
  },
  {
    "id": 13517,
    "question": "Trong số các mục mà kiểm toán viên hệ thống ghi vào báo cáo kiểm toán, lựa chọn nào sau đây trệch khỏi phạm vi công việc của kiểm toán viên?",
    "answer_label": "Ra lệnh cải tiến",
    "answer_id": 52319
  },
  {
    "id": 13518,
    "question": "Khi kiểm toán việc quản lý tài sản phần mềm, điểm nào sau đây là điểm thích hợp nhất cần được kiểm tra?",
    "answer_label": "Kiểm tra xem các chứng từ, như giấy phép phần mềm, có còn hợp thức không",
    "answer_id": 52323
  },
  {
    "id": 13519,
    "question": "Lựa chọn nào sau đây là đối tượng kiểm toán hệ thống nhằm đánh giá và kiểm tra việc kiểm soát nội bộ liên quan đến CNTT?",
    "answer_label": "Các phương pháp nhằm đảm bảo tính chính xác trong các quy trình đầu vào và cập nhật cơ sở dữ liệu do bộ phận bán hàng thực hiện",
    "answer_id": 52326
  },
  {
    "id": 13520,
    "question": "Lựa chọn nào sau đây là một trình tự hợp lý của thủ tục lập mô hình kinh doanh?\n\tA.\tGắn quy trình nghiệp vụ với một tổ chức hiện tại\n\tB.\tLàm rõ quy trình nghiệp vụ\n\tC.\tGắn quy trình nghiệp vụ với một hệ thống thông tin\n\tD.\tLàm rõ lớp dữ liệu (mô hình thông tin)\n\tE.\tGắn quy trình nghiệp vụ với một lớp dữ liệu",
    "answer_label": "B → D → E → C → A",
    "answer_id": 52331
  },
  {
    "id": 13521,
    "question": "Lựa chọn nào sau đây là một mô tả thích hợp về điện toán đám mây?",
    "answer_label": "Đó là một mô hình cho phép việc truy cập phổ biến, thuận tiện, theo yêu cầu vào một vùng chia sẻ chứa các tài nguyên máy tính có thể cấu hình được",
    "answer_id": 52336
  },
  {
    "id": 13522,
    "question": "Lựa chọn nào sau đây gồm các tầng được quản lý bởi nhà cung cấp khi sử dụng IaaS?",
    "answer_label": "Ảo hóa, Các máy phục vụ, Lưu trữ, Kết nối mạng",
    "answer_id": 52341
  },
  {
    "id": 13523,
    "question": "Lựa chọn nào sau đây là công việc được thực hiện khi xác định các yêu cầu không liên quan đến chức năng?",
    "answer_label": "Tạo ra các tiêu chí và tiêu chuẩn phát triển dựa trên ngôn ngữ lập trình được sử dụng trong phát triển hệ thống",
    "answer_id": 52343
  },
  {
    "id": 13524,
    "question": "Lựa chọn nào sau đây là một lời giải thích hợp lý về sản phẩm dấu hỏi (?) trong ma trận quản lý danh mục sản phẩm (PPM)?",
    "answer_label": "Nó cần đầu tư đáng kể để nuôi dưỡng do tỷ lệ thị phần nhỏ và tốc độ tăng trưởng thị trường cao",
    "answer_id": 52348
  },
  {
    "id": 13525,
    "question": "Một công ty may mặc và bán hàng được đánh giá bằng cách phân tích chuỗi giá trị. Khi phân loại các hoạt động trong công ty thành nội vụ, sản xuất, ngoại vụ, bán hàng/ tiếp thị, và các dịch vụ, lựa chọn nào sau đây được phân loại như là các hoạt động nội vụ?",
    "answer_label": "Hoạt động đặt hàng nguyên liệu, thanh tra và quản lý hàng tồn kho",
    "answer_id": 52351
  },
  {
    "id": 13526,
    "question": "Lựa chọn nào sau đây là phương pháp thiết lập giá dựa trên việc định giá cộng thêm vào chi phí?",
    "answer_label": "Trên cơ sở chi phí sản xuất và chi phí vận hành, giá cả được thiết lập bằng cách kết hợp biên lợi nhuận mong muốn.",
    "answer_id": 52355
  },
  {
    "id": 13527,
    "question": "Lựa chọn nào sau đây là giải thích về phương tiện huy động thông tin từ khách hàng (CGM)?",
    "answer_label": "Nó cho phép phân phối nội dung số do cá nhân người đọc tạo ra, và chia sẻ nội dung đó giữa các người dùng.",
    "answer_id": 52359
  },
  {
    "id": 13528,
    "question": "Lựa chọn nào sau đây là lời giải thích về sàn giao dịch điện tử?",
    "answer_label": "Đó là một phương pháp mà trong đó nhiều người bán và người mua gặp nhau ở chợ được thiết lập trên Internet và mua bán trực tiếp không qua phân phối trung gian",
    "answer_id": 52362
  },
  {
    "id": 13529,
    "question": "Lựa chọn nào sau đây là lời giải thích về lưới thông minh?",
    "answer_label": "Đó là một hệ thống nhằm sử dụng năng lượng có thể tái chế, cung ứng nguồn điện ổn định, và điều chỉnh nhu cầu tối ưu thông qua kiểm soát tích hợp việc phát điện và tiêu thụ điện dựa trên công nghệ truyền thông và xử lý thông tin.",
    "answer_id": 52366
  },
  {
    "id": 13530,
    "question": "Sản phẩm A, B, C và D là được giới thiệu ra thị trường. Bảng dưới đây cho thấy lợi nhuận dự kiến cho từng sản phẩm với ba (3) dự báo bán hàng (cao, trung bình, và thấp) ước tính sẽ xảy ra với xác suất trong bảng. Sản phẩm nào sau đây là sản phẩm được kỳ vọng sẽ có lợi nhuận cao nhất theo nguyên tắc giá trị kỳ vọng?\n![](https://learn.viblo.asia/uploads/6/6/6623b63a-0737-44be-9ba1-fc13a596bb16.jpg)",
    "answer_label": "B",
    "answer_id": 52371
  },
  {
    "id": 13531,
    "question": "Lựa chọn nào sau đây là một biểu đồ Pareto thích hợp?",
    "answer_label": "![](https://learn.viblo.asia/uploads/0/6/06cfbb5c-9f1e-4d56-a3ad-f27d00cf7f4d.jpg)",
    "answer_id": 52375
  },
  {
    "id": 13532,
    "question": "Với số lượng chuyển sang từ tháng trước và số lượng giao dịch hàng tồn kho của một sản phẩm được thể hiện như trong bảng dưới đây, đơn giá sản phẩm cho giai đoạn tiếp theo tính theo phương pháp bình quân định kỳ là bao nhiêu?\n![](https://learn.viblo.asia/uploads/3/4/3452adb0-7bb2-4375-9b90-371d0b6df204.jpg)",
    "answer_label": "65,00",
    "answer_id": 52379
  },
  {
    "id": 13533,
    "question": "Báo cáo kiểm kê kho của Công ty Bất động sản Build-Up mô tả tình trạng tồn kho từ đầu năm 2014. Nếu công ty này sử dụng phương pháp vào trước - ra trước (FIFO) để định giá tài sản kiểm kê, thì giá trị hàng tồn kho vào cuối năm 2014 là bao nhiêu?\n![](https://learn.viblo.asia/uploads/8/9/894ea5cb-299c-4957-911d-b0be1372b4eb.jpg)",
    "answer_label": "7600",
    "answer_id": 52383
  },
  {
    "id": 13534,
    "question": "Một công ty có kế hoạch cung cấp một sản phẩm với chi phí cố định là 128.000 đôla, chi phí biến đổi trên một đơn vị sản phẩm là 48 đôla, và giá bán mỗi đơn vị sản phẩm là 80 đô. Vậy điểm hòa vốn là bao nhiêu?",
    "answer_label": "320.000",
    "answer_id": 52387
  },
  {
    "id": 13535,
    "question": "Lựa chọn nào sau đây là một hành vi phạm tội liên quan đến virus máy tính theo Công ước về tội phạm công nghệ?",
    "answer_label": "Một người tìm thấy virus của một người lạ, lưu trữ virus đó nhằm mục đích sau này có thể chạy nó trên máy tính của người khác",
    "answer_id": 52392
  },
  {
    "id": 13536,
    "question": "Điều nào sau đây phải được khách hàng chấp thuận khi thiết kế bên ngoài của một hệ thống được hoàn thành?",
    "answer_label": "Bố trí màn hình",
    "answer_id": 52396
  },
  {
    "id": 13537,
    "question": "Lựa chọn nào sau đây là sự kết hợp thích hợp của các khái niệm cơ bản về hướng đối tượng?",
    "answer_label": "Trừu tượng, đóng gói, kế thừa, lớp",
    "answer_id": 52398
  },
  {
    "id": 13538,
    "question": "Để tăng tính độc lập mô đun, mức độ khớp nối mô đun phải thấp. Phương pháp trao đổi thông tin giữa các mô đun nào sau đây có mức khớp nối mô đun thấp nhất?",
    "answer_label": "Chỉ các mục dữ liệu cần thiết cho đầu vào và đầu ra được truyền như là đối số giữa các mô-đun",
    "answer_id": 52403
  },
  {
    "id": 13539,
    "question": "Kiểm thử tích hợp cho phần mềm gồm các mô-đun được sắp xếp theo cấu trúc phân cấp được thực hiện từ một mô-đun cấp cao. Trong trường hợp như vậy, lựa chọn nào sau đây là một mô đun kiểm thử được sử dụng thay thế cho một mô-đun cấp thấp?",
    "answer_label": "Stub",
    "answer_id": 52409
  },
  {
    "id": 13540,
    "question": "Phương pháp nào dưới đây là phương pháp sử dụng công cụ mô hình hóa để tạo ra một tài liệu thiết kế được mô tả với sơ đồ E-R hoặc các biểu diễn khác từ thông tin định nghĩa trong cơ sở dữ liệu hoạt động?",
    "answer_label": "Kỹ nghệ ngược",
    "answer_id": 52412
  },
  {
    "id": 13541,
    "question": "Lựa chọn nào sau đây là mô tả thích hợp về Ma trận Phân công Trách nhiệm được sử dụng cho quản lý nguồn nhân lực dự án?",
    "answer_label": "Phân bổ gói công việc cho những người chịu trách nhiệm về công việc dự án.",
    "answer_id": 52415
  },
  {
    "id": 13542,
    "question": "Cấu trúc nào sau đây mô tả mối quan hệ giữa hoạt động dự án và các đơn vị của dự án sẽ thực hiện các hoạt động đó?",
    "answer_label": "Cấu trúc phân loại tổ chức",
    "answer_id": 52418
  },
  {
    "id": 13543,
    "question": "Theo Hướng dẫn của PMBOK - Ấn bản lần thứ 5, lựa chọn nào sau đây là một định nghĩa thích hợp của một bên liên quan đến dự án?",
    "answer_label": "Một cá nhân, nhóm hoặc tổ chức có thể ảnh hưởng, bị ảnh hưởng hoặc nhận thấy bản thân bị ảnh hưởng bởi quyết định, hoạt động hoặc kết quả của một dự án.",
    "answer_id": 52423
  },
  {
    "id": 13544,
    "question": "Lựa chọn nào sau đây là giải thích thích hợp về phương pháp Điểm chức năng được sử dụng để dự toán phát triển hệ thống?",
    "answer_label": "Nó là một phương pháp để ước lượng quy mô của một hệ thống mà các chức năng của hệ thống được đo bằng số bằng cách sử dụng các phần tử như số lượng các mục nhập xuất dữ liệu và số lượng các tệp tin, và một điều chỉnh được thực hiện trên cơ sở độ phức tạp và đặc điểm riêng của ứng dụng.",
    "answer_id": 52429
  },
  {
    "id": 13545,
    "question": "Theo ITIL ấn bản 2011, điều nào sau đây là một giai đoạn thích hợp của vòng đời dịch vụ mà một nhà cung cấp dịch vụ xây dựng và triển khai các dịch vụ mới hoặc dịch vụ được sửa đổi?",
    "answer_label": "Chuyển tiếp dịch vụ",
    "answer_id": 52433
  },
  {
    "id": 13546,
    "question": "ISO/IEC 20000-1:2011 đòi hỏi phải áp dụng phương pháp được gọi là “Plan-Do-Check-Act” (PDCA) cho tất cả các phần của Hệ thống Quản lý Dịch vụ (SMS) và các dịch vụ. Lựa chọn nào sau đây là hoạt động bao gồm kế hoạch trong SMS?",
    "answer_label": "Tạo ra khuôn khổ quyền, trách nhiệm và vai trò quy trình",
    "answer_id": 52435
  },
  {
    "id": 13547,
    "question": "Theo ISO/IEC 20000-1:2011, đáp án nào sau đây là quy trình kiểm soát bao gồm xác định, kiểm soát, ghi chép, theo dõi, báo cáo và xác minh CI và quản lý thông tin CI trong CMDB?",
    "answer_label": "Quản lý cấu hình",
    "answer_id": 52440
  },
  {
    "id": 13548,
    "question": "Điều nào sau đây là mục đích thích hợp nhất mà một kiểm định viên hệ thống trao đổi ý kiến với một bộ phận kiểm toán liên quan đến phiên bản dự thảo báo cáo kiểm toán?",
    "answer_label": "Để xác nhận rằng không có lỗi thực tế trong các phát hiện và kiến nghị được mô tả trong báo cáo kiểm toán.",
    "answer_id": 52442
  },
  {
    "id": 13549,
    "question": "Điểm nào sau đây là điểm kiểm tra để kiểm toán sự kiểm soát của nguy cơ rò rỉ thông tin, giả mạo, và sử dụng trái phép tài liệu liên quan đến một hệ thống?",
    "answer_label": "Thực hiện các biện pháp bảo đảm tính bí mật của tài liệu",
    "answer_id": 52448
  },
  {
    "id": 13550,
    "question": "Điều nào sau đây là mô tả thích hợp liên quan đến việc thực hiện kiểm toán hệ thống?",
    "answer_label": "Để người yêu cầu kiểm toán ban hành các hướng dẫn cải tiến trên cơ sở báo cáo kiểm toán, kiểm toán viên hệ thống báo cáo kết quả kiểm toán cho người yêu cầu kiểm toán.",
    "answer_id": 52451
  },
  {
    "id": 13551,
    "question": "Lựa chọn nào sau đây là kỹ thuật được sử dụng để thực hiện phân bổ nguồn lực tối ưu cho đầu tư máy tính hóa trong từng loại được phân loại dựa trên những điểm tương đồng về rủi ro và giá trị đầu tư?",
    "answer_label": "Danh mục CNTT",
    "answer_id": 52457
  },
  {
    "id": 13552,
    "question": "Lựa chọn nào sau đây đại diện cho một phần của tổng chi phí sở hữu (TCO) cho Phần mềm như một dịch vụ (SaaS)?",
    "answer_label": "Chi phí di chuyển dữ liệu",
    "answer_id": 52459
  },
  {
    "id": 13553,
    "question": "Lựa chọn nào sau đây là một biện pháp để đánh giá rủi ro của việc giảm chất lượng bảo trì và vận hành hệ thống trong quá trình gia công phần mềm của một dịch vụ CNTT?",
    "answer_label": "Các hoạt động cải tiến chất lượng dịch vụ được tiến hành bằng cách đồng ý với mức chất lượng mong muốn với nhà thầu phụ bằng cách sử dụng các chỉ số chứng minh chất lượng dịch vụ.",
    "answer_id": 52465
  },
  {
    "id": 13554,
    "question": "Lựa chọn nào sau đây là đặc điểm của dịch vụ lưu trữ?",
    "answer_label": "Quyền sử dụng của một máy chủ do một nhà cung cấp dịch vụ chuẩn bị được cung cấp cho người sử dụng.",
    "answer_id": 52468
  },
  {
    "id": 13555,
    "question": "Lựa chọn nào sau đây là lời giải thích cho BYOD (Mang thiết bị của riêng bạn)?",
    "answer_label": "Sử dụng các thiết bị thông tin riêng của nhân viên để làm việc",
    "answer_id": 52472
  },
  {
    "id": 13556,
    "question": "Công việc nào sau đây được thực hiện khi các yêu cầu phi chức năng được xác định?",
    "answer_label": "Tạo ra các yêu cầu kỹ thuật cho các tiêu chí và tiêu chuẩn phát triển theo ngôn ngữ lập trình được sử dụng trong phát triển hệ thống",
    "answer_id": 52476
  },
  {
    "id": 13557,
    "question": "Lựa chọn nào sau đây giải thích về khoảng cách số?",
    "answer_label": "Nó đề cập đến khoảng cách kinh tế hoặc xã hội xảy ra do sự khác biệt về khả năng và cơ hội khi sử dụng máy tính và mạng truyền thông.",
    "answer_id": 52478
  },
  {
    "id": 13558,
    "question": "Lựa chọn nào sau đây là mục đích phân tích kế hoạch kinh doanh và lợi thế cạnh tranh thông qua quản lý danh mục đầu tư sử dụng ma trận thể hiện trong hình?\n![](https://learn.viblo.asia/uploads/d/6/d6f0a943-0358-4d18-a08b-d3f7c98b800c.jpg)",
    "answer_label": "Để đánh giá vị trí kinh doanh của công ty làm cơ sở cho việc đặt ra một mục tiêu và ưu tiên phân bổ nguồn lực",
    "answer_id": 52485
  },
  {
    "id": 13559,
    "question": "Lựa chọn nào sau đây giải thích về năng lực cốt lõi?",
    "answer_label": "Khả năng vượt trội mà không thể bắt chước bởi các đối thủ cạnh tranh trong một lĩnh vực hoạt động của công ty",
    "answer_id": 52488
  },
  {
    "id": 13560,
    "question": "Lựa chọn nào sau đây là chiến lược cơ bản của một ngách trong vị thế cạnh tranh?",
    "answer_label": "Chiến lược chuyên môn nhằm vào sự chuyên môn hóa của sản phẩm và thị trường",
    "answer_id": 52493
  },
  {
    "id": 13561,
    "question": "Hình dưới đây là thủ tục làm việc của MRP (Material Requirements Planning), một kỹ thuật của một hệ thống quản lý sản xuất. Những thông tin nào sau đây được chèn vào A trong hình bên dưới là cần thiết để tính các yêu cầu ròng?\n\n![](https://learn.viblo.asia/uploads/b/6/b601609d-5998-4bac-a152-ad8011f0d396.jpg)",
    "answer_label": "Trạng thái tồn kho (lượng hàng tồn kho, đơn hàng còn lại, số lượng trong quá trình sản xuất)",
    "answer_id": 52495
  },
  {
    "id": 13562,
    "question": "Lựa chọn nào sau đây mô tả một hệ thống RFID?",
    "answer_label": "Đầu đọc/ghi RF tạo ra một trường điện từ cấp điện cho thẻ RF trong phạm vi cho phép truyền tải thông tin",
    "answer_id": 52499
  },
  {
    "id": 13563,
    "question": "Lựa chọn nào sau đây là một tổ chức quản lý tạo ra một nhóm chức năng chéo giữa dự án và các tổ chức chức năng để linh hoạt đáp ứng với những thay đổi trong môi trường kinh doanh?",
    "answer_label": "Tổ chức ma trận",
    "answer_id": 52504
  },
  {
    "id": 13564,
    "question": "Lựa chọn nào sau đây là vai trò thích hợp của người hướng dẫn trong cuộc họp?",
    "answer_label": "Khuyến khích những người tham gia cuộc họp đưa ra nhận xét và tổ chức luồng các cuộc thảo luận từ một vị trí trung lập và vô tư",
    "answer_id": 52507
  },
  {
    "id": 13565,
    "question": "Lựa chọn nào sau đây là một lời giải thích cho sơ đồ tương đồng?",
    "answer_label": "Đó là một phương pháp thu thập thông tin được thu thập trên cơ sở mối quan hệ lẫn nhau, và những vấn đề cần giải quyết được làm rõ.",
    "answer_id": 52512
  },
  {
    "id": 13566,
    "question": "Lựa chọn nào sau đây là một ví dụ của CNTT Xanh?",
    "answer_label": "Sử dụng hội thảo qua web thay vì di chuyển để gặp nhau",
    "answer_id": 52517
  },
  {
    "id": 13567,
    "question": "Một nhà máy đã ghi lại số lần xuất hiện của sản phẩm bị lỗi theo nguyên nhân của khiếm khuyết. Dựa trên bản ghi này, biểu đồ nào sau đây là biểu đồ Pareto cho thấy các nguyên nhân hàng đầu của sự cố sản phẩm bị lỗi và tổng số phần trăm tích lũy?",
    "answer_label": "![](https://learn.viblo.asia/uploads/1/d/1dc36a97-657c-4ef1-95c1-a166405eaeeb.jpg)",
    "answer_id": 52518
  },
  {
    "id": 13568,
    "question": "Công ty A đặt mục tiêu kiếm được khoản lợi nhuận 36.000 đô la Mỹ theo các điều kiện được trình bày trong bảng dưới đây. Doanh thu bán hàng tối thiểu cho công ty để đạt được mục tiêu của nó là gì?\n![](https://learn.viblo.asia/uploads/5/a/5a5d8066-5183-4fdd-b1d0-add47f8d8d8f.jpg)",
    "answer_label": "260.000",
    "answer_id": 52525
  },
  {
    "id": 13569,
    "question": "Khi giá đơn vị hàng tồn kho được xác định bằng cách chia tổng số tiền mua cho tổng số lượng hàng đã mua, Lựa chọn nào sau đây là một phương pháp kiểm kê thích hợp được sử dụng?",
    "answer_label": "Phương pháp định kỳ trung bình",
    "answer_id": 52527
  },
  {
    "id": 13570,
    "question": "Lựa chọn nào sau đây là mô tả thích hợp về phạm vi bảo vệ phần mềm theo Hiệp định của WTO về Các khía cạnh liên quan đến Thương mại của Quyền sở hữu trí tuệ (TRIPS)?",
    "answer_label": "Cả chương trình nguồn và các chương trình đối tượng được bảo vệ.",
    "answer_id": 52532
  },
  {
    "id": 13848,
    "question": "Với một số nhị phân 8-bit, phương án nào sau đây sẽ biến đổi 4 bit ở giữa thành 1 và đảo ngược các bit còn lại?",
    "answer_label": "Thực hiện phép NAND trên từng bit với 11000011",
    "answer_id": 53643
  },
  {
    "id": 13849,
    "question": "Phương án nào dưới đây tương ứng logic với biểu thức sau? Ở đây A, B, C, và D là các số nguyên, ‘<’ là phép so sánh nhỏ hơn, và ‘≤’ là phép so sánh nhỏ hơn hoặc bằng.\n\nnot ((A ≤ B) or (C < D))",
    "answer_label": "(B < A) and (D ≤ C)",
    "answer_id": 53648
  },
  {
    "id": 13850,
    "question": "Có 16 tấm thẻ được đánh số từ 1 đến 16. Khi lựa chọn ra 4 tấm thẻ bất kỳ, phương án nào dưới đây là xác suất để cả 4 tấm thẻ là số lẻ?",
    "answer_label": "1/26",
    "answer_id": 53650
  },
  {
    "id": 13851,
    "question": "Khi hai tập hợp A và B có lực lượng 3 và 2, có bao nhiêu ánh xạ từ A sang B?",
    "answer_label": "6",
    "answer_id": 53656
  },
  {
    "id": 13852,
    "question": "Biểu thức dưới đây được ghi bằng ký hiệu tiền tố (ký pháp Ba Lan đảo ngược). Đâu là giá trị của biểu thức?  Ở đây, các số được biểu diễn trong hệ thập phân, các ký hiệu ‘+’, ‘−’, ‘*’, và ‘/’ biểu diễn phép công, trừ, nhân và chia.\n\n    100 5 6 2 + * 12 4 / − − 36 −",
    "answer_label": "27",
    "answer_id": 53660
  },
  {
    "id": 13853,
    "question": "Trong cây nhị phân phía dưới, đâu là vị trí của nút mới có giá trị 17? Ở đây, mỗi vòng tròn biểu hiện một nút của cây và con số bên trong biểu thị giá trị của chúng.\n![](https://learn.viblo.asia/uploads/6/f/6f9b03a2-ac43-472a-8122-0e82774394ed.png)",
    "answer_label": "Nút con bên trái của 18",
    "answer_id": 53663
  },
  {
    "id": 13854,
    "question": "Phương án nào dưới đây là kết quả của lưu đồ thuật toán phía dưới?\n![](https://learn.viblo.asia/uploads/7/3/73182557-6486-4860-9476-949295267ed6.png)",
    "answer_label": "10  8  6  4  2  0",
    "answer_id": 53668
  },
  {
    "id": 13855,
    "question": "Với một mảng số nguyên hai chiều a, với a(i, j) có giá trị 2i + j, phương án nào là giá trị của a(a(1,1) × 2, a(2, 2) + 1)?",
    "answer_label": "15",
    "answer_id": 53673
  },
  {
    "id": 13856,
    "question": "Một hàm đệ quy f (n) được định nghĩa phía dưới cho mọi số tự nhiên n. Phương án nào là giá trị của f (5)?\n![](https://learn.viblo.asia/uploads/e/1/e1302a80-94f6-4b82-999a-734ae32bff85.png)",
    "answer_label": "15",
    "answer_id": 53676
  },
  {
    "id": 13857,
    "question": "Lựa chọn nào sau đây là phương thức đánh địa chỉ mà lệnh chứa địa chỉ đó và địa chỉ đó được thay đổi bởi giá trị từ thanh ghi khác?",
    "answer_label": "Phương thức đánh địa chỉ chỉ số",
    "answer_id": 53679
  },
  {
    "id": 13858,
    "question": "Phương án nào dưới đây là kiến trúc máy tính có bộ xử lý thực hiện nhiều luồng lệnh và nhiều luồng dữ liệu song song?",
    "answer_label": "MIMD",
    "answer_id": 53682
  },
  {
    "id": 13859,
    "question": "Phương án nào dưới đây là một giải thích thích hợp về việc chèn bộ nhớ?",
    "answer_label": "Nó cho phép CPU truy cập các băng của bộ nhớ chính đồng thời",
    "answer_id": 53686
  },
  {
    "id": 13860,
    "question": "Phương án nào sau đây thích hợp với vai trò của một bộ điều khiển thiết bị (device driver)?",
    "answer_label": "Nó trực tiếp quản lý phần cứng theo các yêu cầu từ chương trình ứng dụng.",
    "answer_id": 53691
  },
  {
    "id": 13861,
    "question": "Phương án nào dưới đây là từ thích hợp để mô tả hiện tượng khi các tệp được tạo ra trong quá trình lưu tệp nằm rải rác tại những phần khác nhau trên toàn bộ đĩa cứng chứ không liên tục trên các liên cung?",
    "answer_label": "Phân mảnh",
    "answer_id": 53695
  },
  {
    "id": 13862,
    "question": "Phương án nào sau đây là lời giải thích hợp lý về điện toán lưới?",
    "answer_label": "Một tác vụ tính toán được phân chia cho một số máy tính trong mạng để đạt được năng lực tính toán cần thiết.",
    "answer_id": 53698
  },
  {
    "id": 13863,
    "question": "Xem xét một hệ thống RAID 0 (tức là, phân chia cấp độ khối, không sử dụng chẵn lẻ hoặc phản chiếu) với hai đĩa; Khi dữ liệu được phân bố đều trên hai đĩa và cả hai đĩa đều có tỷ lệ lỗi là 0,1% thì tỷ lệ lỗi chung của hệ thống RAID là bao nhiêu? Ở đây, tỷ lệ thất bại tổng thể đề cập đến xác suất mà hệ thống không thể lấy được dữ liệu từ một trong hai đĩa.",
    "answer_label": "0.1999",
    "answer_id": 53704
  },
  {
    "id": 13864,
    "question": "Lựa chọn nào sau đây là mô tả thích hợp liên quan đến MTBF và MTTR?",
    "answer_label": "MTBF của một hệ thống tăng lên thông qua bảo trì dự phòng.",
    "answer_id": 53708
  },
  {
    "id": 13865,
    "question": "Round robin (với thời gian phân bổ 3 giây) được sử dụng làm phương pháp lập lịch cho ba tiến trình theo thứ tự P1, P2, và P3, thể hiện trong bảng dưới đây. Tổng thời gian chờ đợi (tính bằng giây) của P3 trước khi nó được thực hiện hoàn chỉnh là bao nhiêu? Ở đây, thời gian tới là thời gian mà tại đó một tiến trình nhập vào hàng đợi sẵn sàng.\n\n![](https://learn.viblo.asia/uploads/0/b/0bf2ac12-ef40-497c-a7ad-99bb240c322b.png)",
    "answer_label": "35",
    "answer_id": 53710
  },
  {
    "id": 13866,
    "question": "Trong việc quản lý bộ nhớ ảo, phương pháp thay thế trang nào sau đây sẽ thay thế trang đã chiếm nhiều thời gian nhất kể từ lần sử dụng cuối cùng?",
    "answer_label": "LRU",
    "answer_id": 53717
  },
  {
    "id": 13867,
    "question": "Các phương pháp biểu diễn kết quả phân tích cú pháp trong trình biên dịch có định dạng bộ tứ.\n(Toán tử, Toán hạng 1, Toán hạng 2, Kết quả)\nĐịnh dạng này chỉ ra việc áp dụng Toán tử đối với Toán hạng 1 và Toán hạng 2 để cho ra Kết quả. Biểu thức nào sau đây là kết quả của chuỗi bộ tứ biểu diễn cho việc phân tích cú pháp? Ở đây, T1, T2, và T3 chỉ ra các biến tạm thời.\n\n\t\t\t(*,B,C,T1 )\n\t\t\t(/,T1 ,D,T2 )\n\t\t\t(+,A,T2 ,T3 )",
    "answer_label": "A+B*C/D",
    "answer_id": 53718
  },
  {
    "id": 13868,
    "question": "Công ty ABC áp dụng chính sách sao lưu ba thế hệ. Hệ thống của công ty ABC tự động thực hiện sao lưu toàn bộ vào ngày 10, 17 và 25 của mỗi tháng. Nếu bản sao lưu gần nhất được thực hiện vào ngày 17 tháng 9, đâu là ngày thông tin cũ nhất được sao lưu?",
    "answer_label": "25 tháng 8",
    "answer_id": 53723
  },
  {
    "id": 13869,
    "question": "Phương án nào dưới đây là một phương pháp thực hiện việc tích hợp các mô-đun cấu hình một chương trình trong thời gian thực thi chương trình?",
    "answer_label": "Liên kết động",
    "answer_id": 53726
  },
  {
    "id": 13870,
    "question": "Phương án nào dưới đây là đặc điểm của DRAM?",
    "answer_label": "Cấu trúc các ô nhớ đơn giản, vì vậy có thể tích hợp cao để có được mức giá thấp cho mỗi bit",
    "answer_id": 53732
  },
  {
    "id": 13871,
    "question": "Phương án nào sau đây là mạch logic tạo ra “1” là tín hiệu đầu ra Z, chỉ khi tín hiệu đầu vào X và Y có cùng giá trị?\n![](https://learn.viblo.asia/uploads/0/8/08707157-bb53-40ff-b88e-02d56d421ae9.png)",
    "answer_label": "c",
    "answer_id": 53736
  },
  {
    "id": 13872,
    "question": "Mạch nào trong các mạch logic sau đáp ứng các điều kiện được mô tả dưới đây?\n\n[Điều kiện]\nĐèn được bật và tắt bằng cách sử dụng các công tắc A và B ở đầu và cuối cầu thang. Đèn có thể được bật và tắt bằng cách sử dụng một công tắc, bất kể trạng thái của công tắc kia.\n\n![](https://learn.viblo.asia/uploads/6/c/6c8f6f60-31f8-4092-a4d6-227f2ce91d88.png)",
    "answer_label": "XOR",
    "answer_id": 53741
  },
  {
    "id": 13873,
    "question": "Lựa chọn nào sau đây là một lời giải thích thích hợp về việc cắt ghép trong xử lý đồ họa 3D?",
    "answer_label": "Đó là một phương pháp cho phép hoặc vô hiệu hóa một cách có chọn lọc các hoạt động dựng hình trong một vùng xác định.",
    "answer_id": 53742
  },
  {
    "id": 13874,
    "question": "Cơ sở dữ liệu nào sau đây được thiết kế gồm nhiều bảng, với các dòng và các cột liên kết với nhau thông qua việc đối chiếu dữ liệu lưu trữ trong mỗi bảng?",
    "answer_label": "Cơ sở dữ liệu quan hệ",
    "answer_id": 53749
  },
  {
    "id": 13875,
    "question": "Lựa chọn nào sau đây là một lời giải thích hợp lý về giản đồ (schema) trong RDBMS?",
    "answer_label": "Đó là một tập định nghĩa dữ liệu, chẳng hạn như bản chất của dữ liệu, định dạng của dữ liệu, và các mối quan hệ với dữ liệu khác.",
    "answer_id": 53752
  },
  {
    "id": 13876,
    "question": "Lựa chọn nào sau đây là một dạng chuẩn hóa thích hợp (NF) được sử dụng trong cơ sở dữ liệu quan hệ trong đó mỗi thuộc tính không phải là khóa chỉ cần phụ thuộc vào khóa chính, và không có thuộc tính không phải là khóa nào phụ thuộc vào một thuộc tính không phải là khóa?",
    "answer_label": "3NF",
    "answer_id": 53756
  },
  {
    "id": 13877,
    "question": "Trong các giai đoạn thiết kế cơ sở dữ liệu, giai đoạn nào sau đây liên quan đến việc tạo ra một sơ đồ ER?",
    "answer_label": "Giai đoạn thiết kế khái niệm cơ sở dữ liệu",
    "answer_id": 53758
  },
  {
    "id": 13878,
    "question": "Câu lệnh SQL nào sau đây đối với bảng \"ShipmentRecord\" cho giá trị lớn nhất?\n![](https://learn.viblo.asia/uploads/b/f/bfa5b2a9-3b6f-4fbd-b063-cf4b59a56eae.png)",
    "answer_label": "SELECT COUNT(*) FROM ShipmentRecord",
    "answer_id": 53763
  },
  {
    "id": 13879,
    "question": "Lựa chọn nào sau đây là một địa chỉ IP định tuyến trên mạng Internet?",
    "answer_label": "172.40.77.4",
    "answer_id": 53767
  },
  {
    "id": 13880,
    "question": "Trong bảy tầng của mô hình tham chiếu cơ bản OSI, tầng nào chịu trách nhiệm chuyển tiếp các gói tin, bao gồm việc định tuyến chúng qua các router trung gian?",
    "answer_label": "Tầng mạng",
    "answer_id": 53771
  },
  {
    "id": 13881,
    "question": "Trong một mạng IPv4, lựa chọn nào sau đây là tổ hợp đúng của một lớp địa chỉ IP, dải địa chỉ IP của nó, và một subnet mask?\n\n![](https://learn.viblo.asia/uploads/e/b/eb34b01f-9b61-4d5b-8d1f-9d49c232b8bd.png)",
    "answer_label": "b",
    "answer_id": 53775
  },
  {
    "id": 13882,
    "question": "Lựa chọn nào sau đây là dịch vụ Internet chuyển một tên miền như www.viblo.asia thành địa chỉ IP tương ứng của nó?",
    "answer_label": "DNS",
    "answer_id": 53779
  },
  {
    "id": 13883,
    "question": "Lựa chọn nào sau đây là một mô tả phù hợp về tiện ích netstat?",
    "answer_label": "Nó hiển thị các kết nối TCP đang hoạt động.",
    "answer_id": 53782
  },
  {
    "id": 13884,
    "question": "Alan muốn gửi một tin nhắn mã hóa cho Bob bằng cách sử dụng phương thức mã hóa không đồng bộ. Lựa chọn nào sau đây phải xảy ra trước khi Alan sẽ gửi tin nhắn mã hóa cho Bob? Ở đây, Alan đã chứng minh với Bob bằng chữ ký kỹ thuật số rằng Alan là người gửi tin nhắn cho Bob.",
    "answer_label": "Bob cung cấp khóa công khai của mình cho Alan.",
    "answer_id": 53789
  },
  {
    "id": 13885,
    "question": "Lựa chọn nào sau đây là một thuật ngữ thích hợp gắn với hành động gian lận mạo danh một người có thẩm quyền?",
    "answer_label": "Giả mạo",
    "answer_id": 53792
  },
  {
    "id": 13886,
    "question": "Một kẻ tấn công gọi tới bàn trợ giúp của công ty, giả mạo là một nhân viên đã bị mất mật khẩu của họ. Nhân viên trợ giúp thiết lập lại mật khẩu thành “password1” mặc định của công ty. Kẻ tấn công sau đó sử dụng mật khẩu này để truy cập vào mạng công ty và thông tin trong máy chủ. Kiểu tấn công này gọi là gì?",
    "answer_label": "Kỹ nghệ xã hội",
    "answer_id": 53797
  },
  {
    "id": 13887,
    "question": "Một cuộc tấn công trung gian xảy ra khi kẻ tấn công chặn đường liên lạc và giả mạo danh tính của một trong hai bên tham gia. Làm thế nào để có thể đề phòng hiệu quả với một cuộc tấn công như vậy?",
    "answer_label": "Có thể đề phòng một cuộc tấn công như vậy bằng việc có sự chứng thực thông qua chữ ký số trước khi chấp nhận khóa công khai của ai đó.",
    "answer_id": 53799
  },
  {
    "id": 13888,
    "question": "Bob và Alice mã hoá mọi cuộc liên lạc của họ với nhau. Do mức độ nhạy cảm cao của các thông tin chia sẻ, họ đã thực hiện một cơ chế mã hóa để bảo mật các thông điệp của mình. Tuy nhiên, vấn đề của việc mã hóa này là Bob hay Alice không thể chắc chắn 100% rằng họ đang giao tiếp với nhau, họ cũng không thể chắc chắn 100% về sự toàn vẹn của nội dung các thông điệp. Phương pháp mã hóa nào sau đây là phương pháp mà Bob và Alice sử dụng?",
    "answer_label": "Mật mã sổ tay dùng một lần",
    "answer_id": 53804
  },
  {
    "id": 13889,
    "question": "Một người dùng mới nhận được một tập tin có tên “image.jpg”. Khi kiểm tra chặt chẽ hơn, hóa ra tên tập tin thực sự là “image.jpg            .exe”, với các khoảng trống ở giữa hậu tố giả là .jpg và hậu tố thực là .exe. Thuật ngữ nào sau đây được dùng thích hợp nhất để mô tả kiểu tấn công này",
    "answer_label": "Trojan horse",
    "answer_id": 53807
  },
  {
    "id": 13890,
    "question": "Một hệ thống sao lưu dữ liệu phải hỗ trợ khôi phục mọi giao dịch cho đến thời điểm 5 phút trước khi thảm họa xảy ra. Đây là kiểu mục tiêu gì?",
    "answer_label": "Mục tiêu về thời điểm khôi phục",
    "answer_id": 53811
  },
  {
    "id": 13891,
    "question": "Lựa chọn nào sau đây là một kiểm thử thích hợp để xác minh tính hiệu quả của các biện pháp an ninh bằng cách thử xâm nhập vào?",
    "answer_label": "Kiểm thử thâm nhập",
    "answer_id": 53816
  },
  {
    "id": 13892,
    "question": "Lựa chọn nào sau đây là một phương pháp thích hợp để ngăn chặn tấn công tràn bộ đệm?",
    "answer_label": "Thực hiện việc kiểm tra ranh giới trên mọi biến chuỗi trong chương trình để khẳng định rằng chiều dài của chuỗi đầu vào không vượt quá kích thước của biến đích",
    "answer_id": 53821
  },
  {
    "id": 13893,
    "question": "Các công ty thường cung cấp phương tiện cho lực lượng lao động di động của họ để truy cập vào mạng công ty một cách an toàn trên Internet thông qua các kênh không an toàn như mạng không dây mở tại khách sạn hoặc quán cà phê. Lựa chọn nào sau đây là công nghệ thích hợp có thể được sử dụng cho mục đích này?",
    "answer_label": "VPN (Virtual Private Network)",
    "answer_id": 53825
  },
  {
    "id": 13894,
    "question": "Lựa chọn nào sau đây là các thành phần của một sơ đồ trạng thái UML2.x (bao gồm 2.0 và các phiên bản sau)?",
    "answer_label": "Trạng thái và Chuyển đổi",
    "answer_id": 53829
  },
  {
    "id": 13895,
    "question": "Như thể hiện trong danh sách dưới đây, có ba loại kết nối. Lựa chọn nào sau đây là tổ hợp phù hợp nhất của các loại kết nối? \n\nKết nối A: Một mô-đun chuyển một yếu tố điều khiển tới mô-đun khác.\nKết nối B: Một mô-đun chuyển cấu trúc dữ liệu như một tham số cho mô-đun khác.\nKết nối C: Hai mô-đun có quyền truy cập vào cùng dữ liệu toàn cầu. \n\n![](https://learn.viblo.asia/uploads/c/5/c5d3263f-b20f-4049-a5d0-2e6d89173ac3.png)",
    "answer_label": "d",
    "answer_id": 53833
  },
  {
    "id": 13896,
    "question": "Lựa chọn nào sau đây là một mô tả phù hợp liên quan đến dữ liệu kiểm thử cho kiểm thử hộp đen?",
    "answer_label": "Dữ liệu kiểm thử được tạo ra theo đặc tả kỹ thuật bên ngoài.",
    "answer_id": 53836
  },
  {
    "id": 13897,
    "question": "Khi kiểm thử một thành phần phần mềm, lựa chọn nào sau đây là một sự kết hợp phù hợp của X và Y?\n\n  X: Nó gọi thành phần phần mềm sẽ được kiểm thử  \n  Y: Nó được gọi từ thành phần phần mềm sẽ được kiểm thử.        \n![](https://learn.viblo.asia/uploads/4/d/4d9bd7fa-8edf-4670-b088-5c58ca607f72.png)",
    "answer_label": "b",
    "answer_id": 53839
  },
  {
    "id": 13898,
    "question": "Theo tiêu chuẩn Mô hình Năng lực Trưởng thành Tích hợp (CMMI), giai đoạn nào là giai đoạn cuối cùng và có mức trưởng thành cao nhất ?",
    "answer_label": "Tối ưu hóa",
    "answer_id": 53844
  },
  {
    "id": 13899,
    "question": "Theo PMBOK, tổ hợp quy trình nào sau đây liên quan đến quản lý tích hợp dự án?\n\nA. Kiểm soát chi phí\nB. Xây dựng bản tuyên bố về dự án \nC. Chỉ đạo và quản lý công việc dự án\nD. Xác định rủi ro\nE. Quản lý thông tin liên lạc\nF. Thực hiện kiểm soát thay đổi tích hợp",
    "answer_label": "B,  C,  F",
    "answer_id": 53848
  },
  {
    "id": 13900,
    "question": "Theo PMBOK, lựa chọn nào sau đây là một lời giải thích hợp lý liên quan đến việc làm phạm vi phình ra dự án trong quản lý phạm vi dự án?",
    "answer_label": "Sự mở rộng không được kiểm soát về phạm vi sản phẩm hay dự án, mà không điều chỉnh thời gian, chi phí và nguồn lực.",
    "answer_id": 53853
  },
  {
    "id": 13901,
    "question": "Như thể hiện trong sơ đồ mũi tên dưới đây, có một dự án bao gồm tám hoạt động từ A đến G. Lựa chọn nào sau đây là sự kết hợp thích hợp về thời gian kết thúc sớm nhất (EFT) và thời gian bắt đầu chậm nhất (LST) của hoạt động G?\n![](https://learn.viblo.asia/uploads/3/f/3f3eaabb-d66e-44c7-a8d8-c8aa954641b5.png)",
    "answer_label": "c",
    "answer_id": 53856
  },
  {
    "id": 13902,
    "question": "Theo EVM (Quản lý giá trị kiếm được), ngân sách của một dự án phát triển phần mềm là 10000$ và dự án được quy hoạch trong 10 tuần. Sau 4 tuần, phát hiện thấy rằng mới chỉ 30% công việc được hoàn tất với chi phí là 4200$.  Chỉ số thực hiện về chi phí là bao nhiêu?",
    "answer_label": "0.714",
    "answer_id": 53861
  },
  {
    "id": 13903,
    "question": "Theo ISO/IEC 20000-1, lựa chọn nào sau đây là một quá trình cung cấp dịch vụ mà nhà cung cấp dịch vụ phải đồng ý về những dịch vụ cần cung cấp và phải đồng ý một danh mục dịch vụ với khách hàng?",
    "answer_label": "Quản lý cấp độ dịch vụ",
    "answer_id": 53865
  },
  {
    "id": 13904,
    "question": "Theo ITIL, điều nào sau đây là một hoạt động hay quá trình trong Chuyển đổi Dịch vụ?",
    "answer_label": "Triển khai chiến lược như hội thảo web, bản tin, và trực quan hóa trong quá trình chuyển giao tri thức",
    "answer_id": 53869
  },
  {
    "id": 13905,
    "question": "Lựa chọn nào sau đây là một mô tả phù hợp về mối quan hệ giữa bản ghi sự cố và bản ghi vấn đề trong quản lý dịch vụ CNTT?",
    "answer_label": "Thông tin tham khảo chéo về sự cố nêu ở phần đầu của bản ghi vấn đề được bao gồm trong bản ghi vấn đề.",
    "answer_id": 53873
  },
  {
    "id": 13906,
    "question": "Lựa chọn nào sau đây là một hoạt động thích hợp được thực hiện bởi một kiểm toán viên hệ thống người mà kiểm định việc kiểm soát truy nhập?",
    "answer_label": "Xác nhận tình trạng quản lý kiểm soát truy cập liên quan đến dữ liệu.",
    "answer_id": 53874
  },
  {
    "id": 13907,
    "question": "Lựa chọn nào sau đây là một điểm kiểm tra (checkpoint) trong quá trình kiểm định việc kiểm soát nhằm giảm nguy cơ của sự cố hệ thống khi áp dụng bản vá lỗi phần mềm?",
    "answer_label": "Việc vận hành hệ thống được kiểm tra một cách thích đáng trước khi bắt đầu hoạt động trọn thời gian.",
    "answer_id": 53880
  },
  {
    "id": 13908,
    "question": "Khi các biểu dữ liệu do bộ phận nghiệp vụ ban hành được nhập vào hệ thống trong bộ phận hệ thống thông tin, lựa chọn nào sau đây là một nhiệm vụ thích hợp được thực hiện bởi bộ phận hệ thống thông tin?",
    "answer_label": "Để bộ phận nghiệp vụ có thể kiểm tra được kết quả xử lý từng biểu dữ liệu, danh sách kết quả xử lý được gửi đến bộ phận nghiệp vụ.",
    "answer_id": 53883
  },
  {
    "id": 13909,
    "question": "Lựa chọn nào sau đây là sự đánh giá khả thi phù hợp khi kiểm tra liệu lợi ích suốt đời của hệ thống thông tin được đề xuất có lớn hơn chi phí suốt đời của nó?",
    "answer_label": "Khả thi về kinh tế",
    "answer_id": 53886
  },
  {
    "id": 13910,
    "question": "Lựa chọn nào sau đây là một kịch bản thông dụng để áp dụng UML, một kỹ thuật để trực quan hóa các quy trình nghiệp vụ?",
    "answer_label": "Để thể hiện các quy trình theo nhiều quan điểm, một số phương pháp mô hình hóa theo mục đích cụ thể được sử dụng, và mỗi mô hình được mô tả bằng cách sử dụng quy tắc ký hiệu tiêu chuẩn cho việc mô hình hóa đối tượng.",
    "answer_id": 53892
  },
  {
    "id": 13911,
    "question": "Trong “bốn loại’ cấu trúc doanh nghiệp, loại nào dưới đây hợp thành danh sách đầy đủ cùng với cấu trúc nghiệp vụ, cấu trúc công nghệ và cấu trúc ứng dụng?",
    "answer_label": "Cấu trúc dữ liệu",
    "answer_id": 53895
  },
  {
    "id": 13912,
    "question": "Lựa chọn nào sau đây là một lời giải thích thích hợp của EMS?",
    "answer_label": "Nó đề cập đến việc sản xuất các thiết bị điện tử,... theo hợp đồng do các nhà sản xuất khác đặt hàng.",
    "answer_id": 53900
  },
  {
    "id": 13913,
    "question": "Lựa chọn nào sau đây là giải thích về mua sắm xanh?",
    "answer_label": "Nó không chỉ đề cập đến việc thực hiện các yêu cầu về chất lượng và giá cả, mà còn về việc mua ưu đãi các sản phẩm và dịch vụ ít gây tổn hại tới môi trường của các công ty làm việc hướng tới việc giảm gánh nặng về môi trường.",
    "answer_id": 53902
  },
  {
    "id": 13914,
    "question": "Lựa chọn nào sau đây là mô tả thích hợp của RFI?",
    "answer_label": "Đó là một tài liệu dùng để yêu cầu thông tin liên quan đến việc tin học hóa từ các nhà cung cấp tiềm năng, ví dụ như các nhà cung cấp hệ thống.",
    "answer_id": 53909
  },
  {
    "id": 13915,
    "question": "Các công ty được phân loại dựa trên vị thế cạnh tranh của họ trên thị trường. Thường có bốn loại: dẫn đầu, thách thức, đi theo, và ngách. Lựa chọn nào sau đây là đặc tính thích hợp của chiến lược dẫn đầu?",
    "answer_label": "Đề xuất sản phẩm mới và phương pháp sử dụng nó với người tiêu dùng để mở rộng nhu cầu tổng thể trong khi vẫn duy trì hoặc mở rộng thị phần",
    "answer_id": 53913
  },
  {
    "id": 13916,
    "question": "Lựa chọn nào sau đây là một kỹ thuật marketing để tạo ra nhu cầu của người tiêu dùng bằng cách sử dụng quảng cáo nâng cao hình ảnh thương hiệu của công ty hoặc sản phẩm?",
    "answer_label": "Chiến lược kéo",
    "answer_id": 53916
  },
  {
    "id": 13917,
    "question": "Phân tích PEST được sử dụng để phân tích môi trường bên ngoài trong quá trình xác định chiến lược kinh doanh. Các yếu tố môi trường bên ngoài mà PEST phân tích là gì?",
    "answer_label": "Chính trị, Kinh tế, Xã hội, Công nghệ",
    "answer_id": 53918
  },
  {
    "id": 13918,
    "question": "Lựa chọn nào sau đây là giải thích về IoT (Internet vạn vật)?",
    "answer_label": "Nó chỉ việc cài đặt tính năng giao tiếp tới các đối tượng khác nhau, ngoài các thông tin và thiết bị liên lạc, và cho phép tự động nhận dạng hoặc đo đạc từ xa bằng cách kết nối đối tượng này với Internet, để đạt được các dịch vụ ra quyết định cao cấp và tự động kiểm soát thông qua việc thu thập và phân tích khối lượng dữ liệu lớn.",
    "answer_id": 53925
  },
  {
    "id": 13919,
    "question": "Lựa chọn nào sau đây là giải thích về kỹ thuật benchmarking được sử dụng để quản lý doanh nghiệp?",
    "answer_label": "Nó đề cập tới sự hiểu biết về mặt định lượng và chất lượng các sản phẩm, dịch vụ và hoạt động của công ty qua so sánh những điều đó với những đối thủ cạnh tranh hoặc các công ty tiên tiến.",
    "answer_id": 53926
  },
  {
    "id": 13920,
    "question": "Lựa chọn nào sau đây là giải thích về long tail?",
    "answer_label": "Nó hiệu quả trong việc làm giảm nguy cơ mất cơ hội trong một cửa hàng trực tuyến trên  Internet bằng cách sắp xếp một loạt mặt hàng, bao gồm cả những sản phẩm ít có cơ hội bán được.",
    "answer_id": 53933
  },
  {
    "id": 13921,
    "question": "Lựa chọn nào sau đây sẽ thực hiện việc xử lý theo các bước từ (1) đến (3)?\n\n    (1) Căn cứ vào kiểu loại và số lượng cũng như danh mục chi tiết những sản phẩm dự kiến sản xuất trong một giai đoạn cố định trong tương lai, tính ra số lượng thành phần yêu cầu.\n\n    (2) Số lượng đặt hàng thuần của từng thành phần được tính từ số tồn kho có thể phân bổ.\n\n    (3) Thời gian đặt hàng các thành phần được xác định khi xem xét thời gian sản xuất và thời gian mua sắm.",
    "answer_label": "MRP (Hoạch định yêu cầu vật liệu",
    "answer_id": 53937
  },
  {
    "id": 13922,
    "question": "Lựa chọn nào sau đây là quy trình mua sắm cho phép các nhà cung cấp chào giá cạnh tranh với nhau trên Internet để bán sản phẩm hay dịch vụ của họ theo những điều kiện do khách hàng xác định ?",
    "answer_label": "Đấu giá ngược",
    "answer_id": 53940
  },
  {
    "id": 13923,
    "question": "Lựa chọn nào sau đây là một tổ chức quản lý có cả đặc tính của dự án và của tổ chức dạng chức năng để linh hoạt ứng phó với những thay đổi trong môi trường kinh doanh?",
    "answer_label": "Tổ chức kiểu ma trận",
    "answer_id": 53945
  },
  {
    "id": 13924,
    "question": "Công ty A có hai kế hoạch truyền thông. Kế hoạch cho các quảng cáo 30 giây trên radio và kế hoạch cho các quảng cáo 60 giây trên truyền hình. Quảng cáo được đánh giá theo điểm. Công ty đang xem xét quảng cáo để đạt ít nhất 60 điểm trong thành phố và nhiều nhất 40 điểm bên ngoài thành phố. Bảng dưới đây cho thấy chi phí và quảng cáo cả truyền hình và radio. Lựa chọn nào sau đây là tập biểu thức có thể xác định số lượng quảng cáo trên phương tiện truyền thông để tổng chi phí là tối thiểu?\n\n![](https://learn.viblo.asia/uploads/1/1/114b05ad-50f2-47a6-9b49-4d14b9be447f.png)",
    "answer_label": "b",
    "answer_id": 53947
  },
  {
    "id": 13925,
    "question": "Khi áp dụng phương pháp FIFO với bản ghi mua bán như hiển thị dưới đây, giá trị hàng tồn kho vào cuối tháng ba là bao nhiêu?\n![](https://learn.viblo.asia/uploads/8/c/8cc02d5c-79ec-4737-a40f-183e885e7820.png)",
    "answer_label": "214",
    "answer_id": 53950
  },
  {
    "id": 13926,
    "question": "Phương pháp nào sau đây là dùng để ra quyết định dựa trên tỷ lệ chiết khấu khi giá trị thu hồi vốn thuần hiện tại và số tiền đầu tư là bằng nhau?",
    "answer_label": "Phương pháp Tỷ lệ hoàn vốn nội bộ",
    "answer_id": 53954
  },
  {
    "id": 13927,
    "question": "Lựa chọn nào sau đây KHÔNG được bảo vệ bằng “bản quyền” theo Hiệp định của Tổ chức Thương mại Thế giới về các khía cạnh liên quan đến thương mại của Quyền Sở hữu trí tuệ (TRIPS)?",
    "answer_label": "Ngôn ngữ lập trình và quy định của nó",
    "answer_id": 53960
  }
]
