[{"id":13541,"question":"Lựa chọn nào sau đây là mô tả thích hợp về Ma trận Phân công Trách nhiệm được sử dụng cho quản lý nguồn nhân lực dự án?","answer_label":"Phân bổ gói công việc cho những người chịu trách nhiệm về công việc dự án.","answer_id":52415},{"id":13902,"question":"Theo EVM (Quản lý giá trị kiếm được), ngân sách của một dự án phát triển phần mềm là 10000$ và dự án được quy hoạch trong 10 tuần. Sau 4 tuần, phát hiện thấy rằng mới chỉ 30% công việc được hoàn tất với chi phí là 4200$.  Chỉ số thực hiện về chi phí là bao nhiêu?","answer_label":"0.714","answer_id":53861},{"id":13898,"question":"Theo tiêu chuẩn Mô hình Năng lực Trưởng thành Tích hợp (CMMI), giai đoạn nào là giai đoạn cuối cùng và có mức trưởng thành cao nhất ?","answer_label":"Tối ưu hóa","answer_id":53844},{"id":13543,"question":"Theo Hướng dẫn của PMBOK - Ấn bản lần thứ 5, lựa chọn nào sau đây là một định nghĩa thích hợp của một bên liên quan đến dự án?","answer_label":"Một cá nhân, nhóm hoặc tổ chức có thể ảnh hưởng, bị ảnh hưởng hoặc nhận thấy bản thân bị ảnh hưởng bởi quyết định, hoạt động hoặc kết quả của một dự án.","answer_id":52423},{"id":13542,"question":"Cấu trúc nào sau đây mô tả mối quan hệ giữa hoạt động dự án và các đơn vị của dự án sẽ thực hiện các hoạt động đó?","answer_label":"Cấu trúc phân loại tổ chức","answer_id":52418},{"id":13513,"question":"Lựa chọn nào sau đây là câu mô tả phù hợp nhất về sự khác biệt giữa COCOMO trung gian và COCOMO II?","answer_label":"COCOMO trung gian gồm một mô hình tổng thể dựa trên các dòng lệnh, còn COCOMO II  gồm ba mô hình khác nhau, tùy thuộc vào kiến thức đã có về sản phẩm sẽ xây dựng","answer_id":52302},{"id":13900,"question":"Theo PMBOK, lựa chọn nào sau đây là một lời giải thích hợp lý liên quan đến việc làm phạm vi phình ra dự án trong quản lý phạm vi dự án?","answer_label":"Sự mở rộng không được kiểm soát về phạm vi sản phẩm hay dự án, mà không điều chỉnh thời gian, chi phí và nguồn lực.","answer_id":53853},{"id":13511,"question":"Biểu đồ mũi tên dưới đây cho thấy kế hoạch ban đầu của một dự án.\n![](https://learn.viblo.asia/uploads/3/a/3af3c046-c209-4f79-9137-cdf0addbe514.jpg)","answer_label":"Ngày hoàn thành dự án không được sớm hơn cũng không bị chậm đi","answer_id":52297},{"id":13510,"question":"Lựa chọn nào sau đây là một hành động được thực hiện trong quá trình tạo cấu trúc phân chia công việc (WBS) quá trình tạo trong việc quản lý phạm vi quản lý?","answer_label":"Chia nhỏ công việc theo thứ bậc","answer_id":52293},{"id":13899,"question":"Theo PMBOK, tổ hợp quy trình nào sau đây liên quan đến quản lý tích hợp dự án?\n\nA. Kiểm soát chi phí\nB. Xây dựng bản tuyên bố về dự án \nC. Chỉ đạo và quản lý công việc dự án\nD. Xác định rủi ro\nE. Quản lý thông tin liên lạc\nF. Thực hiện kiểm soát thay đổi tích hợp","answer_label":"B,  C,  F","answer_id":53848},{"id":13544,"question":"Lựa chọn nào sau đây là giải thích thích hợp về phương pháp Điểm chức năng được sử dụng để dự toán phát triển hệ thống?","answer_label":"Nó là một phương pháp để ước lượng quy mô của một hệ thống mà các chức năng của hệ thống được đo bằng số bằng cách sử dụng các phần tử như số lượng các mục nhập xuất dữ liệu và số lượng các tệp tin, và một điều chỉnh được thực hiện trên cơ sở độ phức tạp và đặc điểm riêng của ứng dụng.","answer_id":52429},{"id":13512,"question":"Một công ty đang lập kế hoạch phát triển công việc A. Người phát triển thứ nhất có thể thực hiện công việc này một mình trong 10 ngày. Hơn nữa, người phát triển thứ nhất có thể thực hiện công việc này trong 6 ngày với người phát triển thứ hai. Vậy người phát triển thứ hai cần bao nhiêu ngày để thực hiện công việc này một mình? Ở đây, vì phải giao tiếp, nên hiệu quả công việc của mỗi người phát triển bị giảm 10% và phần thập phân được làm tròn.","answer_label":"12","answer_id":52300},{"id":13901,"question":"Như thể hiện trong sơ đồ mũi tên dưới đây, có một dự án bao gồm tám hoạt động từ A đến G. Lựa chọn nào sau đây là sự kết hợp thích hợp về thời gian kết thúc sớm nhất (EFT) và thời gian bắt đầu chậm nhất (LST) của hoạt động G?\n![](https://learn.viblo.asia/uploads/3/f/3f3eaabb-d66e-44c7-a8d8-c8aa954641b5.png)","answer_label":"c","answer_id":53856}]