[{"id":3666,"question":"Which of the following is the purpose of periodically reorganizing a database in operation?","type":"single_choice","answer_label":"Additions, updates, and deletions performed repeatedly on a database generate storage areas that cannot be reused, and therefore the database volume increases and the processing speed decreases. For this reason, such areas are reorganized to prevent performance degradation.","answer_id":15579},{"id":4790,"question":"Which of the following devices is used for the purpose of protecting systems against momentary power loss and supplying just enough power for systems to shut down at the time of power outages?","type":"single_choice","answer_label":"UPS","answer_id":19797},{"id":5126,"question":"Which of the following is a chart or a diagram that is often used in quality control to rank issues or problems in descending order of frequency?","type":"single_choice","answer_label":"Pareto chart","answer_id":20979},{"id":4811,"question":"Which of the following is the purpose of emphasizing the importance of stakeholders in corporate management?","type":"single_choice","answer_label":"Improving satisfaction of interested parties such as customers, shareholders, and employees; aiming for sustainable growth","answer_id":19878},{"id":6151,"question":"Which of the following is the project management tool whereby the project activities and their relationships can be graphically represented, and the project manager can understand how the various activities flow towards completion in order of time?","type":"single_choice","answer_label":"Network diagram","answer_id":24819},{"id":2963,"question":"Which of the following is an appropriate cost estimation technique that uses parametric models to create an objective estimate based on each element size and the complexity of the system (e.g., number of input files, screens, etc.) to be built?","type":"single_choice","answer_label":"Function point method","answer_id":12839},{"id":5990,"question":"Which of the following is the most appropriate description concerning the changes in network configuration after the beginning of operations?","type":"single_choice","answer_label":"It is necessary to update the equipment control log, network diagram, etc. on a timely basis so that the network configuration can be changed at any time as needed.","answer_id":24171},{"id":2959,"question":"Which of the following is an appropriate testing type to ensure that the interfaces and linkages between different parts of programs work properly?","type":"single_choice","answer_label":"Integration test","answer_id":12822},{"id":4430,"question":"When the new procurement of a system is undertaken on the basis of the decision tree shown below, which of the following is the most appropriate course of action to be selected from a viewpoint of the lowest expected cost? Here, values enclosed in parentheses indicate the probability of each option, and the rightmost value is the estimated cost of each option. The expected cost of each choice (i.e., Build, Reuse, Buy, or Contract) is calculated as follows:\n![](https://learn.viblo.asia/uploads/9/5/95f090a9-7b34-4c74-b94d-96bc7ef426e2.png)","type":"single_choice","answer_label":"Buy","answer_id":18522},{"id":4573,"question":"![](https://learn.viblo.asia/uploads/d/5/d5b8b295-eef4-4674-af8c-3ff48d2533cf.png)","type":"single_choice","answer_label":"1,750","answer_id":19024},{"id":5202,"question":"Which of the following is a typical method that is contained in agile software development?","type":"single_choice","answer_label":"Extreme programming","answer_id":21282},{"id":6308,"question":"![](https://learn.viblo.asia/uploads/1/2/12b05b03-1e9f-4c98-ab72-467070b67ef5.png)","type":"single_choice","answer_label":"102","answer_id":25379},{"id":488,"question":"Which of the following is an explanation of a project organization?","type":"single_choice","answer_label":"It is formed only for a certain period of time to solve a given problem, and it is dissolved\nwhen the problem is solved.","answer_id":5830},{"id":1848,"question":"Which of the following is the critical path of the project activities shown in the arrow diagram below?\n![](https://learn.viblo.asia/uploads/9/b/9b60416d-84be-4afc-8ad1-8d0456fd54d3.png)","type":"single_choice","answer_label":"A→C→G→J→L","answer_id":8602},{"id":5199,"question":"Which of the following is a diagram that is used for modeling the event-driven or discrete behavior of an object in UML 2.x (i.e., UML 2.0 or later)?","type":"single_choice","answer_label":"State machine diagram","answer_id":21272},{"id":4423,"question":"Which of the following is an appropriate description concerning the black box test?","type":"single_choice","answer_label":"Even if the program to be tested contains redundant code, such kind of code cannot be detected.","answer_id":18493},{"id":3665,"question":"Among the functions provided by client management tools, which of the following is the most effective function for confirming that no software unrelated to the business operations is installed?","type":"single_choice","answer_label":"Inventory collection","answer_id":15575},{"id":4427,"question":"In the development process, which of the following is an activity that should be performed in software architecture design?","type":"single_choice","answer_label":"Analyzing the requirements on a step-by-step-basis by using the form of a chart","answer_id":18510},{"id":6313,"question":"![](https://learn.viblo.asia/uploads/b/0/b0e3f69c-0208-4524-860d-654a49ce12d8.png)","type":"single_choice","answer_label":"18","answer_id":25399},{"id":1850,"question":"According to “A Guide to the Project Management Body of Knowledge” (PMBOK Guide), which of the following is the knowledge area that includes the processes and activities to identify, define, combine, unify, and coordinate the various processes and project management activities within the Project Management Process Groups?","type":"single_choice","answer_label":"Project integration management","answer_id":8608},{"id":3658,"question":"The table below shows the series of activities for a certain project. The numbers in the table indicate the cost of each activity and how long (in weeks) it takes to complete each activity. Prior to starting each activity, the previous activities shown in the table must be completed. When the weekly cost of the project is minimized without delay of the project, what is the highest weekly cost in dollars during this project? Here, the weekly cost remains stable and unchanged during each activity.\n![](https://learn.viblo.asia/uploads/7/c/7c7285df-9c56-41d9-8fcb-b1e15d493a2b.png)","type":"single_choice","answer_label":"750","answer_id":15549},{"id":3660,"question":"Which of the following appropriately describes the purpose of using WBS (Work Breakdown Structure) in software development?","type":"single_choice","answer_label":"To divide development work into small tasks in a top-down manner, thereby facilitating work management","answer_id":15555},{"id":13821,"question":"A project with a development period of 10 months and the person-hours required for development as 200 person-months is planned. Which of the following is the number of staff members required during the peak time based on the distribution sheet shown below? Here, the number of staff members does not change from the start till the end of every process.\n![](https://learn.viblo.asia/uploads/1/8/189a6f37-a529-415b-92aa-161252716115.png)","type":"single_choice","answer_label":"22","answer_id":53537},{"id":2820,"question":"According to PMBOK, which of the following is the project management knowledge area that includes the activities of make-or-buy decisions, development time and material contracts, and selection of sellers from bidders?","type":"single_choice","answer_label":"Project Procurement Management","answer_id":12282},{"id":4425,"question":"Which of the following is an appropriate explanation of Agile software development methodology?","type":"single_choice","answer_label":"A model that encompasses a group of adaptive, iterative, and incremental development methods, such as XP and Scrum, and focuses on collaboration and responding to changes in the shortest period of time in a sustainable manner","answer_id":18503},{"id":6153,"question":"Which of the following is the appropriate element that is used to calculate slack time in the PERT (Program Evaluation and Review Technique)?","type":"single_choice","answer_label":"The earliest of the latest start times of the successor activities","answer_id":24827},{"id":5123,"question":"Which of the following is the most appropriate description concerning maintenance management that is to be planned for the development environment of an embedded system used during the development of a product?","type":"single_choice","answer_label":"It is necessary to maintain the development environment such as through periodic operational checks regardless of usage frequency.","answer_id":20967},{"id":1640,"question":"According to ISO/IEC 20000-1, which of the following is the appropriate processes that contain change management, configuration management, and release and deployment management?","type":"single_choice","answer_label":"Control processes","answer_id":7687},{"id":761,"question":"A project is planned to complete in 12 months and the budget for the completion of the project is $100,000. After six months, it is found that $60,000 are spent, but only 40% of the work is completed. If the Cost Performance Index (CPI) is not changed, what is the estimated amount (in dollars) required to complete the remaining tasks of the project?","type":"single_choice","answer_label":"90,000","answer_id":5068},{"id":4788,"question":"In a system environment requiring continuous availability as well as a high level of reliability, which of the following is the most appropriate term that stands for the capability to automatically switch over to a standby or redundant database, a server, or a network when the previously active one fails to operate properly?","type":"single_choice","answer_label":"Fail-over","answer_id":19786},{"id":5124,"question":"The arrow diagram shown below is created for time management of a project. Which of the following is the critical path?\n![](https://learn.viblo.asia/uploads/2/e/2ef41649-4341-4e78-8979-1dcce9796282.png)","type":"single_choice","answer_label":"B→E→F","answer_id":20971},{"id":1637,"question":"Which of the following is an appropriate tool that implements a deliverable-oriented decomposition of a project into smaller components?","type":"single_choice","answer_label":"Work Breakdown Structure (WBS)","answer_id":7678},{"id":4429,"question":"When the creation status of design documents is as described in the table below, how many person-hours are additionally needed to complete the creation of all three types of design documents?\n![](https://learn.viblo.asia/uploads/d/8/d87aaabf-79ad-44d1-b74d-3c5ada1e9bbe.png)","type":"single_choice","answer_label":"1100","answer_id":18519},{"id":622,"question":"Which of the following is the critical path of the project activities shown in the figure below?\n\n![](https://learn.viblo.asia/uploads/7/8/78366ac0-a13e-4dfa-9ad3-cc2032366937.png)","type":"single_choice","answer_label":"A->C->G->J->L","answer_id":5381},{"id":5987,"question":"In an arrow diagram shown below, how many days are needed in minimum to complete all the activities A through G? Here, in the diagram, each number shown beside the arrow indicates the number of days required to complete the activity.\n![](https://learn.viblo.asia/uploads/0/b/0b00bd21-4ba7-4006-8a3c-e2a08138e393.png)","type":"single_choice","answer_label":"27","answer_id":24162},{"id":5988,"question":"When the development department and the operations department of a system are organized separately, which of the following is the appropriate method for smooth and effective transfer from development to operations?","type":"single_choice","answer_label":"The operations department proactively participates in the system development and provides advice from the viewpoint of operations.","answer_id":24166},{"id":1768,"question":"According to EVM (Earned Value Management), the budget of a software development project is $10,000 and the project duration is planned for 10 weeks. After 4 weeks, it is revealed that only 30% of the work has been completed against a cost of $4,200. What is the cost performance index?","type":"single_choice","answer_label":"0.714","answer_id":8282},{"id":2961,"question":"Which of the following is an appropriate description for group decision-making techniques used in an estimate activity durations process?","type":"single_choice","answer_label":"These are team-based approaches, such as brainstorming, the Delphi or nominal group techniques, which are useful for engaging team members to improve estimate accuracy and commitment to the emerging estimates.","answer_id":12831},{"id":3486,"question":"Which of the following is the term that refers to a detailed breakdown of a project into a hierarchy of activities as shown in the figure below?\n![](https://learn.viblo.asia/uploads/9/8/98039a90-a029-4dda-b79c-c2894538ba45.png)","type":"single_choice","answer_label":"WBS","answer_id":14869},{"id":1636,"question":"Which of the following is an explanation of the spiral model in system development?","type":"single_choice","answer_label":"This model has four phases: Planning, Risk Analysis, Engineering and Evaluation. A\r\nsoftware project repeatedly passes through these phases in iterations","answer_id":7673},{"id":1766,"question":"According to PMBOK, which of the following is an appropriate explanation concerning the scope creep in project scope management?","type":"single_choice","answer_label":"The uncontrolled expansion to product or project scope without adjustments to time,\ncost, and resources.","answer_id":8274},{"id":4453,"question":"![](https://learn.viblo.asia/uploads/3/6/36fb07c7-3910-4dd3-981c-141fb04c0d46.png)","type":"single_choice","answer_label":"19.51","answer_id":18614},{"id":4809,"question":"Which of the following is an appropriate description concerning risk analysis?","type":"single_choice","answer_label":"It takes too much time and cost to handle all potential risks, so the damage costs and occurrence probabilities should be estimated in advance and priority should be given in accordance with the magnitude of risks.","answer_id":19870},{"id":6399,"question":"How much is the approximate expected value in dollars, for the first-year correction cost of an application program under the following conditions? \n[Conditions] \n(1) Program size: 2,000 Ksteps \n(2) Potential program error rate: 0.04 errors / Ksteps \n(3) Annual discovery rate of potential errors: 20 % / year \n(4) Classification of errors \n          Error with major impact: 20 % \n          Error with minor impact: 80 % \n(5)Correction cost per error \n          Error with major impact: 20,000 dollars \n          Error with minor impact: 5,000 dollars \n(6) Only errors with major impact are corrected.","type":"single_choice","answer_label":"64000","answer_id":25722},{"id":762,"question":"Which of the following is an appropriate cost estimation technique that estimates the cost of an activity or project using the historical data from a similar project?","type":"single_choice","answer_label":"Analogous estimating","answer_id":5062},{"id":2065,"question":"Which of the following is a characteristic of a project?","type":"single_choice","answer_label":"A project is both unique and temporary.","answer_id":9418},{"id":2956,"question":"Which of the following is a module strength for the collection of multiple sequential functions, with internal passing of data?","type":"single_choice","answer_label":"Communicational strength","answer_id":12809},{"id":5125,"question":"What is the function point value of a program that has the functions and characteristics shown in the table below? Here, the correction coefficient of complexity is 0.75.\n![](https://learn.viblo.asia/uploads/a/0/a0729847-ff4f-45a3-aa2c-b42fcbe99348.png)","type":"single_choice","answer_label":"18","answer_id":20973},{"id":13823,"question":"Which of the following is an explanation of the function point method?","type":"single_choice","answer_label":"The development scale is estimated from the counts and characteristics of external inputs and outputs, internal logical files, external inquiries, and external interface files.","answer_id":53544},{"id":2821,"question":"In order to check whether a system works normally, users in the system user department and operators in the system operations department jointly conduct operational testing prior to full operation. Which of the following is an appropriate description of the users should prioritize during testing?","type":"single_choice","answer_label":"Testing whether the system operates according to predetermined business procedures","answer_id":12286},{"id":2033,"question":"The arrow diagram below shows the original plan of a project.\n\n ![](https://learn.viblo.asia/uploads/4/e/4e66ee93-c38f-49a1-afa7-484eeb257d66.png)\n \nIf the project plan is changed as shown in the table below, which of the following impacts project completion date?\n\n\n![](https://learn.viblo.asia/uploads/0/a/0a7184ac-a737-48a8-8b70-8603200bafde.png)","type":"single_choice","answer_label":"The project completion date is neither accelerated nor delayed","answer_id":9293},{"id":478,"question":"According to PMBOK, which of the following processes is included in the Executing Process Group?","type":"single_choice","answer_label":"Process of auditing the quality requirements and the results from quality control\nmeasurements to ensure that appropriate quality, standards and operational definitions\nare properly implemented","answer_id":5864},{"id":2957,"question":"Which of the following is the appropriate combination of Class and Object in Object Oriented Programming?\n![](https://learn.viblo.asia/uploads/3/4/348f1f23-5b6e-4517-b9b4-556b753bbd8f.png)","type":"single_choice","answer_label":"a","answer_id":12813},{"id":3661,"question":"Which of the following is an appropriate characteristic of a Gantt chart used in progress control?","type":"single_choice","answer_label":"It can compare the planned schedule and actual results.","answer_id":15562},{"id":6310,"question":"![](https://learn.viblo.asia/uploads/a/1/a1e914ea-01a6-4b17-8600-87ce74ba9eb8.png)","type":"single_choice","answer_label":"B, D","answer_id":25390},{"id":2962,"question":"Which of the following is an appropriate description of the activities on the critical path of a project?","type":"single_choice","answer_label":"Any activity on the critical path is called a critical path activity.","answer_id":12833},{"id":4431,"question":"The development scale of a new system is estimated as 500 Function Points (FPs). In the project for developing this system, in addition to the person-hours for development, 10 person-months are necessary for the installation of the system and the education of developers. Also, 10% of the person-hours for development, installation, and education are required for project management. How many person-months in total are necessary for this project? Here, the productivity in development is 10 FPs per one person-month.","type":"single_choice","answer_label":"66","answer_id":18528},{"id":6015,"question":"How many days in total are required in the critical path of the arrow diagram? Here, the number shown beside the arrow indicates the number of days for each activity.\n![](https://learn.viblo.asia/uploads/8/f/8fd4bef2-4999-4663-995d-0507a71eecf3.png)","type":"single_choice","answer_label":"11","answer_id":24274},{"id":3659,"question":"The execution plan for the system development project is prepared, and the critical path is obtained. Which of the following is the activity that can be understood by means of the critical path?","type":"single_choice","answer_label":"The activity whose delay directly leads to the delay of the whole project","answer_id":15553},{"id":760,"question":"By using the triangular distribution formula of the three-point estimation technique, which of the following is the expected duration (in days) required for an activity? The estimations are as shown below.\nConditions – Estimations for the activity duration\nCase 1: Two (2) days. If an experienced employee is assigned for this activity.\nCase 2: Four (4) days. If a general employee is assigned for this activity.\nCase3: Twelve (12) days. If an unexperienced employee is assigned for this activity.","type":"single_choice","answer_label":"6","answer_id":5072},{"id":3663,"question":"The membership registration process in company A issues IDs in the format defined below. The table shows the transition of the number of issued IDs at the end of each fiscal year. On the assumption that this tendency continues in years to come, when are the IDs in this format expected to be exhausted? Here, the IDs withdrawn from membership are treated as missing numbers and are not be reused.\n![](https://learn.viblo.asia/uploads/8/3/830580f5-eea7-42fe-a57f-1b175441b011.png)","type":"single_choice","answer_label":"Fiscal year 2012","answer_id":15569},{"id":1767,"question":"As shown in the arrow diagram below, there is a project consisting of eight activities A through G. Which of the following is the appropriate combination of the earliest finish time (EFT) and latest start time (LST) of activity G?\n![](https://learn.viblo.asia/uploads/a/f/aff9dfc2-9d75-48bd-ac43-464569e27495.png)","type":"single_choice","answer_label":"c","answer_id":8277},{"id":6155,"question":"Which of the following is the risk response which accepts the cost of damages because risk impact is assumed to be small when the risk becomes exposed?","type":"single_choice","answer_label":"Risk retention","answer_id":24836},{"id":481,"question":"Which of the following is an appropriate purpose of using a Work Breakdown Structure (WBS) in a software development project?","type":"single_choice","answer_label":"To decompose a development task into smaller sub-tasks of a manageable size, and\norganize them into a hierarchical structure","answer_id":5853},{"id":2958,"question":"Which of the following is an appropriate description concerning the black box test?","type":"single_choice","answer_label":"Even if the program to be tested contains redundant code, such code cannot be detected.","answer_id":12817},{"id":1847,"question":"Each letter (i.e., P, D, C, and A) of the “PDCA” cycle used for progress management of system development and quality management of software is the first letter of the corresponding word. Which of the following is the word that is represented by the third letter “C”?","type":"single_choice","answer_label":"Check","answer_id":8597},{"id":759,"question":"Which of the following is an appropriate explanation of the PERT diagram as shown in the figure below?\n\n![](https://learn.viblo.asia/uploads/c/9/c930bcf1-7ac8-467b-bda9-ecb61d388777.png)","type":"single_choice","answer_label":"When the activity F becomes unnecessary, the project will end 1 day earlier.","answer_id":5076},{"id":6154,"question":"Which of the following is the method used for estimating the scales or person-months in system development where the five basic components—external input, external output, internal logical file, external interface file, and external inquiry—are defined and classified with their complexity weights?","type":"single_choice","answer_label":"Function point method","answer_id":24831},{"id":13824,"question":"In ITIL, the reduction in the index value expressing maintainability is cited as an example of a key performance index (KPI) in availability management. Which of the following corresponds to such an index?","type":"single_choice","answer_label":"Mean time to restore service","answer_id":53548},{"id":479,"question":"Which of the following is an appropriate description of “Lead” relationship in project time management?","type":"single_choice","answer_label":"It is the amount of time by which a successor activity can be advanced with respect to a\npredecessor activity.","answer_id":5860},{"id":13822,"question":"Which of the following is the critical path of the project activities shown in the figure below?\n![](https://learn.viblo.asia/uploads/3/a/3a4bce8d-ebaf-424f-b78e-977faa078dea.png)","type":"single_choice","answer_label":"A→C→G→J→L","answer_id":53541},{"id":2964,"question":"In order to determine the quality condition in a test process, it is necessary to analyze and evaluate the relationship between the number of completed test items and the cumulative number of bugs. Which of the following is the graph that indicates that the quality is becoming stable?\n![](https://learn.viblo.asia/uploads/6/5/656fcdf3-1dc9-4564-b81a-477a68738b4e.png)","type":"single_choice","answer_label":"d","answer_id":12844},{"id":2960,"question":"Which of the following is an explanation of reverse engineering of software?","type":"single_choice","answer_label":"The existing software is analyzed, and its specification and structure are clarified.","answer_id":12826},{"id":5200,"question":"From internal and external viewpoints concerning software product development and maintenance, which of the following is an appropriate quality characteristic that includes several sub-characteristics such as maturity, fault tolerance, recoverability, and availability?","type":"single_choice","answer_label":"Reliability","answer_id":21276},{"id":5989,"question":"When there are multiple business application systems available, which of the following is the most appropriate method for access control?","type":"single_choice","answer_label":"Appropriate access permissions are granted for each business application system, irrespective of a user’s position and authority.","answer_id":24169},{"id":13820,"question":"According to PMBOK, which of the following is the description of scope creep?","type":"single_choice","answer_label":"The uncontrolled expansion to product or project scope without adjustments to time, cost, and resources","answer_id":53533},{"id":623,"question":"In order to analyze the trend of issues that occur in a project, the number of issues by management item, such as the stakeholders, cost, schedule, quality, etc., are arranged in order starting with the highest number of issues in the form of a bar graph, and a diagram is prepared in which the number of issues accumulated in this order are superimposed in the form of a line graph. Which of the following is this diagram?","type":"single_choice","answer_label":"Pareto diagram","answer_id":5376},{"id":480,"question":"Company A is going to launch a new software product and the sales team then has to demonstrate it to the customers. There is a risk that the sales team does not understand the product and cannot provide good demonstrations. As a consequence, the sales team will make fewer sales and there will be less revenue for the company. So, the management decided to provide good training for the sales team. Which of the following is the best method to manage the risk?","type":"single_choice","answer_label":"Risk mitigation","answer_id":5858},{"id":4428,"question":"Which of the following is an activity that is performed during the WBS creation process in project scope management?","type":"single_choice","answer_label":"Segmenting project activities hierarchically into smaller parts or pieces","answer_id":18516},{"id":6152,"question":"A painter has 20 houses and 4 shops to paint. In comparison with the shop, the house usually takes half the time to paint. The painter has finished painting 10 houses in 3 days. If the painter continues to work at the same pace, how many days does it take to complete the remaining work?","type":"single_choice","answer_label":"5.4","answer_id":24824},{"id":4789,"question":"A value is calculated from a given data according to specific rules, and then a check character is determined from this value and appended to the given data. This is used to check the input data. When the rules listed below are used, which of the following is the correct check character to be appended to the four-digit numeric data “2131”?\n[Rules]\n(1) Assign the coefficients 4, 3, 2, and 1 to each digit of the given data, in order from the first (leftmost).\n(2) Multiply each digit by its assigned coefficient, and calculate the sum of each product.\n(3) Divide the sum obtained in Step (2) by 11, and obtain the remainder.\n(4) The value of the remainder obtained in Step (3) is the check character. Here, when the remainder is 10, “X” is assigned to the check character.","type":"single_choice","answer_label":"7","answer_id":19793},{"id":830,"question":"According to PMBOK, which of the following combinations of processes pertains to project integration management?\nA. Control costs\nB. Develop project charter\nC. Direct and manage project work\nD. Identify risks\nE. Manage communications\nF. Perform integrated change control","type":"single_choice","answer_label":"B, C, F","answer_id":4788},{"id":4424,"question":"Which of the following is the appropriate category of system maintenance that is performed for the purpose of adding new features to an existing system or enhancing existing features?","type":"single_choice","answer_label":"Perfective maintenance","answer_id":18499},{"id":3484,"question":"Which of the following is a technique that analyzes software or hardware and creates a design document, such as an E-R diagram based on the definition information of database system in the production environment?","type":"single_choice","answer_label":"Reverse engineering","answer_id":14860},{"id":5180,"question":"According to ISO 9241-11, usability is defined as the “extent to which a product can be used by specified users to achieve specified goals with effectiveness, efficiency, and satisfaction in a specified context of use.” Which of the following is an appropriate method for evaluating the “level of user satisfaction” mentioned in this definition?","type":"single_choice","answer_label":"Interview method","answer_id":21195},{"id":4810,"question":"Which of the following is a meta-language that includes self-defining markup symbols called tags to describe the content of a Web page or file and supports bi-directional hyperlinks with high affinity to the Internet?","type":"single_choice","answer_label":"XML","answer_id":19877},{"id":5127,"question":"Which of the following is the most appropriate indicator that is directly helpful in managing software quality in a system development project?","type":"single_choice","answer_label":"Period of time required to adequately review each deliverable","answer_id":20982},{"id":6429,"question":"There are seven activities A through G shown in the table below. Activities A and Bcan be performed concurrently, but the others cannot be done until theirpreceding activities are completed. For example, C cannot begin until A is completed. Which of the following is the critical path of these activities?\n![](https://learn.viblo.asia/uploads/6/9/69615a91-f36b-4b3a-a6e5-7be85c14dfe4.png)","type":"single_choice","answer_label":"A→C→E→G","answer_id":25842},{"id":2066,"question":"Which of the following is an appropriate purpose of using a WBS (Work Breakdown Structure) in software development?","type":"single_choice","answer_label":"To decompose all development activities into smaller steps with a manageable size, and organize them into a hierarchical structure","answer_id":9423},{"id":4426,"question":"Which of the following is the order that activities A through F are performed in a system development process using a waterfall model?\n[Description of activities]\nA : Investigating and analyzing current problems, and defining requirements for the target system\nB : Dividing functions required for the system into programs, and clarifying the flow of processing\nC : Designing detailed procedures, and writing code\nD : Performing tests\nE : Designing the internal structure of each program\nF : Defining functions needed as the system on the basis of the system requirements specifications","type":"single_choice","answer_label":"A , F , B , E , C , D","answer_id":18506},{"id":1631,"question":"Which of the following is the most suitable system for a design using a state transition diagram?","type":"single_choice","answer_label":"An operations measurement system for system resources, which measures the operational\r\nstatus of the system resources, and generates a report","answer_id":7654},{"id":3485,"question":"When a certain project includes activities A through H as shown in the arrow diagram below, which of the following is the earliest start date of avtivity H? Here, the number shown beside an arrow indicates the number of days required for each activity, and the project starts on day zero (0).\n![](https://learn.viblo.asia/uploads/5/f/5fc11a6b-6612-45ef-8c48-b357bc206b5f.png)","type":"single_choice","answer_label":"7","answer_id":14865},{"id":5201,"question":"Which of the following is a type of integration test that has the characteristics listed below? \n[Characteristics]\n- All of the related program modules are combined and tested at once. \n- Neither drivers nor stubs are required. \n- It is useful for small programs, but not for commercial development projects.","type":"single_choice","answer_label":"Big bang test","answer_id":21277},{"id":5986,"question":"When the cost associated with information systems can be broken down into the initial costand the runningcost, which of the following is included in the initial cost?","type":"single_choice","answer_label":"Development cost of application software","answer_id":24156},{"id":620,"question":"Screens are created for a system that is composed of a total of 100 screens. The breakdown of the 100 screens classified on the basis of size and complexity is shown below.\n\nNumber of screens with a “Small” size and “Low” complexity: 30 \nNumber of screens with a “Medium” size and “Medium” complexity: 40 \nNumber of screens with a “Large” size and “Medium” complexity: 20 \nNumber of screens with a “Large” size and “High” complexity: 10\n\nIf the total number of person-days for creating all screens is estimated by using the number of person-days for creation shown in the table below, how many person-days are required? Here, a review and revision of all the screens requires five (5) person-days, and project management requires 20% of the total person-days, including the person-days for review and revision.\n\n![](https://learn.viblo.asia/uploads/4/7/4773bea6-369f-4b2f-84d5-dd673e8a3a32.png)","type":"single_choice","answer_label":"102","answer_id":5389},{"id":3664,"question":"Which of the following is the primary objective of conducting a system migration test?","type":"single_choice","answer_label":"To confirm the procedures for switching from an existing system to a new system as well as problems accompanied with this switching, from the viewpoints of security and efficiency","answer_id":15574},{"id":4791,"question":"The person in charge of operating a sales management system has decided to rearrange the customer master file records in cooperation with the system users in the sales department. Which of the following is an appropriate policy for rearranging the master file?","type":"single_choice","answer_label":"Before deleting a customer record, it is necessary to first check that the customer code is not used anywhere within the sales management system and related systems.","answer_id":19798},{"id":3662,"question":"When the four roles, change control administrator, configuration administrator, maintenance administrator, and maintenance staff are defined in software maintenance organizations, which of the following persons should be primarily responsible for providing mechanisms for identifying, controlling, and tracking versions of software components?","type":"single_choice","answer_label":"Configuration administrator","answer_id":15564}]