[{"id":13903,"question":"Theo ISO/IEC 20000-1, lựa chọn nào sau đây là một quá trình cung cấp dịch vụ mà nhà cung cấp dịch vụ phải đồng ý về những dịch vụ cần cung cấp và phải đồng ý một danh mục dịch vụ với khách hàng?","answer_label":"Quản lý cấp độ dịch vụ","answer_id":53865},{"id":13906,"question":"Lựa chọn nào sau đây là một hoạt động thích hợp được thực hiện bởi một kiểm toán viên hệ thống người mà kiểm định việc kiểm soát truy nhập?","answer_label":"Xác nhận tình trạng quản lý kiểm soát truy cập liên quan đến dữ liệu.","answer_id":53874},{"id":13904,"question":"Theo ITIL, điều nào sau đây là một hoạt động hay quá trình trong Chuyển đổi Dịch vụ?","answer_label":"Triển khai chiến lược như hội thảo web, bản tin, và trực quan hóa trong quá trình chuyển giao tri thức","answer_id":53869},{"id":13516,"question":"Trong các Thư viện hạ tầng cơ sở công nghệ thông tin (ITIL), việc hạ thấp chỉ tiêu về tính duy trì đưa ra như một ví dụ về chỉ số thực hiện chính (KPI) đối với việc quản lý sự hiện hữu. Lựa chọn nào sau đây tương ứng với chỉ số này?","answer_label":"Thời gian trung bình để khôi phục dịch vụ","answer_id":52316},{"id":13518,"question":"Khi kiểm toán việc quản lý tài sản phần mềm, điểm nào sau đây là điểm thích hợp nhất cần được kiểm tra?","answer_label":"Kiểm tra xem các chứng từ, như giấy phép phần mềm, có còn hợp thức không","answer_id":52323},{"id":13517,"question":"Trong số các mục mà kiểm toán viên hệ thống ghi vào báo cáo kiểm toán, lựa chọn nào sau đây trệch khỏi phạm vi công việc của kiểm toán viên?","answer_label":"Ra lệnh cải tiến","answer_id":52319},{"id":13514,"question":"Theo tiêu chuẩn ISO/IEC 20000-1 (công nghệ thông tin - Quản lý dịch vụ -  Phần 1: Các yêu cầu của Hệ thống quản lý dịch vụ), lựa chọn nào sau đây là mô tả phù hợp về quản lý vấn đề?","answer_label":"Đó là một quy trình được dùng để xác định nguyên nhân chính của sự cố, giảm thiểu các tác động tiêu cực của sự cố, và ngăn chặn nó xảy ra lần nữa","answer_id":52307},{"id":13515,"question":"Thuật ngữ nào sau đây chỉ lượng giao dịch dữ liệu có thể chấp nhận mất mát sau khi thời gian chết xảy ra?","answer_label":"Mục tiêu điểm phục hồi (RPO)","answer_id":52311},{"id":13905,"question":"Lựa chọn nào sau đây là một mô tả phù hợp về mối quan hệ giữa bản ghi sự cố và bản ghi vấn đề trong quản lý dịch vụ CNTT?","answer_label":"Thông tin tham khảo chéo về sự cố nêu ở phần đầu của bản ghi vấn đề được bao gồm trong bản ghi vấn đề.","answer_id":53873},{"id":13519,"question":"Lựa chọn nào sau đây là đối tượng kiểm toán hệ thống nhằm đánh giá và kiểm tra việc kiểm soát nội bộ liên quan đến CNTT?","answer_label":"Các phương pháp nhằm đảm bảo tính chính xác trong các quy trình đầu vào và cập nhật cơ sở dữ liệu do bộ phận bán hàng thực hiện","answer_id":52326},{"id":13546,"question":"ISO/IEC 20000-1:2011 đòi hỏi phải áp dụng phương pháp được gọi là “Plan-Do-Check-Act” (PDCA) cho tất cả các phần của Hệ thống Quản lý Dịch vụ (SMS) và các dịch vụ. Lựa chọn nào sau đây là hoạt động bao gồm kế hoạch trong SMS?","answer_label":"Tạo ra khuôn khổ quyền, trách nhiệm và vai trò quy trình","answer_id":52435},{"id":13547,"question":"Theo ISO/IEC 20000-1:2011, đáp án nào sau đây là quy trình kiểm soát bao gồm xác định, kiểm soát, ghi chép, theo dõi, báo cáo và xác minh CI và quản lý thông tin CI trong CMDB?","answer_label":"Quản lý cấu hình","answer_id":52440},{"id":13549,"question":"Điểm nào sau đây là điểm kiểm tra để kiểm toán sự kiểm soát của nguy cơ rò rỉ thông tin, giả mạo, và sử dụng trái phép tài liệu liên quan đến một hệ thống?","answer_label":"Thực hiện các biện pháp bảo đảm tính bí mật của tài liệu","answer_id":52448},{"id":13548,"question":"Điều nào sau đây là mục đích thích hợp nhất mà một kiểm định viên hệ thống trao đổi ý kiến với một bộ phận kiểm toán liên quan đến phiên bản dự thảo báo cáo kiểm toán?","answer_label":"Để xác nhận rằng không có lỗi thực tế trong các phát hiện và kiến nghị được mô tả trong báo cáo kiểm toán.","answer_id":52442},{"id":13550,"question":"Điều nào sau đây là mô tả thích hợp liên quan đến việc thực hiện kiểm toán hệ thống?","answer_label":"Để người yêu cầu kiểm toán ban hành các hướng dẫn cải tiến trên cơ sở báo cáo kiểm toán, kiểm toán viên hệ thống báo cáo kết quả kiểm toán cho người yêu cầu kiểm toán.","answer_id":52451},{"id":13545,"question":"Theo ITIL ấn bản 2011, điều nào sau đây là một giai đoạn thích hợp của vòng đời dịch vụ mà một nhà cung cấp dịch vụ xây dựng và triển khai các dịch vụ mới hoặc dịch vụ được sửa đổi?","answer_label":"Chuyển tiếp dịch vụ","answer_id":52433}]