[{"id":6158,"question":"When a company is notified of the necessity of upgrading the version for the server OS on which a database system and business application are running, which of the following is an appropriate decision on whether or not to upgrade the OS?","answer_label":"The company checks if the database system runs without problem in the new OS environment, and then checks the operation of the business application. If there is no problem, the company upgrades the OS.","answer_id":24847},{"id":1849,"question":"According to ITIL (IT Infrastructure Library), CSA (Configuration Status Accounting) is the recording and reporting of all current and historical data concerned with each CI\n(Configuration Item) throughout its life-cycle. activity that is performed as part of CSA?","answer_label":"Performing integrated change control","answer_id":8606},{"id":4814,"question":"Which of the following is the appropriate relationship between two variables x and y represented by the scatter diagram?\n![](https://learn.viblo.asia/uploads/e/9/e97da00d-a602-4ab5-8fa0-cbe019f38378.png)","answer_label":"Negative correlation","answer_id":19890},{"id":2073,"question":"Which of the following is an appropriate activity that is undertaken by a system auditor who makes an audit of access control?","answer_label":"Verification of the management status of access control concerning data","answer_id":9453},{"id":4681,"question":"Among the characteristics of the structure of a service desk organization, which of the following is a characteristic of the local service desk?","answer_label":"By placing the service desk close to users, intensive services are provided for users who have different languages and cultures or for VIPs by specialized service staff members.","answer_id":19406},{"id":1851,"question":"Which of the following is the most appropriate characteristic of the “big bang” migration method that is one of the system migration methods?","answer_label":"The problems that occur during migration to the new system have a big impact.","answer_id":8614},{"id":624,"question":"IT services are provided under the following conditions in the SLA. What is the maximum number of hours of downtime in a month that can satisfy the SLA?\n(Conditions of the SLA)\nThe number of business days per month is 30.\nThe service hours are from 7 AM to 11PM o'clock on a business day. \nThe required availability is 99% or more.\nOther required time, such as maintenance time, can be ignored.","answer_label":"4.8","answer_id":5372},{"id":4812,"question":"When the average cost method is used for the inventory control in the transaction record table shown below, what is the inventory value (in dollars) at the end of March?\n![](https://learn.viblo.asia/uploads/3/c/3c10df0b-e3e7-4655-8aa6-2806e3491aba.png)","answer_label":"1,875","answer_id":19884},{"id":3667,"question":"Which of the following is an appropriate description concerning the role of a system auditor?","answer_label":"It is to assure the full preparation and operations regarding the control of the information system or to give advice on them, from a professional standpoint independent from the audit target","answer_id":15583},{"id":1771,"question":"Which of the following is an appropriate description of the relationship between a record of an incident and a record of a problem in IT service management?","answer_label":"The cross-referenced information of the incident that acts as the beginning of the record\nof the problem is included in the record of the problem.","answer_id":8294},{"id":2966,"question":"In IT service management, which of the following is the most appropriate functional organization that provides a single point of contact and tries to provide rapid restoration of normal service operations to users?","answer_label":"Service desk","answer_id":12849},{"id":2825,"question":"Which of the following is an appropriate description of the implementation structure of a system audit?","answer_label":"In order to enable the person requesting the audit to issue improvement instructions on the basis of the audit report, the system auditor reports the audit results to the person requesting the audit.","answer_id":12300},{"id":2824,"question":"When a version management system for source code is installed, which of the following is an appropriate check point to be added for the confidentiality of the source code during the system audit?","answer_label":"The access control settings of the version management system are appropriate.","answer_id":12295},{"id":1770,"question":"According to ITIL, which of the following is an activity or process in the Service Transition?","answer_label":"Implementing multiple strategies such as web seminars, newsletters, and visualization in transferring knowledge","answer_id":8290},{"id":6156,"question":"Which of the following is an appropriate characteristic of the single-step (so-called “big bang”) migration method?","answer_label":"Problems during migration to the new system have serious impacts.","answer_id":24840},{"id":6159,"question":"Which of the following is an effective measure to protect information systems from overvoltage caused by lightning?","answer_label":"Connecting communication cables to computers via SPD (Surge Protection Device)","answer_id":24850},{"id":2822,"question":"When data in the business operations department is entered in a data sheet by the information system department, which of the following is an appropriate task executed by the information system department?","answer_label":"To enable the business operations department to check the processing results of each data sheet, the processing results list is sent to the business operations department.","answer_id":12289},{"id":3487,"question":"It takes 36 days for Mr. A to complete a certain task, and 18 days for Mr. B to complete the same task. When Mr. A performs the task together with Mr. B, approximately how many days does it take to complete the task? Here, the task can be divided and performed in parallel, and both Mr. A and Mr. B can achieve an average working efficiency of 90 % every day during the cooperative task.","answer_label":"14","answer_id":14873},{"id":5134,"question":"When an information strategy is developed, which of the following is an item that must always be made consistent with the strategy?","answer_label":"Medium and long-term management plans","answer_id":21009},{"id":764,"question":"For servers, the total cost of ownership (TCO) is calculated over a period of 5-years. The purchase price of the servers is $120,500 and the other annual costs are listed as below.\n\n| Area of Cost | Annual Cost ($) |\n| -- | -- |\n| Insurance | 2,030 |\n| Maintenance | 1,000 |\n| Repair (average) | 700 |\n| Registration | 270 |\n\nWhat is the TCO of the servers (in dollars)?","answer_label":"140,500","answer_id":5056},{"id":1772,"question":"Which of the following is an appropriate activity that is undertaken by a system auditor who audits access control?","answer_label":"Confirmation of the management status of access control concerning data","answer_id":8295},{"id":4683,"question":"When IT control is classified into preventive control and detective control, which of the following is applicable to detective control?","answer_label":"An output list resulting from data entry is cross-checked with the input form.","answer_id":19415},{"id":5131,"question":"Whenan audit is performed on the reliability of programming, which of the following is the most appropriate item to be reported as a finding?","answer_label":"The programmer selects a subset of unit test items from all the program logic paths on a sampling basis.","answer_id":20999},{"id":627,"question":"Which of the following is an appropriate activity for a system auditor?","answer_label":"The auditor points out items that need to be improved regarding problems found during the investigation.","answer_id":5360},{"id":4682,"question":"In the stage of system design, when an audit is performed on the control for reducing the risk that user requirements are not met, which of the following is a point to be checked?","answer_label":"Checking if the user department participates in the review of the system design documents","answer_id":19411},{"id":5132,"question":"When a department that outsources system development must undergo a system audit concerning “progress management” of the outsourcing partner, which of the following is an appropriate set of materials that should be submitted?","answer_label":"Business reports received periodically from the outsourcing partner, and documents showing the verification result of the business reports","answer_id":21001},{"id":4684,"question":"Which of the following is a deliverable of data architecture that is one of the four architectures contained in Enterprise Architecture?","answer_label":"E-R diagram","answer_id":19416},{"id":6157,"question":"From a viewpoint of reliability of systems, which of the following is the appropriate timing for measuring the availability of a system?","answer_label":"When the problems found immediately after the start of system operations have been resolved and the system is becoming stable","answer_id":24845},{"id":2826,"question":"Which of the following is a check point for auditing control in relation to the accuracy of the processing logic of a spreadsheet?","answer_label":"The program of the spreadsheet is documented and verified.","answer_id":12305},{"id":5205,"question":"The workload required to develop a system is estimated at 80 person-months if it is carried out by one person. When four staff members with the same productivity work together to develop the system, each member’s productivity is expected to decrease by 20%. How many working days does it take for the four members to develop this system? Here, this development work can be equally divided into four parts, and the four members can perform each individual part in parallel. In addition, each member can work 22 working days per month.","answer_label":"528","answer_id":21295},{"id":629,"question":"In an information security audit, which of the following is a check item for confirming availability?","answer_label":"Managing and maintaining the level of SLA that defines downtime","answer_id":5352},{"id":485,"question":"In an information security audit, which of the following is a check item for confirming availability?","answer_label":"Interruption duration to be managed so that the standard of the SLA specifying the\ninterruption duration can be satisfied","answer_id":5841},{"id":6401,"question":"Which of the following is an appropriate description concerning a characteristic of job scheduling in a computer system?","answer_label":"In a system on which interactive processing and batch processing are mixed, it is expected that the response performance of interactive processing is improved by giving a higher priority to interactive processing.","answer_id":25730},{"id":1638,"question":"An IT service is provided under the conditions described below. In order to meet the SLA, which of the following is the maximum allowable downtime (in hours) per month during service hours? Here, the number of business days in a month is 30, and there is no planed service outage for a reason of maintenance or something similar during the service hours.\n\n  [Conditions of the SLA]\n    • Service hours: 8 a.m. to 10 p.m. on business days\n    • Availability: 99.5% or more","answer_label":"2.1","answer_id":7680},{"id":13828,"question":"An information security audit was performed about the security when backup media that contain confidential information are handed over to a vendor for external storage. Among situations that are identified as a result of this audit, which of the following is a situation that the auditor should record in the audit report as a finding?","answer_label":"The person in charge at the outsourcer puts the backup media in a cardboard box and hands it over to the vendor.","answer_id":53563},{"id":13827,"question":"Among situations that are identified as results of performing an ISMS internal audit on the basis of ISO/IEC 27001:2013 (Information security management systems—Requirements), which of the following is a situation that the auditor should record in the audit report as a finding?","answer_label":"After a risk assessment was performed, risk acceptance criteria were determined.","answer_id":53558},{"id":829,"question":"According to the Capability Maturity Model Integration, which is the final stage and has the highest level of maturity?","answer_label":"Optimized","answer_id":4792},{"id":625,"question":"In IT service management, which of the following is a problem management activity that performed proactively?","answer_label":"Analyzing the occurrence trend of incidents and proposing measures that prevent an incident from occurring in the future","answer_id":5366},{"id":4338,"question":"Which of the following is an appropriate statement in regard to operation of a distributed system?","answer_label":"A dedicated administrator is assigned in the same manner as in a centralized system to manage common resources such as databases.","answer_id":18213},{"id":2069,"question":"Among the management functions for service support, which of the following has the objective that aims to restore agreed service to the business as soon as possible or to respond to service requests?","answer_label":"Incident management","answer_id":9436},{"id":767,"question":"Which of the following is an appropriate activity that is undertaken by a system auditor who audits access control?","answer_label":"Confirmation of the management status of the access control concerning the data","answer_id":5042},{"id":628,"question":"Among the implementation structures of a system audit, which of the following is the most important to avoid from the standpoint of the independence of a system auditor?","answer_label":"Mr. A of the general affairs department, who was appointed as a member of the audit team, audits the status of entrance and exit control for the general affairs department together with other team members.","answer_id":5354},{"id":4813,"question":"As shown below, a shop purchases and sells a certain type of product.\n![](https://learn.viblo.asia/uploads/5/3/537be483-e10a-4bf8-8e03-c3921583bf1c.png)\nHow many units are sold at a “break even” point, where there is neither a profit nor a loss?","answer_label":"200","answer_id":19888},{"id":5129,"question":"Which of the following is a service delivery process that is defined, agreed, recorded, and managed in IT service management?","answer_label":"Service level management","answer_id":20992},{"id":2068,"question":"Which of the following is an appropriate policy for creating an SLA?","answer_label":"Setting a service level under the cost and needs of a service provider and its customers","answer_id":9433},{"id":768,"question":"Which of the following is subject to system audits that evaluate and verify the internal control related to IT?","answer_label":"The methods for ensuring accuracy in the processes of input and update of a database performed by the sales department","answer_id":5038},{"id":1641,"question":"Which of the following is a measure that enables an operator to surely recognize the occurrence of a system fault?","answer_label":"To provide functions to sound an alarm or light indicator lamps, linked to an alarm or\r\nother message sent to the system console","answer_id":7694},{"id":5206,"question":"When an application program has functions and characteristics shown in the table below, which of the following is the function point value of the program? Here the correction coefficient of complexity is 0.5.\n![](https://learn.viblo.asia/uploads/4/0/405d69a6-6f7e-4105-9f32-d07512ff8d87.png)","answer_label":"12","answer_id":21298},{"id":5204,"question":"Which of the following is an appropriate explanation concerning a milestone in project management?","answer_label":"A milestone is a major event in a project schedule that is easily identifiable by such things as the completion of a significant deliverable and the occurrence of an event.","answer_id":21289},{"id":3489,"question":"According to ISO/IEC 20000-1:2011 (Information technology – Service management – Part 1: Service management system requirements), which of the following refers to an unplanned interruption to a service, a reduction in the quality of a service, or an event that has not yet impacted the service to the customer?","answer_label":"Incident","answer_id":14878},{"id":484,"question":"According to ITIL, which of the following is a description of a virtual service desk among the characteristics of a service desk organization?","answer_label":"By using communication technology, services can be provided from a single service\ndesk as observed by the user, even if the service desk staff members are distributed\nacross multiple regions.","answer_id":5796},{"id":5207,"question":"Which of the following is the project management knowledge area that includes the processes of creating a staffing management plan, acquiring project team, developing project team, and managing project team?","answer_label":"Human resource management","answer_id":21302},{"id":2020,"question":"Which of the following is subject to system audits that evaluate and verify internal control related to IT?","answer_label":"The methods for ensuring accuracy in the processes of input and update of the database\nbeing done by the sales department","answer_id":9238},{"id":5133,"question":"In a system audit, which of the following acts as audit evidence?","answer_label":"System operation records obtained by the audit team from the audited department","answer_id":21008},{"id":13826,"question":"Which of the following is an effective means of protecting an information system from the damage from over-voltage that occurs because of alightning strike","answer_label":"Connecting the communication cable and the computer through a surge protection device (SPD)","answer_id":53554},{"id":5130,"question":"When there are several business systems available in a company, which of the following is the most appropriate method for access control?","answer_label":"Irrespective of the user’s job title, the appropriate access rights are set in each business system on the basis of the user’s job role.","answer_id":20995},{"id":2823,"question":"Among the structures and characteristics of a service desk organization, which of the following is a description of a local service desk?","answer_label":"By deploying the service desk near the users, it is possible to provide services for users who have different languages and cultures or for VIPs by dedicated service staff.","answer_id":12292},{"id":2081,"question":"Which of the following is an appropriate explanation concerning product innovation in the management of technology?","answer_label":"Developing a new or differentiated product that is a key to success","answer_id":9482},{"id":13825,"question":"In service management, which of the following is a requirement of service level management?","answer_label":"A service catalog and SLA are created for the service to be provided, and they are agreed upon with the customer.","answer_id":53551},{"id":3668,"question":"When IT controls are classified into the two categories of preventive control and detective control, which of the following falls into the category of detective control for discovering data entry errors or unauthorized actions?","answer_label":"Matching the output list of data entry results with the data entry sheets","answer_id":15589},{"id":6400,"question":"Which of the following is the most appropriate description concerning a “watch list” of system failures?","answer_label":"System operators also monitor processing delays, because such delays can cause system failures.","answer_id":25728},{"id":2967,"question":"Which of the following is an effective means of protecting an information system from the damage of over-voltage that occurs because of a lightning strike?","answer_label":"Connecting the communication cable and the computer through a surge protection device (SPD)","answer_id":12853},{"id":1643,"question":"Which of the following is an appropriate description concerning the role of a system auditor?","answer_label":"It is to assure the preparation and operations regarding the control of the information\r\nsystem or to give advice on these, from a standpoint of professional standpoint\r\nindependent from the audit target","answer_id":7699},{"id":2970,"question":"Which of the following is an explanation of audit work papers?","answer_label":"It is an execution record of the auditing procedure implemented by an auditor, and it forms the basis of the audit opinion.","answer_id":12868},{"id":1642,"question":"Which of the following is an appropriate description concerning an interview conducted during a system audit?","answer_label":"Efforts are made to get documents and records that support the information which has\r\nbeen obtained from the departments under audit through the interview","answer_id":7695},{"id":482,"question":"Which of the following device is used for protecting power supply circuits, communication devices, or other equipment from the overvoltage and the over current generated from the overvoltage?","answer_label":"SPD","answer_id":5850},{"id":6160,"question":"Which of the following is an appropriate responsibility of a system auditor for problems found during an audit?","answer_label":"Reporting the problems found to the audit requester","answer_id":24856},{"id":2965,"question":"When the development department and operations department of a system are organized separately, which of the following is an appropriate method of smoothly and effectively proceeding with the design and migration of a new service that needs system development?","answer_label":"The operations department also participates actively in the extraction of requirements concerning the system operations.","answer_id":12848},{"id":626,"question":"Among the structures and the characteristics of a service desk organization, which of the following is a description of a local service desk?","answer_label":"By locating a service desk near the users, it is possible to provide support for users who speak different languages or come from different cultures, and to provide support for VIPs by dedicated staff.","answer_id":5362},{"id":3490,"question":"An IT service is provided under the conditions described below. In order to meet the SLA, the maximum allowable downtime should be less than how many hours during the service hours per month? Here, the number of business days in a month is 30.\n\n[Conditions of the SLA]\n- Service hours: 7 a.m. to 9 p.m. (i.e. 14 hours per day) on each business day\n- Availability: 99.5% or more","answer_label":"2","answer_id":14883},{"id":766,"question":"Which of the following is the system audit implementation structure that should be avoided from the standpoint of independence of the system auditors?","answer_label":"A person in the general affairs department, who is appointed as a member of the audit team, audits the status of the entrance and exit control in the general affairs department, together with the other members.","answer_id":5048},{"id":763,"question":"Which of the following is the most appropriate description concerning a backup method for data in a new system?","answer_label":"In consideration of a possible increase in the response time in the business processes, the backup schedule is adjusted so that it does not overlap with the business processes.","answer_id":5058},{"id":1897,"question":"When software asset management is audited, which of the following is the most appropriate point to be checked?","answer_label":"Checking to see whether evidence, such as a software license certificate, is properly\nRetained","answer_id":8796},{"id":5208,"question":"According to ISO/IEC 20000 (Information technology – Service management), which of the following is a process that has the objective to define and control the components of the service and infrastructure and to maintain accurate information on such components?","answer_label":"Configuration management","answer_id":21306},{"id":805,"question":"ABC company applies a three-generation backup policy. The ABC company’s system automatically performs full back up on the 10th, 17th, and 25th of each month. If the latest back up was performed on 17th September, what is the date that the oldest information was backed up?","answer_label":"25th August","answer_id":4891},{"id":3491,"question":"Company A issues an ID in the format shown below in the member registration processing. The table below shows the transition of the number of IDs issued by the end of each fiscal year. When this trend is assumed to continue in the future, in which fiscal year is Company A expected to run out of IDs in this format? Here, the IDs of resigned members are managed as vacant numbers and are not reused.\n\n[Format of the ID]\nXXNNN (e.g., AZ059)\n- For X, use an uppercase alphabetic character (A through Z).\n- For N, use a number (0 through 9).\n\n[Transition of the cumulative number of IDs issued by the end of each fiscal year]\n![](https://learn.viblo.asia/uploads/8/6/86ef85ff-92f2-4cc5-8c13-520ae714b681.png)","answer_label":"Fiscal year 2013","answer_id":14888},{"id":3492,"question":"When a hearing is conducted during a system audit, which of the following is the appropriate action to be taken by a system auditor?","answer_label":"When a problematic matter is found as a result of the hearing, backup data is collected and on-site investigations are conducted.","answer_id":14891},{"id":1852,"question":"Which of the following is an explanation of a “known error” in IT service management?","answer_label":"A problem whose root cause is already identified or for which a workaround exists","answer_id":8616},{"id":2969,"question":"Which of the following is the most appropriate description concerning an interview that is conducted by a system auditor?","answer_label":"The system auditor makes an effort to obtain documents and records that support the information obtained from the audited department during the interview.","answer_id":12864},{"id":4815,"question":"Which of the following is the diagram showing results of cluster analysis?\n![](https://learn.viblo.asia/uploads/9/e/9e7c8ff6-b59e-487d-b039-d6694680e814.png)","answer_label":"a","answer_id":19894},{"id":483,"question":"Which of the following is an appropriate precaution to be observed when monitoring the use of the capacity and performance of an online system in the capacity management process of IT service management?","answer_label":"Multiple measurement items such as the response time and CPU utilization are\nmonitored on a regular basis.","answer_id":5845},{"id":5128,"question":"According to the ISO/IEC 20000 series, which of the following has the objective that aims to minimize disruption to the business by proactive identification and analysis of the cause of incidents and by managing problems to closure?","answer_label":"Problem management","answer_id":20988},{"id":823,"question":"A data backup system must support restoring all transactions until 5 minutes before a disaster happens. What type of goal is this?","answer_label":"Recovery point objective","answer_id":4815},{"id":5203,"question":"When 50% of the undefined specifications are defined each time a prototype is created, how many prototypes should be created to define over 90% of the specifications that are undefined at the start of prototyping?","answer_label":"4","answer_id":21288},{"id":3402,"question":"Which of the following is an appropriate explanation of an audit working paper?","answer_label":"It is an implementation record of the auditing procedure performed by an auditor, which forms the basis of the audit opinion.","answer_id":14534},{"id":2071,"question":"When software asset management is audited, which of the following is an appropriate point to be checked?","answer_label":"Checking to see if evidence, such as a software license certificate, is properly filed and retained","answer_id":9443},{"id":2968,"question":"Among the statuses found through auditing the operation management of the system operations, which of the following must be described in the audit report as a finding?","answer_label":"The operator decides a daily operation plan and approves it himself.","answer_id":12857},{"id":1769,"question":"According to the ISO/IEC 20000-1, which of the following is a service delivery process that the service provider shall agree the services to be delivered and shall agree a catalogue of services with the customer?","answer_label":"Service level management","answer_id":8286},{"id":3488,"question":"When the number of programs composing the system and the number of person-days required for coding per program are as shown in the table below, what is the minimum number of staff members required to develop the system in 95 days? Here, in addition to coding, the activities of design and testing are also necessary to develop the system, and those activities require eight times as many person-days as coding.\n![](https://learn.viblo.asia/uploads/a/d/ad4d3aed-b763-4396-9677-26dbb5811385.png)","answer_label":"9","answer_id":14875},{"id":1773,"question":"Which of the following is a checkpoint during audit of a control for reducing the risk of system trouble during the application of a software patch?","answer_label":"System operation is properly checked before commencing full-time operations.","answer_id":8301}]