[{"id":13555,"question":"Lựa chọn nào sau đây là lời giải thích cho BYOD (Mang thiết bị của riêng bạn)?","answer_label":"Sử dụng các thiết bị thông tin riêng của nhân viên để làm việc","answer_id":52472},{"id":13907,"question":"Lựa chọn nào sau đây là một điểm kiểm tra (checkpoint) trong quá trình kiểm định việc kiểm soát nhằm giảm nguy cơ của sự cố hệ thống khi áp dụng bản vá lỗi phần mềm?","answer_label":"Việc vận hành hệ thống được kiểm tra một cách thích đáng trước khi bắt đầu hoạt động trọn thời gian.","answer_id":53880},{"id":13909,"question":"Lựa chọn nào sau đây là sự đánh giá khả thi phù hợp khi kiểm tra liệu lợi ích suốt đời của hệ thống thông tin được đề xuất có lớn hơn chi phí suốt đời của nó?","answer_label":"Khả thi về kinh tế","answer_id":53886},{"id":13520,"question":"Lựa chọn nào sau đây là một trình tự hợp lý của thủ tục lập mô hình kinh doanh?\n\tA.\tGắn quy trình nghiệp vụ với một tổ chức hiện tại\n\tB.\tLàm rõ quy trình nghiệp vụ\n\tC.\tGắn quy trình nghiệp vụ với một hệ thống thông tin\n\tD.\tLàm rõ lớp dữ liệu (mô hình thông tin)\n\tE.\tGắn quy trình nghiệp vụ với một lớp dữ liệu","answer_label":"B → D → E → C → A","answer_id":52331},{"id":13556,"question":"Công việc nào sau đây được thực hiện khi các yêu cầu phi chức năng được xác định?","answer_label":"Tạo ra các yêu cầu kỹ thuật cho các tiêu chí và tiêu chuẩn phát triển theo ngôn ngữ lập trình được sử dụng trong phát triển hệ thống","answer_id":52476},{"id":14131,"question":"Điều nào sau đây là một lời giải thích của SOA?","answer_label":"SOA tạo điều kiện đáp ứng với những thay đổi nghiệp vụ bằng cách xây dựng phần mềm từ các thành phần được gọi là dịch vụ.","answer_id":54599},{"id":14134,"question":"Điều nào sau đây là hành động thích hợp nhất cần được thực hiện để loại bỏ \"khoảng cách số\"?","answer_label":"Tăng cường các cơ hội học tập kiến thức thông tin, và chuẩn bị một môi trường để tạo điều kiện thuận lợi hơn cho việc sử dụng thiết bị thông tin và viễn thông cùng với các dịch vụ thông tin","answer_id":54611},{"id":13521,"question":"Lựa chọn nào sau đây là một mô tả thích hợp về điện toán đám mây?","answer_label":"Đó là một mô hình cho phép việc truy cập phổ biến, thuận tiện, theo yêu cầu vào một vùng chia sẻ chứa các tài nguyên máy tính có thể cấu hình được","answer_id":52336},{"id":13553,"question":"Lựa chọn nào sau đây là một biện pháp để đánh giá rủi ro của việc giảm chất lượng bảo trì và vận hành hệ thống trong quá trình gia công phần mềm của một dịch vụ CNTT?","answer_label":"Các hoạt động cải tiến chất lượng dịch vụ được tiến hành bằng cách đồng ý với mức chất lượng mong muốn với nhà thầu phụ bằng cách sử dụng các chỉ số chứng minh chất lượng dịch vụ.","answer_id":52465},{"id":13523,"question":"Lựa chọn nào sau đây là công việc được thực hiện khi xác định các yêu cầu không liên quan đến chức năng?","answer_label":"Tạo ra các tiêu chí và tiêu chuẩn phát triển dựa trên ngôn ngữ lập trình được sử dụng trong phát triển hệ thống","answer_id":52343},{"id":13522,"question":"Lựa chọn nào sau đây gồm các tầng được quản lý bởi nhà cung cấp khi sử dụng IaaS?","answer_label":"Ảo hóa, Các máy phục vụ, Lưu trữ, Kết nối mạng","answer_id":52341},{"id":13552,"question":"Lựa chọn nào sau đây đại diện cho một phần của tổng chi phí sở hữu (TCO) cho Phần mềm như một dịch vụ (SaaS)?","answer_label":"Chi phí di chuyển dữ liệu","answer_id":52459},{"id":13551,"question":"Lựa chọn nào sau đây là kỹ thuật được sử dụng để thực hiện phân bổ nguồn lực tối ưu cho đầu tư máy tính hóa trong từng loại được phân loại dựa trên những điểm tương đồng về rủi ro và giá trị đầu tư?","answer_label":"Danh mục CNTT","answer_id":52457},{"id":13908,"question":"Khi các biểu dữ liệu do bộ phận nghiệp vụ ban hành được nhập vào hệ thống trong bộ phận hệ thống thông tin, lựa chọn nào sau đây là một nhiệm vụ thích hợp được thực hiện bởi bộ phận hệ thống thông tin?","answer_label":"Để bộ phận nghiệp vụ có thể kiểm tra được kết quả xử lý từng biểu dữ liệu, danh sách kết quả xử lý được gửi đến bộ phận nghiệp vụ.","answer_id":53883},{"id":14133,"question":"Trong việc lập kế hoạch đầu tư tin học hóa, điều nào sau đây là một lời giải thích của ROI - một chỉ số đánh giá về giá trị đầu tư?","answer_label":"ROI là một số đo được tính bằng cách chia lợi nhuận, được tạo ra thông qua các yếu tố, chẳng hạn như tăng doanh thu và giảm chi phí, cho số tiền đầu tư","answer_id":54607},{"id":13554,"question":"Lựa chọn nào sau đây là đặc điểm của dịch vụ lưu trữ?","answer_label":"Quyền sử dụng của một máy chủ do một nhà cung cấp dịch vụ chuẩn bị được cung cấp cho người sử dụng.","answer_id":52468},{"id":14132,"question":"Điều nào sau đây là một mô tả thích hợp của BPR ((Business Process Reengineering)?","answer_label":"BPR là một kỹ thuật quản lý được sử dụng để thiết kế lại và tái cơ cấu các quá trình tạo ra giá trị trong một tổ chức nhằm đạt được lợi ích đáng kể về năng suất, lợi nhuận, dịch vụ và chất lượng thông qua việc tối đa tiềm năng của các cá nhân và nhóm.","answer_id":54605}]