[{"id":4687,"question":"Which of the following is an item to be performed in the requirements definition process of system development?","answer_label":"Clarifying the procedures and rules of new business operations together with the constraints, and obtaining agreement between stakeholders","answer_id":19429},{"id":2074,"question":"Among the architectures included in the “four domains” of the enterprise architecture, which of the following is the architecture other than business architecture, technology architecture, and application architecture?","answer_label":"Data architecture","answer_id":9455},{"id":4410,"question":"![](https://learn.viblo.asia/uploads/3/a/3aff42ba-65d6-4f25-ba67-bf43c779720f.png)","answer_label":"A","answer_id":18448},{"id":730,"question":"Which of the following is an appropriate example of utilizing an RFID?","answer_label":"Identification and management of personnel or items by using a very small wireless chip","answer_id":5191},{"id":1777,"question":"Among the “four categories” of the enterprise architecture, which of the following completes the list after business architecture, technology architecture, and application architecture?","answer_label":"Data architecture","answer_id":8316},{"id":2830,"question":"Which of the following is an explanation of SOA?","answer_label":"It is a concept that considers the functions of software as components called services, and combines these services in order to develop application systems.","answer_id":12319},{"id":5211,"question":"Which of the following is an appropriate description concerning the implementation structure of a system audit?","answer_label":"The auditor reports the results of the audit to the requester so that the requester can give instructions for improvement based on the audit report.","answer_id":21319},{"id":494,"question":"Which of the following is an appropriate explanation of the technology S-curve?","answer_label":"It represents the process of technology progress. It shows that technology advances\nslowly at the beginning and then advances rapidly; thereafter, its progress gently\nbecomes stagnant.","answer_id":5806},{"id":491,"question":"The RFP is presented to each vendor that has responded to an RFI. Which of the following should be done beforehand to proceed fairly with the future vendor selection processes?","answer_label":"Establishing processes of selection such as setting evaluation standards or weighting\nrules of conformity to the request items.","answer_id":5817},{"id":3408,"question":"Which of the following is the most appropriate action to be taken in order to eliminate the “digital divide”?","answer_label":"ncreasing learning opportunities for information literacy, and preparing an environment to further facilitate the use of information and telecommunications equipment along with information services","answer_id":14556},{"id":2973,"question":"Which of the following is an example of usage of big data by a company?","answer_label":"A large amount of text on various social media channels is analyzed, and the products are improved.","answer_id":12877},{"id":3406,"question":"Which of the following is an appropriate description of BPR (Business Process Reengineering)?","answer_label":"BPR is a management technique that is used to redesign and restructure the value-creating processes in an organization in order to gain significant benefits in productivity, profitability, service, and quality through maximizing the potential of individuals and teams.","answer_id":14550},{"id":4686,"question":"When a computerization plan is made, which of the following is an item to be considered?","answer_label":"Clarifying the cost and investment effect of development, maintenance, and operations","answer_id":19424},{"id":2976,"question":"Which of the following is an explanation of green procurement?","answer_label":"It refers not only to the fulfillment of the requirements of quality and price but to the preferential purchase of products and services with the lower environmental burden from companies that work toward a reduction in their environmental impact.","answer_id":12889},{"id":3356,"question":"An IT service is provided under the conditions described below. In order to meet the\nSLA, which of the following is the maximum allowable downtime (in hours) per\nmonth during service hours? Here, the number of business days in a month is 30.\n\n[Conditions of the SLA]\n• Service hours: 8 a.m. to 10 p.m. on business days\n• Availability: 99.5% or more","answer_label":"2","answer_id":14359},{"id":487,"question":"Which of the following is an explanation of Enterprise Architecture (EA)?","answer_label":"It is a technique to analyze each business operation and information system through the\nfour (4) systems of business, data, application, and technology and reexamine it from the\nviewpoint of total optimization.","answer_id":5833},{"id":623,"question":"In order to analyze the trend of issues that occur in a project, the number of issues by management item, such as the stakeholders, cost, schedule, quality, etc., are arranged in order starting with the highest number of issues in the form of a bar graph, and a diagram is prepared in which the number of issues accumulated in this order are superimposed in the form of a line graph. Which of the following is this diagram?","answer_label":"Pareto diagram","answer_id":5376},{"id":5213,"question":"Which of the following is an appropriate measure that management takes to guarantee the apparent independence of internal system auditors?","answer_label":"Placing the department of auditors under the direct control of management","answer_id":21327},{"id":5214,"question":"The “four domains” of enterprise architecture include business architecture, technology architecture, application architecture, and one other. Which of the following is the one remaining architecture?","answer_label":"Data architecture","answer_id":21330},{"id":6163,"question":"Which of the following is the service provided by ASPs?","answer_label":"Services to provide a variety of functions of a general-purpose application system to multiple customers over a network","answer_id":24868},{"id":3405,"question":"Which of the following is an explanation of SOA?","answer_label":"SOA facilitates response to business changes by constructing software from components called services.","answer_id":14544},{"id":6162,"question":"Which of the following is an explanation of BPR?","answer_label":"Redesigning the business processes from a customer perspective, by making full use of information technology to radically change the characteristics and structure of the company","answer_id":24864},{"id":1776,"question":"Which of the following is a usage scenario for the adoption of UML as a technique for visualizing business processes?","answer_label":"To represent processes from multiple viewpoints, some purpose-specific modeling methods are used, and each model is depicted by using standardized notation rules for object modeling.","answer_id":8313},{"id":635,"question":"Which of the following is an explanation of the non-functional requirements definition?","answer_label":"It clearly identifies the quality requirements, technical requirements, and operational requirements necessary to implement business requirements.","answer_id":5329},{"id":3359,"question":"Which of the following is a management approach or technique that can be used for\nredesigning and restructuring the value-creating processes in an organization in order\nto gain significant benefits in productivity, profitability, service, and quality through\nmaximizing the potential of individuals and teams?","answer_label":"BPR","answer_id":14373},{"id":3360,"question":"Which of the following is an explanation of SaaS?","answer_label":"It is a service where the user can use the functions of application software via the\nInternet only when necessary.","answer_id":14374},{"id":1647,"question":"Which of the following is an explanation of the green procurement (sustainable procurement)?","answer_label":"It refers to a preferential purchase of products and services that exert a lower\r\nenvironmental burden","answer_id":7717},{"id":621,"question":"Which of the following is the technique for estimating activity durations where past information is statistically analyzed and various coefficients are determined?","answer_label":"Parametric estimate","answer_id":5384},{"id":1645,"question":"Which of the following is the cloud-computing service model that allows users to install operating-system images and their application software on the system?","answer_label":"Infrastructure as a service (IaaS)","answer_id":7708},{"id":1778,"question":"Which of the following is an appropriate explanation of EMS?","answer_label":"It refers to the contract production of electronic devices, etc. ordered by other manufacturers.","answer_id":8321},{"id":6165,"question":"Which of the following is an explanation of digital divide?","answer_label":"It refers to economic or social disparities caused by differences in capabilities or opportunities to use PCs and telecommunications.","answer_id":24877},{"id":780,"question":"Which of the following is a description of CGM (Consumer Generated Media)?","answer_label":"It enables the delivery of the digital contents prepared by an individual to a viewer or audience and its sharing between the users.","answer_id":4991},{"id":633,"question":"Which of the following is an explanation of SaaS?","answer_label":"It is a service where the user uses the functions of application software via the Internet only when necessary.","answer_id":5334},{"id":3354,"question":"Which of the following is a characteristic of the one-time (or big bang) migration\nmethod that is one of the system migration methods?","answer_label":"A problem during migration has a very large impact on the new system.","answer_id":14350},{"id":2827,"question":"Which of the following is the purpose of BPM (Business Process Management) in the context of corporate activity?","answer_label":"Continual improvement of business processes","answer_id":12308},{"id":2975,"question":"Which of the following is the activity that translates the information gathered during analysis activities into a document as a set of requirements?","answer_label":"Requirement definition","answer_id":12887},{"id":3403,"question":"Which of the following is an appropriate description concerning the implementation structure of a system audit?","answer_label":"In order to enable the person requesting the audit to issue improvement instructions based on the audit report, the system auditor reports the audit results to the person requesting the audit.","answer_id":14535},{"id":6300,"question":"![](https://learn.viblo.asia/uploads/c/b/cbb77354-ed29-44cd-a79e-00dbb093cd0f.png)","answer_label":"1,500","answer_id":25351},{"id":2061,"question":"According to the ISO/IEC 25010 standard, the quality properties of a software product or system are categorized into eight characteristics: functional suitability, performance efficiency, compatibility, usability, reliability, security, maintainability, and portability. Which of the following is the appropriate explanation of “performance efficiency”?","answer_label":"Degree to which a product or system provides capabilities relative to the amount of resources used under stated conditions","answer_id":9403},{"id":13830,"question":"Among the “four categories ” of enterprise architecture, which of the following is the remaining one after business architecture, technology architecture, and application architecture","answer_label":"Data architecture","answer_id":53571},{"id":3351,"question":"A chart or a diagram is created to resolve a quality problem. After the trends of\nfactors are analyzed, it is determined whether more than 80% of all the factors belong\nto a small group of factors. Which of the following is effective for this purpose?","answer_label":"Pareto chart","answer_id":14340},{"id":5212,"question":"Which of the following is an appropriate description concerning an interview or a hearing that is conducted during a system audit?","answer_label":"The auditor should make an effort to get documents and records that confirm the information obtained from the department under audit during the interview.","answer_id":21322},{"id":4376,"question":"![](https://learn.viblo.asia/uploads/a/4/a432c63d-31d9-4f85-b465-3d62e6e768df.png)","answer_label":"b","answer_id":18358},{"id":3669,"question":"Which of the following is an explanation of EA (Enterprise Architecture)?","answer_label":"It is a technique to review respective business operations and information systems from the perspective of overall optimization through analysis of four key architectures — business, data, application, and technology.","answer_id":15594},{"id":3352,"question":"Which of the following is an appropriate description of how to estimate person-months\nin software development?","answer_label":"In the function point method, the function points are defined and classified on the\nbasis of external input, external output, internal logical file, external interface file,\nand external inquiry.","answer_id":14344},{"id":3671,"question":"A scoring model is a method for quantifying qualitative evaluation items. Based on the four-level scoring model and evaluation items shown in the table below, which of the following indicates the goal achievement level of the entire system in percentage?\n![](https://learn.viblo.asia/uploads/7/2/725c70e2-9775-4d6d-9a0c-43a3ce75d631.png)","answer_label":"36","answer_id":15600},{"id":13829,"question":"In the system design stage, which of the following is the point to be checked during the audit of control for reducing the risk of non-fulfillment of user requirements","answer_label":"The user department must participate in the review of the system design.","answer_id":53569},{"id":632,"question":"Which of the following is an explanation of BPM?","answer_label":"To incorporate the management cycle of analysis, design, execution, and improvement into business processes in order to continuously execute improvement and revision of business processes","answer_id":5340},{"id":1644,"question":"Which of the following is an appropriate explanation of BPO?","answer_label":"Contracting out all business processes of a company’s specific department, such as an\r\nadministrative department or call center, to an external service provider, together with\r\nthe operations of a business system","answer_id":7703},{"id":13831,"question":"The weighted comprehensive evaluation method is used to integrate and quantify the evaluation scores of multiple items for quantitatively evaluating the effect of improvements. Which of the following is the improvement proposal that should be prioritized in the table below\n![](https://learn.viblo.asia/uploads/d/5/d56dfd56-5e9c-4153-bd9b-79dafa1f1795.png)","answer_label":"Proposal 2","answer_id":53575},{"id":5215,"question":"Which of the following is the purpose of BPM that is a management approach in a company or an organization?","answer_label":"Continuous improvement of a company’s operational processes","answer_id":21334},{"id":2972,"question":"Which of the following is an explanation of SOA?","answer_label":"It is a system architecture that provides the components of a business process and its supporting IT infrastructure in the form of a service.","answer_id":12875},{"id":3670,"question":"The diagram below shows the procedure for business improvement in six steps. When activities “a)” through “d)” are to be inserted into the blank boxes A through D, which of the following is the activity inserted in the blank box C ?\n![](https://learn.viblo.asia/uploads/c/2/c2fc78db-4e9d-4d8c-b221-1c6a39cf4115.png)","answer_label":"Develop improvement plan","answer_id":15595},{"id":4438,"question":"From a viewpoint of corporate management, which of the following is an explanation of BPM?","answer_label":"The management cycle of analysis, design, execution, and improvement is incorporated into business processes so that business processes can be continuously reviewed for improvement and integrated with optimum processes.","answer_id":18555},{"id":2067,"question":"Which of the following is an explanation concerning a Pareto chart?","answer_label":"It is used to identify problems by sorting the classified items in descending order of frequency of occurrence and illustrating a bar chart with a cumulative line chart","answer_id":9426},{"id":2021,"question":"Which of the following is an appropriate description of cloud computing?","answer_label":"It is a model for enabling ubiquitous, convenient, on-demand access to a shared pool of\nconfigurable computing resources","answer_id":9244},{"id":1899,"question":"Which of the following is an appropriate combination of layers managed by vendors when using IaaS?","answer_label":"Virtualization, Servers, Storage, Networking","answer_id":8806},{"id":5209,"question":"Which of the following is an appropriate description concerning data backup?","answer_label":"Backup processing should not overlap with ordinary business processing in order to guarantee the integrity of backed-up data.","answer_id":21312},{"id":489,"question":"Which of the following is a purpose of Business Process Management (BPM) in corporate activities?","answer_label":"Continuous improvement of business processes","answer_id":5826},{"id":4685,"question":"Which of the following enables users to connect to the system of a service provider via the Internet and make online use of the necessary functions of the applications that are offered by the service provider as needed?","answer_label":"SaaS (Software as a Service)","answer_id":19421},{"id":2080,"question":"Which of the following is the primary purpose of implementing an ERP system that is used for business management?","answer_label":"To integrate all departments and functions across a company into a single computer system that can serve the entire company’s needs","answer_id":9479},{"id":3358,"question":"Which of the following is an appropriate way of selecting systems that are subject to an\naudit based on risk assessment?","answer_label":"Systems that have a high possibility of occurrence of a problem and are significantly\naffected by the problem are subject to the audit.","answer_id":14369},{"id":2971,"question":"The table below shows the result of analyzing the activities of a sales representative on one (1) particular day. By installing Sales Force Automation (SFA), preparation time for customer visits can be reduced by 0.1 hours per customer visit. In order to increase the number of customer visits to six (6) per day without changing the total working hours and the hours per customer visit, how many hours must be reduced from “Other operation”?\n![](https://learn.viblo.asia/uploads/f/8/f8704eeb-a0d2-46aa-be9e-21a1e1f6a037.png)","answer_label":"0.7","answer_id":12871},{"id":6164,"question":"Which of the following is an activity concerning a model of business operations developed during the overall planning of information systems?","answer_label":"Associating business processes with data classes","answer_id":24870},{"id":3355,"question":"Which of the following is the primary purpose of the problem management process that\nis defined by ITIL v3?","answer_label":"To trace and eliminate the root cause of an incident, and to prevent the recurrence of\nthe incident","answer_id":14357},{"id":631,"question":"Concerning computerization costs, which of the following is the cost that indicates the running cost?","answer_label":"The maintenance cost of information-processing equipment, such as a server","answer_id":5345},{"id":4688,"question":"Which of the following is an appropriate explanation of the benchmarking used for corporate management?","answer_label":"Understanding products, services, and operations of the company qualitatively and\nquantitatively in comparison with those of the strongest competitor or a leading company","answer_id":19435},{"id":1775,"question":"Which of the following is an appropriate feasibility evaluation when checking whether the lifetime benefits of the proposed information system is greater than its lifetime costs?","answer_label":"Economic feasibility","answer_id":8307},{"id":3407,"question":"In computerization investment planning, which of the following is an explanation of the ROI that is an evaluation index for investment value?","answer_label":"ROI is a measure that is calculated by dividing the profit generated through factors, such as sales increase and cost reduction, by the amount of investment.","answer_id":14552},{"id":3357,"question":"When a version control system for source code is installed, which of the following is\nan appropriate item that should be added to system audit processes in order to check\nthe confidentiality of the source code?","answer_label":"The access control of the version control system must be set appropriately.","answer_id":14362},{"id":5210,"question":"In IT service management, which of the following is an activity that is performed as incident management?","answer_label":"Checking to see if a failure report from a user matches a known error","answer_id":21313},{"id":6166,"question":"Which of the following describes characteristics of the growth stage of the product life cycle?","answer_label":"The market begins to understand the value of the product. The company needs to expand its product lines and distribution channels. During this stage, sales increase but more investment is required.","answer_id":24881},{"id":2828,"question":"When a workflow system is used for business improvement, which of the following is an appropriate effect that can be expected?","answer_label":"Processing speed for office procedures from document submission to approval can be improved.","answer_id":12312},{"id":2829,"question":"The table below shows the result of analyzing the daily activities of a sales representative. By implementing SFA (Sales Force Automation), the preparation time for customer visits can be reduced by 0.1 hours per customer visit. In order to increase the number of customer visits to six (6) per day without changing the total working hours and the hours per customer visit, how many hours must be reduced from “Other working time”?\n![](https://learn.viblo.asia/uploads/7/d/7d5b6243-c350-45fb-ba49-f8d271db7ee8.png)","answer_label":"0.7","answer_id":12317},{"id":771,"question":"Which of the following is a description of the SOA?","answer_label":"A concept of constructing a system by considering the software functions as components called services and combining them","answer_id":5026},{"id":4415,"question":"![](https://learn.viblo.asia/uploads/4/f/4fece921-fc9f-467b-96e8-a52bd1401634.png)","answer_label":"b","answer_id":18465},{"id":3404,"question":"In the system design stage, which of the following is the point to be checked during the audit of control for reducing the risk of non-fulfillment of user requirements?","answer_label":"The user department should participate in the review of system design.","answer_id":14542},{"id":772,"question":"Which of the following is a scheme where the user establishes a connection to the system of a service provider via the Internet and makes online use of only the necessary functions of the applications provided by the service provider at the necessary time?","answer_label":"SaaS","answer_id":5023},{"id":3353,"question":"Which of the following is an appropriate inspection item that should be included in an\noperational test?","answer_label":"Ensuring that the system satisfies the requirements from the user’s viewpoint","answer_id":14349},{"id":1774,"question":"When data sheets issued by a business operations department are entered in a system in an information system department, which of the following is an appropriate task executed by the information system department?","answer_label":"To enable the business operations department to check the processing results of each data sheet, the processing results list is sent to the business operations department.","answer_id":8304},{"id":2974,"question":"Which of the following is an explanation of Business Intelligence (BI)?","answer_label":"It is a method of supporting the speedup of decision-making of a company by utilizing accumulated internal and external data through classification, processing, and analysis.","answer_id":12883},{"id":4439,"question":"Which of the following is an explanation of SOA (Service-Oriented Architecture)?","answer_label":"It is a concept that the functions of software are considered as components called services, and these services are combined together to construct a system.","answer_id":18560}]