[{"id":6386,"question":"Which of the following is the term that refers to collecting a large volume of data through a variety of corporate activities, organizing, integrating, and saving the data for specific purposes, and using it for decision-making support, for example?","answer_label":"Data warehouse","answer_id":25673},{"id":5191,"question":"Which of the following is used for encoding and interpreting binary files, images, video, and non-ASCII character sets within an e-mail message on the Internet?","answer_label":"MIME","answer_id":21238},{"id":2802,"question":"Which of the following is a secure communication protocol that provides a hybrid cryptosystem where public key cryptography is used to transfer a shared private key securely to the other side, and private key cryptography is used to encrypt subsequent communications for the remaining session?","answer_label":"SSL/TLS (Secure Socket Layer/Transport Layer Security)","answer_id":12209},{"id":3834,"question":"Which of the following is a computer network attack that can be classified as a DDoS attack?","answer_label":"All the computers infected by a virus send a large number of recursive queries simultaneously to a target computer when receiving a command from an attacker who is in a remote location.","answer_id":16226},{"id":3340,"question":"Which of the following is the attack where malicious input data is given to a Web\napplication to construct a database query or other data manipulation statements with the\naim of falsifying data or illegally acquiring information?","answer_label":"SQL injection","answer_id":14297},{"id":5113,"question":"Which of the following is a security measure where it is effective to confirm the destination address with the sender when an e-mail is sent?","answer_label":"A preventive measure against wrong transmission of e-mail","answer_id":20926},{"id":6130,"question":"As shown below, there are four relational database tables Product, Supplier, Sale, and Employee that are used for a database system in a retail store. Here, the solid and dotted lines indicate the primary and foreign keys, respectively. \n![](https://learn.viblo.asia/uploads/1/6/16f294ce-5e88-4522-b18c-2adc80db81da.png)","answer_label":"10,000","answer_id":24735},{"id":3333,"question":"Which of the following is the unit of atomicity that a DBMS must guarantee for the\nupdate of a database?","answer_label":"From the start of a transaction to its commit or rollback operation","answer_id":14268},{"id":1878,"question":"Which of the following is an appropriate description of Transmission Control Protocol (TCP)?","answer_label":"It is an end-to-end protocol but does not have any mechanism for congestion control.","answer_id":8720},{"id":3640,"question":"Which of the following protocols can be used to temporarily assign an IP address leased from the pool to the host that asks for an address or to repeatedly assign the same IP address to the host according to the MAC address of the host?","answer_label":"DHCP","answer_id":15476},{"id":13809,"question":"Which of the following is the result when person A sends an e-mail that is encrypted by person B’s public key to person B and person C? Here, these three persons have the public keys of all three persons, and all of them have their own private keys.","answer_label":"Only B can decrypt the encrypted e-mail using B’s own private key.","answer_id":53489},{"id":2954,"question":"Between a client and a web server, which of the following is used for inspecting the data that is sent from the client to the web server and blocking attacks such as SQL injection?","answer_label":"WAF","answer_id":12804},{"id":2939,"question":"In a DBMS, when multiple transaction programs update the same database simultaneously, which of the following is a technology that is used to prevent logical contradictions?","answer_label":"Exclusive control","answer_id":12741},{"id":6098,"question":"Which of the following subnet masks provides the minimum number of IP addresses available in the subnet to assign to devices that request a connection?","answer_label":"c) 255.255.255.252","answer_id":24608},{"id":4618,"question":"You are building a new database for a company with 10 departments. Each\ndepartment contains multiple employees. In addition, each employee might work for\nseveral departments. How should you logically model the relationship between the\ndepartment entity and the employee entity?","answer_label":"Create a new entry, create a one-to-many relationship from the employee to the new\nentry, and create a one-to-many relationship from the department entry to the new\nentry.","answer_id":19188},{"id":4619,"question":"Which of the following is an appropriate explanation concerning functions of\nkeywords in SQL?","answer_label":"“HAVING” specifies a search condition for an aggregate or a group.","answer_id":19191},{"id":471,"question":"Which of the following is an appropriate term for an organized and highly skilled team, whose mission is to continuously monitor and improve the organization’s security posture while preventing, detecting, analyzing, and responding to cyber security incidents with the aid of both technology and well-defined processes and procedures?","answer_label":"Security Operations Center (SOC)","answer_id":5895},{"id":822,"question":"A user has just received a file named “image.jpg.”\nWhen inspected more closely, it is revealed that the file name is actually “image.jpg                                 .exe,” with spaces between the fake .jpg suffix and the real .exe suffix.\nWhich of the following is the most appropriate term used to describe this type of attack?","answer_label":"Trojan horse","answer_id":4819},{"id":2808,"question":"Which of the following is the most effective method of detecting falsification of the contents of a web server?","answer_label":"The hash value of each file of the contents of the web server is stored and periodically compared with the hash value generated from each file.","answer_id":12232},{"id":3637,"question":"When a database on a client/server system is accessed, which of the following is the function that can reduce the network load by preparing the instruction groups beforehand that are frequently used on the server?","answer_label":"Stored procedure function","answer_id":15465},{"id":3642,"question":"When the subnet mask 255.255.255.240 is used for a server, which of the following is a valid IP address of the server?","answer_label":"195.206.108.25","answer_id":15485},{"id":4617,"question":"Which of the following is described graphically using an E-R diagram?","answer_label":"Entities and relationships between entities","answer_id":19185},{"id":2791,"question":"Which of the following is an explanation of the morphing technique in computer animation?","answer_label":"In order to represent a smooth transition between two images, multiple intermediate images are created for interpolation.","answer_id":12166},{"id":2054,"question":"Which of the following is an appropriate explanation concerning the security attack that is classified as DNS cache poisoning?","answer_label":"Incorrect domain information is injected into the DNS server referenced by a PC, which leads the PC user to a fake Web server","answer_id":9376},{"id":1834,"question":"Which of the following is a characteristic of the hash function that is used for a digital signature?","answer_label":"It is difficult to restore an original message from the message digest.","answer_id":8544},{"id":6420,"question":"When LAN analyzers are used for finding out the causes of network failures, which of the following is a point to keep in mind?","answer_label":"Some analyzers are capable of displaying packets that pass through networks. Therefore, it is necessary to be careful not to use them in different ways such as wiretapping.","answer_id":25809},{"id":3475,"question":"Which of the following is a technique of social engineering that obtains sensitive or confidential data by searching for residual data left in a computer after job execution or by examining discarded or stolen media such as printed papers, tapes, and discs?","answer_label":"Scavenging","answer_id":14823},{"id":4596,"question":"Last year, a company providing web application services needed an Internet line to\nservice clients’ demand at that time. However, in order to increase availability, the\ncompany actually made use of two Internet lines from different vendors. This year,\nthe demand is doubled and both lines are fully busy, so the company will install one\nmore Internet line. Each of the Internet lines has availability of 80%. What\npercentage of availability will be cut down after the installation?","answer_label":"7.8","answer_id":19101},{"id":4607,"question":"Which of the following can make MTBF longer in system maintenance?","answer_label":"To do preventive maintenance","answer_id":19144},{"id":13810,"question":"Which of the following is a package of unauthorized programs and tools that have functions such as creating a back door on a server and hiding the evidence of intrusion inside a server?","answer_label":"Rootkit","answer_id":53491},{"id":2794,"question":"In the process of table implementation, which of the following is an appropriate SQL statement that removes a column in an existing table?","answer_label":"ALTER TABLE table_name\n   DROP COLUMN column_name","answer_id":12176},{"id":3462,"question":"Which of the following is the appropriate SQL command that can be used to undo any changes made to the database since the last commit?","answer_label":"Rollback","answer_id":14773},{"id":2942,"question":"In the OSI basic reference model, which of the following is the layer where bridges operate?","answer_label":"Datalink layer","answer_id":12755},{"id":6419,"question":"Which of the following is an appropriate operations management method for user IDs and passwords?","answer_label":"For the purpose of preventing passwords from being abused by other people, it is so arranged that users become free to change their passwords at any time.","answer_id":25803},{"id":1823,"question":"There is a record that consists of eight attributes a through h as shown below. The primary key of the record is the combination of attributes a and b. Attributes h, c, and f\ncan be determined by attributes a, b, and e respectively. Which of the following is the third normal form of this record?\n\n![](https://learn.viblo.asia/uploads/7/6/7649bf77-9367-4954-8e2a-6f565957cc06.png)","answer_label":"c","answer_id":8501},{"id":3510,"question":"Which of the following is an international standard that defines an encoding algorithm used to compress still image data?","answer_label":"JPEG","answer_id":14963},{"id":13803,"question":"There is a PC whose IP address and subnet mask are shown below. Which of the following is the network address of this PC? \n\nIP address: 10.170.70.19 \nSubnet mask: 255.255.255.240","answer_label":"10.170.70.16","answer_id":53463},{"id":3839,"question":"Which of the following is a technique where a system is actually attacked and an intrusion attempt is made, with the aim of discovering security-related vulnerabilities of a computer or network?","answer_label":"Penetration test","answer_id":16243},{"id":2809,"question":"When a digital certificate has been installed in an in-house system accessed from a smartphone by an employee, which of the following can be checked using the in-house system?","answer_label":"Ensuring that the smartphone has been allowed to access the in-house system","answer_id":12237},{"id":4620,"question":"User A issues the command as follows:\n\nUPDATE cust_orders\nSET id = 200\nWHERE id = 1\n\nThen user B issues this command as follows:\n\nUPDATE cust_orders\nSET id = 300\nWHERE id = 1\n\nUser B informs you that his/her UPDATE statement seems to be hung.\nfollowing is a possible solution that you can find?","answer_label":"Ask user A to commit the transaction.","answer_id":19195},{"id":5179,"question":"Which of the following is the specification for dividing frequently-used functions of a Java program into reusable components that can be deployed in a network on any major operating system platform?","answer_label":"JavaBeans","answer_id":21191},{"id":463,"question":"Which of the following describes an IPv6 feature not existing in IPv4?","answer_label":"128-bit addressing is introduced for the IP address space.","answer_id":5912},{"id":3332,"question":"In a relational database, which of the following is an appropriate purpose of defining a\nforeign key?","answer_label":"To provide a constraint to maintain referential consistency between the records of\nrelated tables","answer_id":14263},{"id":3469,"question":"Which of the following is a connectionless protocol that offers speed and low overhead as its primary advantage in the transport layer of the OSI basic reference model?","answer_label":"UDP","answer_id":14801},{"id":2792,"question":"When new naming conventions for data items are provided, which of the following problems cannot be avoided only by the naming conventions described below?\n[Naming conventions]\n(1) Always add a classification word such as the “name”, “code”, “number”, “amount”, or “date” at the end of the data item name, and set the data type determined for each classification word.\n(2) Create a dictionary in which data item names and their meanings are registered, and ensure that synonyms and homonyms do not occur.","answer_label":"The scope of the possible values of the data item “OrderAmount” varies according to the table.","answer_id":12169},{"id":5108,"question":"Among the layers of the OSI basic reference model, which of the following is the appropriate layer that is primarily responsible for the translation, encryption, and compression of data?","answer_label":"Presentation layer","answer_id":20907},{"id":2019,"question":"Which of the following is the most appropriate sentence describing the difference between intermediate COCOMO and COCOMO II?","answer_label":"Intermediate COCOMO consists of one overall model based on lines of code, whereas\nCOCOMO II consists of three different models, depending on the available knowledge\nof product to be built.","answer_id":9234},{"id":3471,"question":"Which of the following is an appropriate combination of information that a DHCP server dynamically provides for a client host to participate in the TCP/IP network?","answer_label":"IP address, subnet mask, default gateway address, and DNS server address","answer_id":14808},{"id":465,"question":"Which of the following is a form of malware that requires a host in order to propagate from one computer to another?","answer_label":"Viruses","answer_id":5905},{"id":6002,"question":"There are two tables X and Y as shown below. Which of the following SELECT statements returns the maximum number of rows by using these two tables?\n![](https://learn.viblo.asia/uploads/2/3/23606d94-77f7-424d-9f1a-02b5079b968a.png)","answer_label":"a","answer_id":24219},{"id":814,"question":"Among the seven layers of the OSI basic reference model, which layer is responsible for forwarding packets, including routing them through intermediate routers?","answer_label":"The network layer","answer_id":4855},{"id":1882,"question":"Which of the following is a description of measures against information leakage?","answer_label":"The contents of the hard disk of a notebook PC are encrypted.","answer_id":8737},{"id":4799,"question":"As shown below, there are three tables Student, Instructor, and Result. Which of the following relational algebra operations can be used for deriving the table “Result” from the tables “Student” and “Instructor”?\n![](https://learn.viblo.asia/uploads/7/6/76bbdfda-a36e-4920-94ef-d5e8c45e5e7f.png)\n![](https://learn.viblo.asia/uploads/3/9/397ccf21-92aa-4e7e-aecd-6d8e96213703.png)","answer_label":"c","answer_id":19832},{"id":6418,"question":"Which of the following is an appropriate action to be taken when a computer virus is found?","answer_label":"First, the infected computer is disconnected from the relevant network, because other computers may be infected via the network.","answer_id":25799},{"id":2057,"question":"Which of the following is the security attack that is shown in the procedure below?\n\n[Procedure]\n\n(1) An attacker creates a bogus Web site under the disguise of a financial institution.\n\n(2) The attacker pretends to be an employee of the financial institution and sends an e-mail that describes a URL leading to the bogus Web site.\n\n(3) The recipient of the e-mail trusts the e-mail and clicks on the URL. The recipient is then led to the bogus Web site.\n\n(4) The recipient does not notice that the Web site is bogus, and the entered authentication information is passed to the attacker.","answer_label":"Phishing","answer_id":9389},{"id":2803,"question":"In a meeting session, the security administrator provides a presentation regarding risks on social media and recommends that the attendees not give unnecessary personal information on social media websites. From which of the following attacks do the social media users effectively reduce the security risk most by following this recommendation?","answer_label":"Cognitive password attack","answer_id":12212},{"id":13793,"question":"Among GUI components,which of the following is an appropriate use of a radio button?","answer_label":"To select one item from a group of mutually exclusive items","answer_id":53424},{"id":1616,"question":"In the operation of a relational database, which of the following is an appropriate explanation of projection?","answer_label":"Only specific columns are extracted from a table","answer_id":7592},{"id":4341,"question":"Which of the following protocols is used in a TCP/IP network to provide a virtual terminal function that enables remote login to a host for remote operation?","answer_label":"TELNET","answer_id":18228},{"id":5183,"question":"When the database design is divided into three phases (i.e., conceptual design, logical design, and physical design), which of the following is a part of the physical design?","answer_label":"Describing base relations, file organizations, and indexes used to improve query performance","answer_id":21208},{"id":5998,"question":"VLAN (Virtual LAN) is used to logically segment a LAN into different broadcast domains. In which of the following network devices should the function of VLAN be supported?","answer_label":"Switch","answer_id":24206},{"id":6405,"question":"Which of the following is a protocol for e-mail on the Internet that supports not only text but other data such as audio and images through message header extension?","answer_label":"MIME","answer_id":25748},{"id":2947,"question":"Which of the following is a spoofing attack?","answer_label":"An attack by masquerading as someone such as a superior person from an information systems department, or customer","answer_id":12775},{"id":5170,"question":"A system fails and recovers repeatedly over time, as shown in the figure below. Which of the following is the appropriate combination of the indicators or indexes that represent reliability and availability in RASIS?\n![](https://learn.viblo.asia/uploads/3/3/330ea3f2-75ee-4c32-bf2d-a18a06a1fb0c.png)\n![](https://learn.viblo.asia/uploads/d/2/d2ac1acc-0334-4fba-93e5-4fa6e23634ab.png)","answer_label":"b","answer_id":21154},{"id":614,"question":"Which of the following is a method for preventing an SQL injection attack?","answer_label":"Preventing input characters from being interpreted as characters that have a special meaning in an inquiry or operation on the database","answer_id":5413},{"id":2797,"question":"In a CSMA/CD based LAN, which of the following is an appropriate description of the transmission operation performed by a network node?","answer_label":"Each node checks if the transmission medium is in use, and can transmit data if the medium is not in use. If a conflict is detected, a retransmission occurs after a random interval of time.","answer_id":12188},{"id":6129,"question":"As shown below, there are two relational database tables Movie and Actor. Which of the following SQL statements should be used for retrieving a list of movie titles, released years, and directors, from all the movies that include “Action” or “Comedy” as a genre and “Cooper” as an actor’s name? Here, there is no movie remade with different actors, so “Title” and “Movie_title” are both primary keys in each table. \n\nMovie (Released_year, Title, Director, Genre, Description) \nActor (Name, Movie_title, Role)\n\n![](https://learn.viblo.asia/uploads/7/1/71ac216e-c650-40d3-ab89-d1f967277916.png)","answer_label":"a","answer_id":24730},{"id":3633,"question":"Which of the following is an appropriate usage of a radio button that is a GUI component?","answer_label":"It is used to select one option from among a set of mutually exclusive options.","answer_id":15449},{"id":2048,"question":"In a relational database, there are two conditions that must be met as a primary key constraint. One condition is that there are no duplicate key values. Which of the following is another condition?","answer_label":"The primary key value must not be null.","answer_id":9353},{"id":5114,"question":"Which of the following is the purpose of using a WAF (Web Application Firewall)?","answer_label":"To block attacks to a vulnerability arising from a Web server and an application","answer_id":20929},{"id":3461,"question":"When the SELECT statement is executed to join two tables T1 and T2 as shown below, which of the following tables is created?\n![](https://learn.viblo.asia/uploads/e/8/e8fd65f2-eff6-40dc-8820-c3a2f6eedca4.png)","answer_label":"d","answer_id":14769},{"id":6384,"question":"Which of the following helps improve availability?","answer_label":"Doubling MTBF and reducing MTTR to half","answer_id":25663},{"id":13805,"question":"Which of the following is an attack using a trial-and-error method to obtain confidential information such as a user password or personal identification number (PIN)?","answer_label":"Brute force","answer_id":53470},{"id":2951,"question":"Which of the following is a role that a PKI certification authority performs as a reliable third party?","answer_label":"It issues a digital certificate that certifies a public key of a user or a server.","answer_id":12792},{"id":4797,"question":"Which of the following is a device that interconnects LANs at the physical layer of the OSI basic reference model?","answer_label":"Repeater","answer_id":19824},{"id":4621,"question":"In database recovery management, which of the following appropriately explains\nincremental logging with deferred update?","answer_label":"The new value of the updated item is stored in the log.","answer_id":19201},{"id":3826,"question":"When the SQL statements shown below are executed for the “SMARK” table, which of the following is the appropriate table that can be obtained as a result?\r\nCREATE VIEW Result\r\nAS SELECT * FROM SMARKS AS S\r\nWHERE S.Marks > 52 AND S.ID <= 0100\r\nSELECT r.ID FROM Result AS r\r\nWHERE r.Status LIKE 'Pass' AND r.Mark <= 90\r\n![](https://learn.viblo.asia/uploads/f/c/fcad409f-8c56-4c93-a983-43953b40b299.png)","answer_label":"A","answer_id":16191},{"id":6142,"question":"A government website accepts passport applications using HTTP forms to collect information. Users provide complete personal information in the forms to help expedite processing of face-to-face transactions, and payments are done offline. The information collected enters a secure server for processing and document releasing. In this system environment, which of the following is the most likely security attack?","answer_label":"Sniffing trafficfor identity theft","answer_id":24783},{"id":3833,"question":"Which of the following is the most appropriate term that corresponds to the method of illegally intercepting audio and/or data being transmitted or received via a network?","answer_label":"Sniffing","answer_id":16221},{"id":2952,"question":"Which of the following is an appropriate description concerning corporate security management when Software as a Service (SaaS) is used?","answer_label":"No system construction needs to be performed, and neither the definition of security requirements for application software development nor the design of storage volume for system logs is required.","answer_id":12794},{"id":2055,"question":"Which of the following is a method for preventing an SQL injection attack?","answer_label":"Ensuring that the input characters are not interpreted as characters that have a special meaning in an inquiry or operation to the database","answer_id":9378},{"id":4491,"question":"![](https://learn.viblo.asia/uploads/2/9/297882b1-7074-4556-b00b-fe7d5d55b908.png)","answer_label":"c","answer_id":18733},{"id":6127,"question":"Which of the following is the data model that was originally introduced for the purpose of conceptual modeling and is often used for logical modeling and physical modeling as well as conceptual modeling?","answer_label":"E-R model","answer_id":24722},{"id":2943,"question":"In TCP/IP, which of the following is an application layer protocol that enables a server to automatically configure its clients with network information such as IP addresses, the subnet mask and the default gateway address?","answer_label":"DHCP","answer_id":12758},{"id":4622,"question":"What is the purpose of attaching a digital signature to software disclosed on the\nInternet?","answer_label":"To guarantee that the software contents have not been tampered with","answer_id":19203},{"id":5993,"question":"Which of the following is the appropriate statement concerning the number of host addresses available to one sub-network in IPv4?","answer_label":"The number of host addresses available in a sub-network is determined by the number of “0” bits in the subnet mask.","answer_id":24185},{"id":4804,"question":"For the purpose of finding out the number of times a Web page is accessed, an access counter is being designed. As shown in the figure, when two browsers gain access to the Web page simultaneously, Processes 1 through 4 are executed in this order on the server. When the access counter value is 100 before the two browsers access the Web page, what is the counter value at the completion of Process 4?\n![](https://learn.viblo.asia/uploads/2/9/2991cdd2-eb8e-468a-adc4-f13065e0ca36.png)","answer_label":"101","answer_id":19851},{"id":6091,"question":"Which of the following is the appropriate sequence of DB application development activities?","answer_label":"c) Database planning → Conceptual design → Physical design → Data conversion","answer_id":24580},{"id":4624,"question":"Which of the following is the salami technique used in computer crime?","answer_label":"Stealing from multiple assets little by little, to a degree that the illegal action does\nnot come to the surface and become noticeable","answer_id":19214},{"id":2950,"question":"A security question is used to authenticate a user who forgets his/her password for a web system. After the correct answer is given, which of the following is the most appropriate process in terms of security?","answer_label":"Sending a URL that is difficult to guess to the user's pre-registered e-mail address so that the user can access a password reset page","answer_id":12787},{"id":5178,"question":"Which of the following is the name of a phenomenon where multiple ON/OFF signals are generated during a few milliseconds after a push-button switch with a mechanical contact is pressed once?","answer_label":"Chattering","answer_id":21186},{"id":6409,"question":"Which of the following is the mechanism for interfacing a Web server with an external program in order to implement an interactive page where an application program on the server executes a request from a client and returns the resulting output to the browser?","answer_label":"CGI","answer_id":25762},{"id":3460,"question":"Which of the following is a concept that is included in both E-R and Enhanced E-R diagrams?","answer_label":"Cardinality","answer_id":14762},{"id":3639,"question":"Which of the following appropriately describes a characteristic of distributed database systems in comparison to centralized database systems?","answer_label":"Local queries and transactions accessing data at a single site have better performance because of the smaller local databases.","answer_id":15474},{"id":748,"question":"Which of the following is an encryption algorithm for public key cryptography?","answer_label":"RSA","answer_id":5120},{"id":739,"question":"In IPv4, which of following describes the NAT function of a router that connects some computers to the Internet?","answer_label":"It converts between private and global IP addresses.","answer_id":5155},{"id":1622,"question":"Which of the following is the most appropriate case example of social engineering?","answer_label":"A phone call was made to a helpdesk of a computer center. By using the personal\r\ninformation scavenged from a trash bin, the caller convinces the helpdesk staff that\r\nhe/she is a legitimate user, in order to have the password initialized and then break into\r\nthe system","answer_id":7616},{"id":813,"question":"Which of the following is a routable IP address in the Internet?","answer_label":"172.40.77.4","answer_id":4859},{"id":4775,"question":"When a corporate intranet is connected to the Internet, which of the following mechanisms works as a bridge to access the Internet, enables high-speed access by caching Web content, and then is used to ensure security?","answer_label":"Proxy","answer_id":19737},{"id":6109,"question":"Which of the following is the appropriate method that supports both private key\r\ncryptography and public key cryptography, enables users to securely exchange e-mail\r\nmessages, and to secure files, disk volumes, and network connections with both privacy\r\nand strong authentication?","answer_label":"PGP (Pretty Good Privacy)","answer_id":24652},{"id":6089,"question":"When the data model is represented to conform to the notational convention shown\nbelow, which of the following statements appropriately interprets the designated E-R\ndiagram?\n![](https://learn.viblo.asia/uploads/f/0/f05736a3-cd37-4b5b-b8b6-60d29dc7420c.png)","answer_label":"c) It does not occur that a single order placement is given to multiple suppliers.","answer_id":24572},{"id":3331,"question":"Which of the following is an explanation of clipping in 3D graphics processing?","answer_label":"It is the process of defining a window within an image display area and removing\nobjects or parts of objects that lie outside the window.","answer_id":14258},{"id":5101,"question":"As shown in the class diagram below, there is a many-to-many association between the two classes Product and Warehouse.    When there is a need to know how many of each product are stored in each warehouse, the association class StockHolding can be added between  the  two  classes  Product  and  Warehouse  so  as  not  to  hide  the  original  many-to-many relationship.\n![](https://learn.viblo.asia/uploads/2/6/26c9afcf-4730-4b62-83a8-26e2eb2f0403.png)\nIf  the  class  diagram  shown  below  is  depicted  using  a  full  class  instead  of  the  association class, which of the following is the appropriate combination of cardinalities that are inserted into blanks A through D?\n![](https://learn.viblo.asia/uploads/6/9/6998a03c-dbab-47be-bf50-828640f4a21b.png)","answer_label":"c","answer_id":20879},{"id":3643,"question":"Which of the following is the signaling protocol that is widely used to initiate, manage, and terminate multimedia communication sessions, such as voice and video calls over the Internet?","answer_label":"SIP","answer_id":15488},{"id":3334,"question":"Which of the following is an appropriate explanation of data warehouse?","answer_label":"A subject-oriented, integrated, time-variant, and non-volatile collection of data in\nsupport of management’s decision-making process","answer_id":14271},{"id":4340,"question":"Which of the following is the appropriate protocol that can deliver data from sender to receiver, correctly and in order?","answer_label":"TCP","answer_id":18224},{"id":4342,"question":"When constructing a network with a TCP/IP environment, IP address management becomes cumbersome and complicated as the number of clients becomes larger. Which of the following protocols is able to increase the efficiency of IP address management by assigning IP addresses dynamically according to requests from clients?","answer_label":"DHCP","answer_id":18229},{"id":6099,"question":"In the OSI basic reference model, which of the following layers provides a set of rules\r\nfor establishing and terminating the connection between applications on computer\r\nsystems?","answer_label":"Session layer","answer_id":24612},{"id":1879,"question":"On the Internet, sometimes when one tries to load a Web page by specifying a URL like http://www.jitec.ipa.go.jp/, the page does not show up and an error page is shown instead.\nHowever, one can browse this page correctly by specifying its IP address like this: http://118.151.146.137/. Which of the following TCP/IP layer is responsible for this Problem?","answer_label":"Application layer","answer_id":8723},{"id":4803,"question":"Which of the following is an appropriate description concerning the duties of database administrators?","answer_label":"To design and maintain databases, monitor their operations, and recover from failures","answer_id":19848},{"id":1869,"question":"Which of the following is an explanation of texture mapping?","answer_label":"It represents surface characteristics by pasting an image onto the surface of a\nthree-dimensional object.","answer_id":8686},{"id":3635,"question":"Which of the following SQL statements corresponds to the “projection” operation of the relational algebra that can extract only the column “Continent” from the table “Country” and eliminate duplicates from the records returned?\n![](https://learn.viblo.asia/uploads/c/d/cdde443f-82a4-43a9-8f1e-478fcfc0e0a0.png)","answer_label":"d","answer_id":15458},{"id":6105,"question":"Which of the following is the appropriate description of a lock that is the exclusive control of a database?","answer_label":"b) Locks come in two types: shared locks, used while reading, and exclusive locks, used during a change.","answer_id":24635},{"id":13795,"question":"From the figure below, which of the following isan appropriate set of attributes for the “CatalogProduct” class table?\n\n![](https://learn.viblo.asia/uploads/b/0/b0606bcd-4a25-4904-8e9a-a77c0f12c6fa.png)","answer_label":"CatalogID, ProductID, Price, SpecialPrice","answer_id":53431},{"id":6385,"question":"Which of the following refers to the concept of fail-safe design?","answer_label":"If the system determines that the sensor which detects someone entering the work area has failed, the robot arm is stopped by force.","answer_id":25669},{"id":2052,"question":"In a TCP/IP network using IPv4 addresses, which of the following is a valid network address? Here, the number following a slash (/) is the number (in decimal) of bits allocated to represent the network number","answer_label":"210.11.190.192/26","answer_id":9369},{"id":5994,"question":"Which of the following is the local broadcast address to be used by a computer with IP address 202.130.17.63 and subnet mask 255.255.255.0 if classless addressing is used?","answer_label":"202.130.17.255","answer_id":24190},{"id":3464,"question":"There is a database that manages user information (user database). From a viewpoint of security management, which of the following is the appropriate access privilege granted to an application program that searches the user database and displays the results? Here, the functions of privileges are described below.\n\n[Functions of privileges]\n- Read privilege: Records on the user database can be read.\n- Update privilege: Records on the user database can be registered, updated, and deleted.\n- Administrator privilege: Tables on the user database can be read, registered, updated, and deleted.","answer_label":"Read privilege","answer_id":14780},{"id":6003,"question":"When a new record is inserted in the relational database table “Payment” shown below, which of the following SQL statements causes a unique constraint violation? Here, “Contract_number” and “Contract_date” are primary keys.\n![](https://learn.viblo.asia/uploads/6/0/6022af66-adb4-42d3-a8a9-63d18816233a.png)","answer_label":"d","answer_id":24226},{"id":4623,"question":"Which of the following can be realized by using the packet filtering function of a\nfirewall?","answer_label":"To allow only the packets with specific TCP port numbers to pass from the Internet\nthrough to the internal network","answer_id":19207},{"id":549,"question":"Which of the following is an attack that threatens the “integrity” of information?","answer_label":"Falsification of a web page","answer_id":5447},{"id":6319,"question":"![](https://learn.viblo.asia/uploads/d/d/ddf5bca1-32cd-4b4d-8f37-e90324f927c4.png)","answer_label":"d","answer_id":25424},{"id":3840,"question":"Which of the following is a network segment that is isolated from the external network (WAN) and the internal network (LAN) via firewalls in order to ensure that publicly accessible servers cannot contact other internal network segments in the event that such a server is compromised?","answer_label":"DMZ","answer_id":16247},{"id":13813,"question":"Which of the following is the network security tool that isusually deployed by a network or system administrator and presents itself as a target machine trying to lure attackers to observe their behavior and attack methodology without harming other systems?","answer_label":"Honeypot","answer_id":53502},{"id":610,"question":"Which of the following is the purpose of port scanning when an attacker intrudes into the system?","answer_label":"To investigate if there is a service that can be attacked at the preliminary investigation stage","answer_id":5427},{"id":4776,"question":"Which of the following is an appropriate explanation of data mining?","answer_label":"A technique that uses statistical and mathematical methods to analyze large volumes of data in order to discover rules and causal relationships","answer_id":19741},{"id":751,"question":"An attacker captures unencrypted network traffic with a tool and later analyzes it offline to learn about the information contained in those transmissions. Which of the following is this attack?","answer_label":"Sniffing attack","answer_id":5109},{"id":743,"question":"Which of the following is a protocol that uses TCP as its transport layer protocol?","answer_label":"TELNET","answer_id":5140},{"id":1873,"question":"In a relation schema R = ( A, B, C, D, E ) , the following functional dependencies are held:\n\nA → BC\n\nCD → E\n\nB → D\n\nE → A\n\nWhich of the following is a combination of two candidate keys for R ?","answer_label":"A and E","answer_id":8699},{"id":2945,"question":"As shown below, multiple PCs are connected to the home network and they have access to the Internet through FTTH, and a global IP address is assigned to the WAN interface of device A. Which of the following is the function of device A that enables the PCs to use the Internet with this global IP address?\n![](https://learn.viblo.asia/uploads/9/1/9152b6fe-2df7-425b-ac29-c081aa7a0b7f.png)","answer_label":"NAPT (IP Masquerade)","answer_id":12766},{"id":4805,"question":"In public key cryptography, which of the following key can be used for decrypting the data that is encrypted by using the server’s public key?","answer_label":"Server’s private key","answer_id":19856},{"id":2053,"question":"When security attacks to a computer system are classified into three categories (i.e., reconnaissance attack, access attack, and DoS attack), which of the following is classified as a reconnaissance attack?","answer_label":"Attempting to discover and map out systems, services, or vulnerabilities","answer_id":9370},{"id":3466,"question":"Which of the following is the broadcast MAC address that is used by multiple protocols, such as ARP (Address Resolution Protocol) and RIP (Routing Information Protocol), in order to transmit data to all of the hosts on the local subnet?","answer_label":"FF-FF-FF-FF-FF-FF","answer_id":14789},{"id":6100,"question":"Which of the following protocols is used on the transport layer of OSI basic reference\r\nmodel?","answer_label":"UDP","answer_id":24617},{"id":546,"question":"Which of the following is an architecture that decouples the network control and forwarding functions, enabling the network control to become directly programmable and the underlying infrastructure to be abstracted for applications and network services?","answer_label":"Software-defined networking","answer_id":5461},{"id":2937,"question":"The data model in the diagram below is implemented with three (3) tables. Which of the following is an appropriate combination of A and B in table “Transfer” that contains the record that indicates “500 dollars sales to Company X are posted to the cash account on April 4, 2017”? Here, the data model is described in UML.\n![](https://learn.viblo.asia/uploads/d/7/d74a5d38-24d2-4d18-8c6a-08886f540583.png)","answer_label":"d","answer_id":12736},{"id":806,"question":"Which of the following is a method that performs integration of the modules that configure a program during execution of the program?","answer_label":"Dynamic linking","answer_id":4886},{"id":3835,"question":"When information, such as an e-mail or a document file, is sent or received with a digital signature via the Internet, which of the following is the appropriate combination of security properties that ensure that such information has not been altered or tampered with during transmission?","answer_label":"Authenticity and integrity","answer_id":16228},{"id":456,"question":"In a DBMS, which of the following functions decides the schema?","answer_label":"Definition function","answer_id":5976},{"id":5165,"question":"Which of the following is an example of a daisy chain connection?","answer_label":"Industrial cameras with each having two IEEE 1394 ports are serially connected, and then one end is connected to a PC.","answer_id":21135},{"id":6108,"question":"Which of the following is the major impact of a Denial of Service (DoS) attack?","answer_label":"Degradation of service due to network traffic congestion","answer_id":24647},{"id":6132,"question":"Which of the following explains the database rollback process?","answer_label":"The “undo journal” is used to restore the data to the status immediately before the start of the transaction.","answer_id":24745},{"id":3832,"question":"In a TCP/IP network, which of the following is used to check if a computer or device is accessible across a network?","answer_label":"ping","answer_id":16218},{"id":2056,"question":"When the procedure below is performed in terms of security, which of the following can be done by recipient B, in addition to the detection of message falsification?\n\n[Procedure]\n\nProcess of sender A\n\n(1) A hash function is used to generate a digest from a message.\n\n(2) The sender’s secret signature generation key is used to generate a signature for the message from the digest generated in (1).\n\n(3) The message and the data generated in (2) are sent to recipient B. \n\nProcess of recipient B\n\n(4) A hash function is used to generate a digest from the received message.\n\n(5) The received data, the digest generated in (4), and sender A’s signature verification key are used to verify the signature.","answer_label":"Confirming that the message is from sender A","answer_id":9382},{"id":464,"question":"In TCP/IP network, which of the following is a combination of information that identifies a TCP connection?","answer_label":"IP address, Port number","answer_id":5909},{"id":1827,"question":"In the Internet environment, a computer is able to send the ping command “ping 11.22.33.44” to the web server (e.g., www.xyz.com) of Company XYZ and then receive an echo reply message successfully. Also, the computer is able to browse the website by using URL “http://11.22.33.44”, but cannot browse the same website by using “http://www.xyz.com”. In the OSI basic reference model, which of the following is the layer that is most likely to be responsible for such a problem?","answer_label":"Application layer","answer_id":8515},{"id":6000,"question":"$\\boxed{x} \\to \\boxed{y}$ indicates that the value of attribute $y$ is determined uniquely by the value of attribute $x$. Which of the following appropriately defines the relationships shown in the figure as a set of tables of the third normal form? Here, multiple attributes contained in a box $\\boxed{x}$ show that the value of attribute $y$ is determined uniquely by the values of all those multiple attributes.\n![](https://learn.viblo.asia/uploads/a/6/a6c28237-92b8-4dc6-9d1b-f932c58bc530.png)","answer_label":"d","answer_id":24214},{"id":5996,"question":"When MAC (Media Access Control) frames defined by IEEE 802.3 are transmitted over Ethernet, which of the following methods is used for error detection?","answer_label":"CRC","answer_id":24196},{"id":3472,"question":"Which of the following is the appropriate combination that is defined as a socket address in TCP/IP network environments?","answer_label":"IP address and port number","answer_id":14810},{"id":611,"question":"Which of the following is a description that corresponds to two-factor authentication?","answer_label":"Authentication is performed by using the iris and a password.","answer_id":5425},{"id":2072,"question":"Among the situations that are checked during an audit of the methods of transmitting highly confidential information to a business partner by e-mail, which of the following is an appropriate situation from the viewpoint of preventing information leakage?","answer_label":"A password is set for an attached file containing confidential information prior to being sent to the partner by e-mail, and the password is transferred in another way","answer_id":9446},{"id":741,"question":"Which of the following is the network routing and addressing mechanism that is used in\nIPv6 but not in IPv4?","answer_label":"Anycast","answer_id":5146},{"id":747,"question":"Which of the following is an explanation of the time stamp service in information security?","answer_label":"It is a service that certifies that electronic data certainly exist on a particular date and time and that the data have not been falsified since that date and time.","answer_id":5123},{"id":6415,"question":"Which of the following appropriately explains the SQL statements shown below?\n![](https://learn.viblo.asia/uploads/f/5/f5c118ed-e786-46ce-8aef-d43f0678dfd2.png)","answer_label":"“SELECT * FROM STAFF ” extracts all records in the table MANAGER.","answer_id":25786},{"id":4339,"question":"In the OSI 7-layer model, which of the following layers coverts data from the upper layer into many tiny pieces called segments for transmission across the network?","answer_label":"Transport Layer","answer_id":18220},{"id":4609,"question":"Which of the following is the appropriate protocol that is widely used with TCP/IP\nnetworks to collect and manage information from network devices such as servers,\nrouters, switches, and hubs?","answer_label":"SNMP","answer_id":19154},{"id":3477,"question":"A packet filtering-type firewall is installed at the connection point between an in-house network and the Internet. When the firewall makes possible access to the Web server (port number 80) on the Internet from a PC on the in-house network, which of the following is the appropriate combination that is permitted by the packet filtering rules?\n![](https://learn.viblo.asia/uploads/9/a/9a2af453-eb5f-49ff-aeee-61aefd57bdcf.png)","answer_label":"b","answer_id":14831},{"id":2050,"question":"Which of the following is the network device that enables LANs to be interconnected at the physical layer of the OSI basic reference model?","answer_label":"Repeater","answer_id":9360},{"id":2946,"question":"Which of the following is a password attack that makes use of the possible combination of pre-computed hashes and passwords?","answer_label":"Rainbow table attack","answer_id":12771},{"id":4808,"question":"Which of the following is an appropriate description concerning Internet VPN security?","answer_label":"There is no capability for identifying individual people who are qualified to participate in the network.","answer_id":19868},{"id":3344,"question":"Which of the following is the most effective method for detecting the falsification of\ncontent on a Web server?","answer_label":"The hash value of each file containing the content of the Web server is stored and is\nperiodically compared with the hash value generated from each file.","answer_id":14311},{"id":1886,"question":"According to ISO/IEC 25010 (Systems and software engineering - Systems and software Quality Requirements and Evaluation (SQuaRE) - System and software quality models), which of the following is an appropriate quality characteristic that means the degree to which a product or system provides functions that meet stated and implied needs when used under specified conditions?","answer_label":"Functional suitability","answer_id":8751},{"id":3339,"question":"In a TCP/IP network environment, which of the following is the most appropriate\ninformation used by a router in order to determine the routing path of a packet?","answer_label":"Destination IP address","answer_id":14290},{"id":4608,"question":"When a network device is connected to the LAN with the network address of\n201.12.1.64 and the subnet mask of 255.255.255.192, which of the following IP\naddresses should NOT be assigned to the device on the network?","answer_label":"201.12.1.127","answer_id":19150},{"id":811,"question":"Which of the following is an appropriate normalization form (NF) used in a relational database in which every non-prime attribute must be dependent only on the primary key, and no non-prime attribute is dependent on another non-prime attribute?","answer_label":"3NF","answer_id":4868},{"id":4349,"question":"There is an OS that can set access privileges to read, update, and create subordinate files in a directory. These three types of access privileges can be set to “enabled” or “disabled” using 1 bit. If these three bits are set by an octal (base-8) number expressed by numerals 0 to 7, which of the following is an appropriate description, taking into account the trial results below?\n\n[Trial results]\n\n(1) When 0 was set, all accesses were disabled.\n\n(2) When 3 was set, read, and update were enabled, but create was disabled.\n\n(3) When 7 was set, all accesses were enabled.","answer_label":"When 4 is set, only create is enabled.","answer_id":18258},{"id":1621,"question":"Which of the following is an appropriate explanation of POP3 used in e-mail systems?","answer_label":"It is a protocol used to receive e-mail messages from the mailbox of a mail server.","answer_id":7613},{"id":1625,"question":"Which of the following is an explanation of SQL injection?","answer_label":"It is an attack where a command for performing a malicious query or operation in the\r\ndatabase is entered when there is a problem in a Web application, and the data of the\r\ndatabase is modified or acquired without authorization.","answer_id":7628},{"id":3463,"question":"Which of the following is the primary purpose of locking a resource in database management systems?","answer_label":"To maintain data integrity","answer_id":14775},{"id":6408,"question":"Which of the following is a mechanism that allows a Web server to store its own information about a user on the user’s own computer so that the Web server can identify users and possibly prepare customized Web pages for them?","answer_label":"Cookie","answer_id":25758},{"id":6413,"question":"There are two tables “movie” and “movietype” as shown below. Which of the following tables is created as the result of executing the SQL statement specified below?\n![](https://learn.viblo.asia/uploads/2/b/2b1abd2a-2668-48e7-a199-471b28a11caa.png)\n![](https://learn.viblo.asia/uploads/d/d/dd39c56c-a99a-4540-88ad-e0dc655ec595.png)","answer_label":"b","answer_id":25779},{"id":13814,"question":"SSL/TLS is the industry-standard security technology creating encrypted connections between a web server and a web browser. This is used to maintain data privacy and to protect the information in online transactions. The steps for establishing an SSL/TLS connection are randomly listedas follows:\n\n1. The web server sends a copy of its SSL/TLS certificate to the web browser. \n2. SSL/TLS encrypted communication takes place between the web browser and the web server. \n3. The web server sends the web browser an acknowledgment to start an SSL/TLS encrypted connection. \n4. The web browser checks if the SSL/TLS certificate is trustworthy or not. If it is trustworthy, then the web browser sends a message to the web server requesting to establish an encrypted connection. \n5. A web browser tries to connect to the web server secured with SSL/TLS. Which of the following is the correct step sequence?","answer_label":"5 → 1 → 4 → 3 → 2","answer_id":53509},{"id":6128,"question":"The figure below shows the relationships among data items used in a certain parts management system. When the system is implemented as a relational database, which of the following is the most appropriate and effective table structure of the relational database?\n![](https://learn.viblo.asia/uploads/f/b/fb477c50-89f3-4c1e-a05d-86bb5181d7c9.png)","answer_label":"c","answer_id":24728},{"id":13806,"question":"Which of the following is an appropriate description of clickjacking","answer_label":"An attacker misleads the user to interact with a user interface and to perform unintended operations.","answer_id":53475},{"id":552,"question":"Which of the following is a description of a directory traversal attack?","answer_label":"By specifying a file including the path name, the attacker illegally reads an unauthorized file.","answer_id":5434},{"id":3473,"question":"A message with a digital signature is received via e-mail. Which of the following can be checked by verifying the digital signature of the received message?","answer_label":"The message has not been falsified.","answer_id":14816},{"id":3342,"question":"Which of the following is the most appropriate term that refers to the way in which a\ncompany collects any personal information about users via the company’s website and\nalso the way in which the company uses and protects such personal information?","answer_label":"Privacy policy","answer_id":14304},{"id":5109,"question":"In a TCP/IP network using IPv4 addresses, which of the following is an effective IP address that can be allocated to a network device?","answer_label":"203.164.15.9/28","answer_id":20911},{"id":1617,"question":"Which of the following is the role of DNS in a TCP/IP network?","answer_label":"IP addresses are mapped to domain names, host names, and other such information.","answer_id":7598},{"id":1870,"question":"Which of the following is an appropriate purpose for adopting a three-layer schema architecture for DBMS?","answer_label":"To derive a new table from a source table through a relational operation as if the new table actually existed","answer_id":8688},{"id":1832,"question":"In the context of information security defined by ISO/IEC 27001, which of the following is the property of safeguarding the accuracy and completeness of information assets?","answer_label":"Integrity","answer_id":8538},{"id":4337,"question":"In a search system, when search was first performed under condition A, there were 5,000 search results. When further narrowed down with condition B, 30% of these search results remained. If search first performed under condition B produces 10,000 search results, what percentage will remain when these are further narrowed down with condition A?","answer_label":"15","answer_id":18209},{"id":821,"question":"Bob and Alice encrypt all of their communications with each other. Because of the high level of sensitivity of the information they are sharing, they have implemented a cryptographic mechanism that offers secrecy to their messages. However, the trade-off of this encryption is that it is impossible for Bob or Alice to be 100% sure that they are communicating with each other, nor can they be 100% certain of the integrity of the content of the messages. Which of the following types of encryption methods are Bob and Alice using?","answer_label":"One-time pad","answer_id":4824},{"id":6007,"question":"Which of the following is an appropriate explanation of Web beacons?","answer_label":"Images embedded in Web pages to gather information such as user access trends","answer_id":24239},{"id":1836,"question":"Mr. X sends an e-mail to Mr. Y by using the Internet. The contents of the e-mail must be kept confidential, so Mr. X uses public key cryptography to encrypt the e-mail. Which of the following is the key that is used to encrypt the contents of the e-mail?","answer_label":"Mr. Y ’s public key","answer_id":8554},{"id":1831,"question":"Which of the following is an appropriate description concerning “HTTP cookie”?","answer_label":"HTTP cookies are used to contain data sent from a web server as plain text only.","answer_id":8532},{"id":4344,"question":"A message consists of 200 characters. If we can transmit 200 messages on average before a 1-bit error occurs, what is the bit error rate of the transmission line? Here, 1 character equal 2 bytes while 1 byte equals to 8 bits.","answer_label":"1/640,000","answer_id":18237},{"id":1763,"question":"In an IPv4 network, which of the following is the correct combination of an IP address class, its IP address range, and a subnet mask?\n![](https://learn.viblo.asia/uploads/1/6/163fe298-5e9d-4f5e-8e22-c5969fef8e57.png)","answer_label":"b","answer_id":8260},{"id":6004,"question":"Which of the following files is used for writing the values before and after a database update, and storing them as a database update record?","answer_label":"Journal file","answer_id":24230},{"id":542,"question":"Which of the following is a file where values before and after an update of the database are written and saved as the update history of the database?","answer_label":"Log file","answer_id":5481},{"id":734,"question":"An employee works for a department, which can be located in multiple regions. Three tables EMP, DEPT, and DEPT_LOCS are created as shown below for recording the employee, department, and department location data, respectively.\n\n![](https://learn.viblo.asia/uploads/c/6/c62e1eb9-830b-401d-a56e-6fca0116aeb5.png)","answer_label":"b","answer_id":5175},{"id":13796,"question":"Which of the following is the database function that is automatically executed when a specific action such as update, delete, or insert occurs within a database?","answer_label":"Trigger","answer_id":53436},{"id":5992,"question":"Which of the following appropriately explains the function of the transport layer in the OSI basic reference model?","answer_label":"It is responsible for maintaining reliable end-to-end communications and data transfer between systems across the network, and provides a variety of functions including flow control, virtual circuit, and error checking and recovery.","answer_id":24180},{"id":5112,"question":"Which of the following can be achieved by receiving an e-mail text and its hash value from the sender, and then comparing this hash value with another hash value calculated by the recipient from the e-mail text? Here, the hash value that the recipient receives from the sender is correct.","answer_label":"Detecting the presence or absence of falsification in the e-mail text","answer_id":20922},{"id":1620,"question":"Which application protocol must support UDP as its transport layer protocol?","answer_label":"DNS","answer_id":7607},{"id":4352,"question":"Which of the following is an appropriate statement regarding elements of information security defined in ISO/IEC 17799:2005?","answer_label":"Integrity is safe-guarding the accuracy and completeness of information and processing methods.","answer_id":18272},{"id":5976,"question":"Which of the following performs reasoning using a knowledge base?","answer_label":"Expert system","answer_id":24115},{"id":3649,"question":"A Web server was invaded from the outside, and its contents were falsified. Which of the following is the appropriate sequence of subsequent activities?\n![](https://learn.viblo.asia/uploads/2/5/2575af09-7ab9-4481-b5f1-6f217a138c32.png)","answer_label":"d","answer_id":15514},{"id":1838,"question":"Which of the following is a feature that is incorporated by an attacker to enter the network or server of a company?","answer_label":"Back door","answer_id":8559},{"id":745,"question":"Which of the following is a description of a directory traversal attack?","answer_label":"An attacker specifies a file by using the path name and illegally views a file that is not intended for viewing by the administrator.","answer_id":5133},{"id":13799,"question":"In a database system, which of the following is the action to undo changes done by transactions executed after the last commit?","answer_label":"Roll back","answer_id":53447},{"id":3648,"question":"Which of the following sends a program incorporating fraudulent functions, such as destruction and falsification of data, for installation and execution?","answer_label":"Trojan horse","answer_id":15510},{"id":6141,"question":"Which of the following refers to online scams where thieves attempt to entice e-mail recipients into clicking on a link that takes them to a bogus website, and the website may prompt the recipient to provide personal information such as social security number, bank account number, and credit card number, and/or it may download malicious software onto the recipient’s computer?","answer_label":"Phishing","answer_id":24780},{"id":1828,"question":"In the IPv4 addressing scheme, when the subnet mask \"255.255.255.224\" is used for Class C, which of the following is the maximum number of effective hosts per subnet, excluding the network and broadcast addresses?","answer_label":"30","answer_id":8520},{"id":13808,"question":"Man-in-The-Middle (MITM) attack means the attacker intercepts and alters the communication between the end-user (victim) and the server, which is shown below. In an MITM attack, when the victim sends packets to the server, the attacker receives the packets and then forwards them to the server while the server sends the packets to the victim via the attacker. In this communication channel, which of the following is the appropriate description concerning the MITM attack?\n![](https://learn.viblo.asia/uploads/f/6/f6217f3c-2557-4bcc-845b-efc119fbd935.png)","answer_label":"The attacker always uses the victim’s IP during the communication with the server and always uses the server IP during the communication with the victim.","answer_id":53484},{"id":1628,"question":"When a biometric authentication system is installed, which of the following is the most appropriate point to be considered?","answer_label":"Adjusting the system in consideration of both the probability of incorrectly rejecting an authorized user and the probability of incorrectly accepting an unauthorized user","answer_id":7639},{"id":3337,"question":"In a local area network using CSMA/CD as its access method, which of the following is\nan appropriate description concerning the transmission operation performed by a\nnetwork node?","answer_label":"Each node checks if the transmission medium is in use, and can transmit data if not\nin use. If a conflict is detected, retransmission is done after a random time interval.","answer_id":14283},{"id":753,"question":"As shown in the figure below, an application on a client accesses the data of the database on a server via database connection programs. Which of the following is a measure for preventing the leakage of the commands and execution results transmitted between the application and database?\n\n![](https://learn.viblo.asia/uploads/f/b/fb810996-815d-4123-b39b-616cd00a1163.png)","answer_label":"Encrypting the communication between the database connection programs","answer_id":5099},{"id":2944,"question":"Which of the following is an appropriate explanation of SDN (Software-Defined Networking) that uses OpenFlow?","answer_label":"It is a network technology that logically decouples the functions for data transfer and route control, and is implemented with a combination of network devices specialized for data transfer and software-based route control.","answer_id":12762},{"id":4773,"question":"When machine tools are controlled by microcomputers, which of the following focuses on fail safe?","answer_label":"The system automatically stops when an abnormal operation signal is detected.","answer_id":19729},{"id":2936,"question":"“a → b” represents the fact that when the value of attribute a is determined, the value of attribute b is determined uniquely. For example, “Employee number → Employee name” represents that when the employee number is determined, the employee name is determined uniquely. Based on this notation, when the relations between attributes a through j are established as shown in the figure below, which of the following is an appropriate combination of three (3) tables that defines the relations in a relational database?\n![](https://learn.viblo.asia/uploads/1/b/1b0ac33a-e330-46f7-bf92-8922c2027b3a.png)","answer_label":"b","answer_id":12730},{"id":2059,"question":"Which of the following is a method that is used for encrypting e-mail?","answer_label":"S/MIME","answer_id":9397},{"id":4518,"question":"![](https://learn.viblo.asia/uploads/f/d/fd29b233-cfe6-4069-af7e-e74b27196f99.png)","answer_label":"b","answer_id":18838},{"id":3338,"question":"In the OSI basic reference model, which of the following is the appropriate layer that\nuses some common network programs and their corresponding protocols, such as\nHTTP, DHCP, and DNS?","answer_label":"Application layer","answer_id":14286},{"id":6404,"question":"Which of the following terms can be applicable to an explanation below? “The sender sends a single datagram; the routers are responsible for making copies and sending them to a group of interested receivers.”","answer_label":"Multicast","answer_id":25744},{"id":4612,"question":"Which of the following occurs when computer A broadcasts an ARP request to find\nthe MAC address of computer B on the same network?","answer_label":"All computers in network receive the request from A , and only B replies to A with its\nMAC address.","answer_id":19164},{"id":3831,"question":"Which of the following is an appropriate function of a switching hub (layer 2 switch) that is used as a network device?","answer_label":"A received packet is forwarded only to a LAN port corresponding to a destination MAC address.","answer_id":16213},{"id":4351,"question":"Against what kind of attacks does SSL (Secure Sockets Layer) protect users on the Internet?","answer_label":"Tapping and exploitation of data","answer_id":18268},{"id":6101,"question":"Which of the following is the appropriate technology that is used to establish a private or\r\nsecure network connection within a public IP network, such as the Internet, and to give\r\nthe company the same capabilities at much lower cost by using the shared public\r\ninfrastructure rather than a private one?","answer_label":"VPN","answer_id":24621},{"id":5181,"question":"Which of the following is an appropriate example of VR (Virtual Reality)?","answer_label":"Computer games and simulations make use of multimodal devices, such as a wired glove, a headgear, and an omni-directional treadmill, in order to provide very enriching and life-like experience for the user.","answer_id":21198},{"id":809,"question":"Which of the following is a database design that consists of multiple tables, with rows and columns that are linked together through matching data stored in each table?","answer_label":"Relational database","answer_id":4877},{"id":4807,"question":"In an electronic transaction that employs public key cryptography, which of the following is created by the certification authority (CA), a third party independent of the parties involved in the transaction?","answer_label":"The electronic certificates for the public keys of the parties involved in the transaction","answer_id":19864},{"id":788,"question":"Which of the following is a criminal act related to a computer virus according to the Convention on Cybercrime?","answer_label":"A person who finds a virus that is created by a stranger stores the virus for the purpose of subsequently running it on another person’s computer.","answer_id":4960},{"id":4345,"question":"Which of the following appropriately describes a schema in a relational database management system?","answer_label":"It is a set of data definitions such as the data properties, format, relationship with other data, etc.","answer_id":18241},{"id":6136,"question":"Which of the following is the IP network addressing and routing scheme whereby data is routed to the “nearest” or “best” destination as viewed by the routing topology?","answer_label":"Anycast","answer_id":24758},{"id":1840,"question":"Which of the following is a mechanism by which a company or organization centrally manages the usage status of smartphones or such other devices that are lent to its staff members by making integrated settings according to the security policy, or by delivering business applications?","answer_label":"MDM (Mobile Device Management)","answer_id":8570},{"id":4796,"question":"In home and office networks of Fast or Gigabit Ethernet, which of the following cables can be used as a lower cost option for connecting a client PC to the network?","answer_label":"UTP","answer_id":19821},{"id":5176,"question":"In a logic circuit shown below, which of the following is an appropriate combination of input signals A through C that can generate the output signal “0”?\n![](https://learn.viblo.asia/uploads/2/e/2e2b289f-88d4-4088-964a-dd69266d2b71.png)","answer_label":"b","answer_id":21178},{"id":3636,"question":"Among the ACID (Atomicity, Consistency, Isolation, Durability) properties of transactions, which of the following is the appropriate description concerning “atomicity”?","answer_label":"A transaction is a basic unit of processing; it must be performed in its entirety, or else it must be cancelled.","answer_id":15459},{"id":744,"question":"The IP address of Server X prepared by an attacker was stored in a DNS cache server of Company B as the IP address corresponding to the FQDN of the web server of Company A. Which of the following users will be unintentionally guided to Server X because of this attack? Here, each employee of Company A and Company B performs name resolution by using the DNS cache server of his/her own company.","answer_label":"An employee of Company B who wishes to access the web server of Company A","answer_id":5136},{"id":6093,"question":"Which of the following is the appropriate description concerning the functions of “driver” or “stub” used in the module test?","answer_label":"a) “Driver” calls the module to be tested while passing arguments to it.","answer_id":24586},{"id":1837,"question":"Which of the following is the security attack that is used for an illegal attempt to manipulate the people of an organization into divulging the password and confidential information under the pretext of an emergency?","answer_label":"Social engineering","answer_id":8556},{"id":4614,"question":"Which of the following is the key technology that enables to connect a computer using\na private IP address to the Internet?","answer_label":"NAT","answer_id":19173},{"id":6096,"question":"Which of the following appropriately describes the purpose of using a check digit?","answer_label":"a) To detect an error of the inputted code value","answer_id":24598},{"id":2016,"question":"When malware that has made a successful intrusion into a PC communicates with a command-and-control server on the Internet, which of the following is a reason for using the TCP port number 80 as the destination port in most cases?","answer_label":"As this port is used for browsing websites, there is a high probability that communication\nis allowed by the firewall.","answer_id":9222},{"id":735,"question":"In an SQL statement, which of the following is a constraint that is specified with FOREIGN KEY and REFERENCES?","answer_label":"Referential constraint","answer_id":5173},{"id":5167,"question":"Which of the following is the appropriate RAID configuration that provides byte-level striping in combination with parity information and stores the parity for each stripe in a dedicated disk?","answer_label":"RAID3","answer_id":21143},{"id":5193,"question":"Which of the following provides a baseline of security requirements for the operations of CA (Certification Authority) and RA (Registration Authority)?","answer_label":"Certificate policy","answer_id":21245},{"id":1825,"question":"When there are two relational database tables A and B as shown below, which of the following is the appropriate table that shows the result of the relational operation A ÷ B ?\n![](https://learn.viblo.asia/uploads/f/e/fea6776a-228f-4ab1-9c9c-b86b37a7b3a9.png)","answer_label":"b","answer_id":8508},{"id":5110,"question":"Which of the following is an appropriate explanation of POP3 that is used in an e-mail system?","answer_label":"It is a protocol used to retrieve e-mails from the mailbox of a mail server.","answer_id":20916},{"id":6009,"question":"There are two types of attacks which an information system might face: active attack and passive attack. Which of the following is categorized as an active attack?","answer_label":"Falsification of data","answer_id":24249},{"id":2804,"question":"Which of the following is an appropriate description of a Trojan horse used for security attacks in computing?","answer_label":"It is a rogue program that tricks users.","answer_id":12217},{"id":2806,"question":"Which of the following is an example of improper use of a key logger?","answer_label":"When Internet banking is used, it collects the password entered by the user.","answer_id":12224},{"id":3828,"question":"As shown below, there are three relational database tables Table_1, Table_2, and Table_3. Table_1 contains the students who have knowledge of Java language, and Table_2 contains the students who have knowledge of C++. Table_3 contains the students who know C++ but do not know Java. Which of the following is the appropriate operation in relational algebra that can be used to create Table_3?\r\n![](https://learn.viblo.asia/uploads/2/c/2c4e1ff5-8699-4c5d-94f3-16b5d91cbd73.png)","answer_label":"Difference","answer_id":16199},{"id":5995,"question":"When a 9-Kbyte data file is transmitted using the asynchronous (or start-stop) communication protocol at a speed of 2,400 bps, what is the “overhead” (time spent on sending start, stop, and parity bits except data bits) in seconds? Here, a start bit is first sent, followed by eight data bits, no parity bit, and one stop bit, for each byte of the data file.","answer_label":"7.5","answer_id":24191},{"id":4800,"question":"There are three tables T1, T2, and T3 as shown below. Which of the following tables is created as the result of executing the SQL statement specified below?\n![](https://learn.viblo.asia/uploads/4/1/41b4176a-891c-43d5-981b-9150d30468b0.png)\n![](https://learn.viblo.asia/uploads/6/3/636d2ea7-59f6-450e-b28d-e8ede47f56a3.png)","answer_label":"a","answer_id":19834},{"id":1826,"question":"For the “Product” table shown below, a transaction that executes the SQL statement below terminates abnormally because of the occurrence of a deadlock. Which of the following is the “Product” table after the abnormal termination? Here, other transactions use the “Product” table as reference but do not update it.\n![](https://learn.viblo.asia/uploads/2/6/260fac45-361c-46e6-899c-c3841c3c768d.png)","answer_label":"b","answer_id":8512},{"id":6110,"question":"Port scanning is the process of sending packets to check every port on each target system\r\nto see which ports are open and which ports are locked. Which of the following\r\ninformation can be identified by port scanning?","answer_label":"Network and application services currently available","answer_id":24656},{"id":1867,"question":"According to the Open Source Definition by OSI (Open Source Initiative), which of the following is the appropriate description concerning open source licensing?","answer_label":"The license requires that the source code of a program must be made available either for free or at a reasonable reproduction cost.","answer_id":8678},{"id":4793,"question":"Which of the following protocols is used in mail servers on a TCP/IP network?","answer_label":"SMTP","answer_id":19807},{"id":6302,"question":"![](https://learn.viblo.asia/uploads/2/0/203ce092-b728-496b-a08e-926b814d1955.png)","answer_label":"B","answer_id":25356},{"id":817,"question":"Alan would like to send an encrypted message to Bob using an asynchronous encryption scheme. Which of the following must occur before Alan sends the encrypted message to Bob? Here, Alan has already proven to Bob with the digital signature that Alan is the person who sends the message to Bob.","answer_label":"Bob provides his public key to Alan.","answer_id":4845},{"id":1883,"question":"Which of the following is a purpose of using a WAF (Web Application Firewall)?","answer_label":"An attack on a vulnerability attributed to a Web server and a Web application is blocked.","answer_id":8739},{"id":462,"question":"When a PC connected to a LAN is starting up, which of the following protocols is used to automatically assign an IP address to the PC?","answer_label":"DHCP","answer_id":5916},{"id":540,"question":"Which of the following is an SQL statement that gives the same result as the SQL statement that is described below for the “Product” table and the “Inventory” table? Here, the underlined part indicates the primary key.\n\nSELECT ProductNumber FROM Product\n  WHERE ProductNumber NOT IN (SELECT ProductNumber FROM Inventory)\n\n![](https://learn.viblo.asia/uploads/e/3/e3d9bf06-a566-4929-9c09-57971c0cd406.png)","answer_label":"SELECT ProductNumber FROM Product WHERE NOT EXISTS (SELECT ProductNumber FROM Inventory WHERE Product.ProductNumber = Inventory.ProductNumber)","answer_id":5485},{"id":5186,"question":"Which of the following is the UPDATE statement that can correctly update the data of the “Product” table? Here, the “Product” table is defined by the CREATE statement shown below.\n![](https://learn.viblo.asia/uploads/b/f/bf8a81c7-24f6-4d06-b214-5fbbf145b217.png)","answer_label":"d","answer_id":21220},{"id":4806,"question":"Which of the following is an appropriate description of phishing?","answer_label":"It is a technique for fooling users into visiting a hostile or untrusted website through spam messages and divulging personal data such as accounting numbers, passwords, and other confidential information.","answer_id":19858},{"id":3838,"question":"Which of the following is an appropriate description concerning social engineering?","answer_label":"An attacker manipulates people into providing inappropriate access to sensitive or confidential data.","answer_id":16241},{"id":3634,"question":"Which of the following is a human interface design that is intended to improve the consistency of operations?","answer_label":"Designing operation buttons so that they have a common display location and shape on all screens","answer_id":15451},{"id":6140,"question":"Which of the following can be achieved by using SSL/TLS?","answer_label":"Communication between clients and servers is encrypted.","answer_id":24774},{"id":3824,"question":"Which of the following is the appropriate sequence of steps used for normalizing a relational database table?\r\nStep A: Attributes dependent on non-key attributes are separated as another table.\r\nStep B: Attributes dependent on only part of key are separated as another table.\r\nStep C: Repetitive data is separated as another table.","answer_label":"C → B → A","answer_id":16186},{"id":2201,"question":"There is a “Delivery” table that has six (6) records. Which of the following is the\nfunctional dependency that is satisfied by this table? Here, “X → Y” indicates that X\nfunctionally determines Y.\n![](https://learn.viblo.asia/uploads/9/e/9e70b9ad-07e4-46f5-b004-a88695f9e77e.png)","answer_label":"Delivery_destination → Component_ID","answer_id":9908},{"id":1626,"question":"Which of the following is an appropriate operation in user authentication that uses an IC card and PIN?","answer_label":"When an IC card is delivered, the PIN is not enclosed, but is notified to the user through\r\nanother channel.","answer_id":7634},{"id":6005,"question":"When secret documents are sent and received using public key cryptography, which of the following is an appropriate description of the key management?","answer_label":"The decryption key must be kept private, but the encryption key is public.","answer_id":24231},{"id":5104,"question":"In a relational database system, which of the following is an appropriate purpose of recording changes in a database file as a journal file?","answer_label":"To enable recovery to be undertaken effectively in the event of a failure","answer_id":20890},{"id":1822,"question":"In a relational database table, which of the following is a column or a combination of columns whose values are defined by the primary key of another table in order to maintain referential integrity in the database?","answer_label":"Foreign key","answer_id":8496},{"id":548,"question":"Which of the following is an e-mail header field that is removed during the message transfer using SMTP?","answer_label":"Bcc","answer_id":5450},{"id":539,"question":"In a relational database, which of the following is the appropriate purpose for defining a foreign key?","answer_label":"To provide a constraint to maintain referential consistency between the records of related tables","answer_id":5487},{"id":1874,"question":"Which of the following is the main purpose of transaction support in a database management system?","answer_label":"To ensure that either all the updates corresponding to a given transaction are made or\nnone of them is made","answer_id":8703},{"id":6133,"question":"Which of the following information in IP header is used for routing the IP packets across networks?","answer_label":"Destination address field","answer_id":24747},{"id":4597,"question":"Which of the following is an appropriate language that can be used to develop\napplications running mainly on Web browsers?","answer_label":"JavaScript","answer_id":19105},{"id":6103,"question":"Which of the following is the appropriate specifications concerning 100Base-T?\n![](https://learn.viblo.asia/uploads/1/0/109a364c-8436-4207-94df-b806eae93671.png)","answer_label":"d","answer_id":24629},{"id":819,"question":"An attacker calls a corporate help desk, masquerading as an employee who has lost their password. The help desk staff resets the password to the company default \"password1.\" The attacker then uses this password to access the company network and information in the server. What is this type of attack called?","answer_label":"Social engineering","answer_id":4833},{"id":4350,"question":"Which of the following is an appropriate description of the virus pattern file that is used in virus protection measures for computers?","answer_label":"It is a file that records the signature code of known viruses and is used to detected viruses by the virus protection software.","answer_id":18263},{"id":5195,"question":"There are two methods of biometric authentication: one extracts physical characteristics and the other extracts behavioral characteristics. Which of the following uses behavioral characteristics?","answer_label":"Authentication is performed by extracting characteristics from the writing speed and pen pressure used when a signature is produced.","answer_id":21255},{"id":6407,"question":"Which of the following protocols is used for synchronizing the clocks in multiple nodes on the Internet?","answer_label":"NTP","answer_id":25755},{"id":6139,"question":"Which of the following is the function of S/MIME used for e-mails?","answer_label":"Encrypting e-mails and attaching a signature","answer_id":24771},{"id":461,"question":"Which of the following is located at layer 3 of the OSI basic reference model, and performs path selection and packet relay for an end-to-end communication?","answer_label":"Network layer","answer_id":5921},{"id":5106,"question":"When an optical fiber cable is used for data communication, which of the following is the approximate bandwidth (in units of THz) of the light within the range of wavelength from 1000 to 1400 nanometers? Here, in consideration of data transmission efficiency and such other factors, the effective speed of the light on the optical fiber cable can be assumed to be 2 ×10^8 m/s.","answer_label":"57","answer_id":20898},{"id":5975,"question":"Which of the following is the most appropriate description concerning the interconnection interfaces between computers and peripheral devices or between peripheral devices?","answer_label":"IEEE 802.11 refers to a family of specifications for wireless LAN, and includes several standards, such as IEEE 802.11a, 802.11b, and 802.11g, which define over-the-air interfaces between a wireless client and a base station or between two wireless clients.","answer_id":24113},{"id":4626,"question":"Which of the following is a characteristic of the QR code?","answer_label":"Using three symbols for detection, the code makes it possible to recognize the\nrotation angle and the direction of reading.","answer_id":19222},{"id":4774,"question":"Which of the following is an appropriate explanation of availability concerning RASIS?","answer_label":"A computer system is maintained in such a state that it can be used whenever necessary.","answer_id":19730},{"id":2796,"question":"Which of the following is an appropriate description of locks?","answer_label":"For a resource on which transaction T1 has acquired a shared lock, transaction T2 can acquire a shared, but not an exclusive, lock.","answer_id":12185},{"id":3470,"question":"Which of the following is a protocol used by the ping command in order to verify that the communication link between source and destination is working in the TCP/IP network environment?","answer_label":"ICMP","answer_id":14803},{"id":3645,"question":"Which of the following can be achieved by receiving mail text and its hash value from the sender and comparing the hash value with the one calculated from the mail text by the receiver? Here, the hash value from the sender is protected.","answer_label":"Detection of presence or absence of falsification","answer_id":15496},{"id":2203,"question":"When the SQL statement shown below is executed on the “Employee” table and the\n“Department” table, which of the following is the result?\n![](https://learn.viblo.asia/uploads/9/6/96bbf683-0419-4538-a165-40bbd0558064.png)","answer_label":"3","answer_id":9918},{"id":6097,"question":"How many magnetic tapes are required to create and manage backup copies of server\nfiles under the following conditions?\n\n[Processing conditions]\n\n(1) A full backup copy is made at the beginning (on the first day) of each month. One\nmagnetic tape is required per full backup.\n\n(2) An incremental backup copy is made each day between the day following the day\nwhen a full backup copy is made and the day when the next full backup copy is made.\nAn incremental backup copy is added to a separate magnetic tape dedicated to\nincremental backups. All the incremental backup copies made during a one-month\nperiod can be recorded on a single magnetic tape.\n\n(3) It is guaranteed that any file can always be restored to the state of any specified day\nwith respect to any data for any day not earlier than this day six months ago. Here, if\nthis day of the month did not exist six months ago, it is guaranteed that any file can be\nrestored to the state of any specified day with respect to any data for any day not\nearlier than the last day six months ago. (For example, if the current day is October\n31, it is guaranteed that any file can be restored to the state of any specified day with\nrespect to any data for any day not earlier than April 30.)","answer_label":"14","answer_id":24604},{"id":2793,"question":"The data model shown in the figure below is implemented as three (3) tables. At this time, which of the following is an appropriate combination of A and B in the “Transfer” table in which the transaction of “the sales of 500 dollars to Company C are booked in the cash account on April 4, 2015” is recorded? Here, the data model is described in UML.\n![](https://learn.viblo.asia/uploads/b/b/bb1debe5-f248-46af-bbdc-4ce565e373f6.png)\n![](https://learn.viblo.asia/uploads/3/1/31a56c4c-5aef-4483-8dca-3c169269b0fb.png)\n![](https://learn.viblo.asia/uploads/d/c/dc9b5383-882f-4b6b-93f5-0a518ed0bb60.png)","answer_label":"d","answer_id":12174},{"id":5107,"question":"Which of the following is an appropriate description concerning interconnection devices between LANs?","answer_label":"The repeater extends the transmission distance by amplifying signals between the same types of segments.","answer_id":20903},{"id":5103,"question":"Which of the following is the appropriate flow of execution of SQL statements?","answer_label":"Decomposition => Optimization => Code generation => Execution","answer_id":20887},{"id":6138,"question":"When a message is sent to Person A from Person B using public key cryptography, which of the following keys should be used for encrypting the message?","answer_label":"A’s public key","answer_id":24767},{"id":2799,"question":"In a TCP/IP environment, which of the following is a standard for attaching image data to an email?","answer_label":"MIME","answer_id":12196},{"id":2940,"question":"As an example of the use of big data, which of the following is a process that uses statistical or other methods to obtain new knowledge (such as trends and patterns) from a large amount of data?","answer_label":"Data mining","answer_id":12746},{"id":6094,"question":"Which of the following is the appropriate description concerning black box testing?","answer_label":"b) Even if any redundant code exists in a tested program, it cannot be detected.","answer_id":24591},{"id":2953,"question":"Which of the following is an appropriate description concerning BYOD and the associated information security risk?","answer_label":"An employee uses his or her own personal terminal for business purposes, which causes an increase in information security risks such as virus infections due to inadequate security settings.","answer_id":12799},{"id":1888,"question":"Which of the following is a mechanism that allows several subclasses of a common parent class to override the same method with different behaviors?","answer_label":"Polymorphism","answer_id":8762},{"id":3343,"question":"Which of the following is the most appropriate method of determining whether to\nenable or disable communication that can be achieved by using the ARP mechanism\nfor a PC in which communication is requested?","answer_label":"The MAC address of the PC is checked, and communication is permitted only when\nthe MAC address has been registered beforehand.","answer_id":14306},{"id":3336,"question":"In the traditional IPv4 addressing scheme, which of the following is the private IP\naddress range that is reserved for Class B?","answer_label":"172.16.0.0 through 172.31.255.255","answer_id":14280},{"id":746,"question":"Which of the following is a description of a brute force attack by which an attempt is made to find the key of private key cryptography?","answer_label":"Finding the key by testing all key combinations sequentially when a set of plaintext and ciphertext is given","answer_id":5127},{"id":13807,"question":"Which of the following activitiestargets the DHCP server and exhausts all its available IP address pool so that it cannot provide any IP addresses to its clients?","answer_label":"DHCP starvation","answer_id":53481},{"id":826,"question":"Companies usually provide a means for their mobile workforce to access the corporate network securely over the Internet through insecure channels such as open wireless networks in hotels or coffee shops. Which of the following is the appropriate technology that can be used for this purpose?","answer_label":"VPN (Virtual Private Network)","answer_id":4805},{"id":2941,"question":"Which of the following is the most appropriate information for a router to determine the destination of an incoming packet?","answer_label":"Destination IP address","answer_id":12749},{"id":2795,"question":"When a manager is analyzing the sales of products in a supermarket, he makes a query to list all products with their sales amount, including the products that have no sales amount. Which of the following is an appropriate combination of statements to be filled in the boxes in the query? Here, the columns of Product and Sales are shown below.\n![](https://learn.viblo.asia/uploads/e/3/e34ce05a-f699-4a92-aecc-34cf432200e9.png)","answer_label":"d","answer_id":12182},{"id":810,"question":"Which of the following is an appropriate explanation of schema in RDBMS?","answer_label":"It is a set of data definitions, such as the nature of data, the format of data, and the relation with other data.","answer_id":4872},{"id":1876,"question":"TCP/IP is a layered set of communication protocols consisting of the Network Interface layer, the Internet layer, the Transport layer, and the Application layer. Which of the following is a combination of the Transport layer protocols?","answer_label":"TCP, UDP","answer_id":8714},{"id":815,"question":"Which of the following is an Internet service that translates a domain name such as www.itpec.org into its corresponding IP address?","answer_label":"DNS","answer_id":4851},{"id":6134,"question":"Which of the following network topologies is commonly used, especially in Fast or Gigabit Ethernet, for connecting network devices via a centralized unit such as a hub or a switch?","answer_label":"Star","answer_id":24753},{"id":1887,"question":"In unit testing, which of the following activities is part of “white box testing”?","answer_label":"Condition testing","answer_id":8756},{"id":1629,"question":"Which of the following technology is the most suitable to divide the whole company network into the networks by department?","answer_label":"VLAN (Virtual Local Area Network)","answer_id":7645},{"id":1819,"question":"Which of the following is a memory module that uses a flip-flop circuit in a memory cell?","answer_label":"SRAM","answer_id":8486},{"id":1833,"question":"Which of the following is an appropriate characteristic of MAC (Message Authentication Code) that is used to authenticate a message and provide its integrity in cryptography?","answer_label":"It is constructed from cryptographic hash functions.","answer_id":8540},{"id":1875,"question":"Which of the following is a data link layer function that enables receivers to control the amount of data to be received from the senders?","answer_label":"Flow control","answer_id":8709},{"id":749,"question":"Which of the following is a security attack that prevents users from accessing their accounts?","answer_label":"Denial of Service","answer_id":5115},{"id":740,"question":"Which of the following is a feature of a switching hub (layer 2 switch) network device?","answer_label":"It forwards a received packet only to its LAN port connected to a device with the packet’s destination MAC address.","answer_id":5152},{"id":3646,"question":"When the judgment threshold is changed in a biometric authentication system, which of the following shows the relationship between FRR (False Rejection Rate) and FAR (False Acceptance Rate)?","answer_label":"As FRR decreases, FAR increases.","answer_id":15500},{"id":6143,"question":"Which of the following explains the pattern matching method that is used by antivirus software?","answer_label":"Viruses are detected by comparison with the signature codes of known viruses.","answer_id":24788},{"id":6102,"question":"Which of the following IP addresses can be used to connect a computer directly to the\r\nInternet?","answer_label":"203.162.1.160","answer_id":24625},{"id":2015,"question":"Which of the following is an appropriate method of authenticating users by using a password?","answer_label":"The password is converted to a hash value and registered, and the password entered during\nauthentication is converted by the hash function and compared.","answer_id":9220},{"id":1884,"question":"Which of the following is an explanation of the pattern-matching method used by antivirus software?","answer_label":"A virus is detected through comparison with the signature of an already-known virus.","answer_id":8746},{"id":774,"question":"When a developmental process of utilizing big data is classified into the four (4) stages below, which of the following is an example that corresponds to the fourth stage?\n(Developmental stages of big data utilization)\nStage 1: Confirmation of facts in the past and present (what was it before?)\nStage 2: Interpretation of the past and present status (why have/had it be so?)\nStage 3: Prediction of the occurrence of a possible event in the future (what is it likely to\nbe?)\nStage 4: Development into a future activity (what should be done?)","answer_label":"Based on the big data, cases of operational errors made by users and increase in the failure rate due to such cases are estimated and the user interface is improved to make it less likely to cause operational errors.","answer_id":5015},{"id":470,"question":"When a mirror port is prepared to allow a LAN analyzer to be used to investigate the cause of a network failure, which of the following is a point to consider?","answer_label":"Since the LAN analyzer can display the packets that pass through the network, it is\nnecessary to pay attention to misuse or abuse such as wiretapping.","answer_id":5898},{"id":816,"question":"Which of the following is an appropriate description of the netstat utility?","answer_label":"It displays active TCP connections.","answer_id":4846},{"id":2047,"question":"Which of the following is an appropriate explanation concerning the data structure in a relational database?","answer_label":"Data is represented with one or more two-dimensional tables.","answer_id":9347},{"id":4613,"question":"Which of the following is the general-purpose markup language that allows its users\nto define their own tags and to facilitate the sharing of data across different\ninformation systems, particularly via the Internet?","answer_label":"XML","answer_id":19170},{"id":5105,"question":"Which of the following is the most appropriate description concerning the exclusive control of a DBMS?","answer_label":"Exclusive control is necessary for data that might be updated simultaneously by several people.","answer_id":20893},{"id":457,"question":"The attributes of the relation “OrderRecord” have the functional dependency (1) to (6) below. Normalization is performed with these functional dependencies up to the third normal form, and the decomposition into the relations “Product,” “Customer,” “Order,” and “OrderDetails” are performed. Which of the following is appropriate for the relation “OrderDetails”? Here, {X, Y} represents a combination of the attributes X and Y, and X → Y represents that X functionally determines Y. The solid underline represents a primary key.\n\n            OrderRecord (OrderNumber, OrderDate, CustomerNumber, CustomerName,\n                                  ProductNumber, ProductName, Quantity, UnitSalesPrice)\n\n[Functional dependency]\n    (1) OrderNumber, → OrderDate\n    (2) OrderNumber, → CustomerNumber\n    (3) CustomerNumber → CustomerName\n    (4) {OrderNumber, ProductNumber} → Quantity\n    (5) {OrderNumber, ProductNumber} → UnitSalesPrice\n    (6) ProductNumber → ProductName","answer_label":"OrderDetails (OrderNumber, ProductNumber, Quantity, UnitSalesPrice)","answer_id":5983},{"id":6131,"question":"As shown in the table below, there are five transactions T1 through T5 that are performed simultaneously in parallel, in any order. Which of the following is the combination of transactions that has the possibility of a deadlock? Here, only one transaction can have an exclusive lock at a time. Shared locks can be used with multiple transactions.\n![](https://learn.viblo.asia/uploads/f/c/fc516029-d870-4b3b-87d7-80b3d7e80f05.png)","answer_label":"d","answer_id":24741},{"id":5174,"question":"When four jobs A through D shown in the table below are executed on a first-come first-served basis, which of the following is the average waiting time (in minutes) in the job queue? Here, the job queue is empty before job A arrives.\n![](https://learn.viblo.asia/uploads/9/a/9abc59a0-11ca-4970-b8b4-8c39daf5ca5a.png)","answer_label":"2.5","answer_id":21169},{"id":5177,"question":"The figure shown below represents a logic gate and its timing chart. Which of the following is an appropriate logical function of this gate? Here, both A and B are the input signals, and F is the output signal.\n![](https://learn.viblo.asia/uploads/7/c/7c429fcd-d842-49d8-bcf3-e902d4465dd2.png)","answer_label":"Exclusive-NOR","answer_id":21182},{"id":818,"question":"Which of the following is an appropriate term associated with the fraudulent action of impersonating an authorized person?","answer_label":"Spoofing","answer_id":4836},{"id":6305,"question":"![](https://learn.viblo.asia/uploads/8/b/8bae03ee-d09d-4d55-b8d8-53d5ee033a3d.png)","answer_label":"c","answer_id":25367},{"id":5192,"question":"Which of the following is the protocol that is expanded and standardized based on SSL (Secure Sockets Layer) v3 but cannot interoperate with SSL?","answer_label":"TLS (Transport layer security protocol)","answer_id":21244},{"id":5196,"question":"Which of the following is a method that is used to check if an image or other digital content has been illegally copied and resold?","answer_label":"Digital watermark","answer_id":21260},{"id":3474,"question":"When Mr. A sends his confidential message to Mr. B by using public key cryptography as shown in the figure below, which of the following is the appropriate key K used for encryption?\n![](https://learn.viblo.asia/uploads/3/b/3b907b91-faae-49fa-bd1e-61cdd5bc8cf5.png)","answer_label":"Mr. B’s public key","answer_id":14821},{"id":6008,"question":"Which of the following is an appropriate description concerning security measures for network systems?","answer_label":"By using a circuit-switched network with closed-area connection functions, limiting connections to particular user groups is an effective way to prevent unauthorized external access.","answer_id":24243},{"id":536,"question":"When an order data shown below is entered, which of the following is the data validation that is performed to determine whether the order date is on or before the business day on which the data is entered?\n\n![](https://learn.viblo.asia/uploads/6/3/63eb3c10-cb20-494a-b773-13c5f647eb12.png)","answer_label":"Logical check","answer_id":5500},{"id":4802,"question":"Which of the following is an appropriate description concerning the recovery process of databases?","answer_label":"At the restart known as “warm start,” control goes back to the checkpoint, and the update information log is used for recovering the database.","answer_id":19843},{"id":4343,"question":"Which of the following is an appropriate statement in regard to the transmission operation of nodes connected to a LAN in the CSMA/CD method?","answer_label":"Each node checks whether the carrier is busy and can transmit only if the carrier is not busy. When collision is detected, transmission is tried again after a random time has elapsed.","answer_id":18233},{"id":3827,"question":"In an SQL statement, which of the following is an appropriate explanation of the percent symbol (%) that is used with the LIKE operator in a WHERE clause?","answer_label":"It is a wildcard character that matches any string of zero or more characters.","answer_id":16198},{"id":825,"question":"Which of the following is an appropriate method to prevent a buffer overflow attack?","answer_label":"Performing the boundary check on all string variables in the program to confirm that the length of the input string does not exceed the size of the designated variable","answer_id":4809},{"id":2060,"question":"Which of the following is the function that can be implemented with HTTPS?","answer_label":"Server authentication with an electronic certificate","answer_id":9400},{"id":5999,"question":"Which of the following is an appropriate explanation of the schema in a relational database management system?","answer_label":"It is a set of data definitions, such as the data attributes, data formats, and relationships with other data.","answer_id":24207},{"id":545,"question":"Which of the following is the maximum theoretical data rate (in Mbps) achievable in the IEEE 802.11n network?","answer_label":"600","answer_id":5469},{"id":1627,"question":"In a database that manages user information, there exists an application that searches for user information and displays it. In terms of security management, which of the following is an appropriate level of privilege for access to the database to be assigned to this application? Here, the scope of each privilege is as below.\n\n[Scope of privilege]\nReference privilege: Records can be referred to.\nUpdate privilege: Records can be registered, changed, and deleted.\nAdministrator privilege: Tables can be referenced, registered, changed, and deleted.","answer_label":"Reference privilege","answer_id":7636},{"id":613,"question":"Which of the following is the malware that is used to gain unauthorized privileged access, hide its own presence, and to perform malicious activities in a computer system?","answer_label":"Rootkit","answer_id":5416},{"id":2209,"question":"A PC and a web server are communicating via HTTP. When a request packet is sent\nfrom the PC to the web server, which of the following combinations of port numbers does\nthe response packet have? Here, the source and the destination port numbers of the request\npacket are 50001 and 80 respectively.\n\n![](https://learn.viblo.asia/uploads/7/5/7516943c-dc25-4a61-8453-459543fee2d9.png)","answer_label":"a","answer_id":9934},{"id":1839,"question":"Which of the following is an explanation of BYOD (Bring Your Own Device)","answer_label":"An employee brings his or her own personal terminal to the office to use for work, which causes an increase in security risks such as virus infections caused by inadequate security settings.","answer_id":8564},{"id":3476,"question":"Which of the following is a collection of infected computers that have been compromised without their owners realizing it and are being remotely controlled by attackers, in order to typically send spam or attack other computers?","answer_label":"Botnet","answer_id":14826},{"id":4798,"question":"Which of the following is the most appropriate information used by routers in order to determine the routing paths of packets?","answer_label":"Destination IP address","answer_id":19826},{"id":5978,"question":"Which of the following is the international standard of the document description language that defines how to describe the logical structure and makes it easy to manage and exchange electronic documents?","answer_label":"SGML","answer_id":24125},{"id":5997,"question":"Which of the following methods is used for avoiding unnecessary collisions in the IEEE 802.11 family of wireless LAN standards?","answer_label":"CSMA/CA","answer_id":24200},{"id":4801,"question":"When a program accesses relational database tables by means of embedded SQL statements, which of the following SQL statements is used to define the derived table?","answer_label":"DECLARE CURSOR","answer_id":19839},{"id":1885,"question":"Which of the following can be implemented with the functions of HTTPS (HTTP over SSL/TLS)?","answer_label":"Encryption of communication between a Web server and a browser","answer_id":8748},{"id":5187,"question":"Which of the following is the server that can be used to intercept all messages entering and leaving the network and to effectively hide the true network addresses?","answer_label":"Proxy server","answer_id":21224},{"id":1762,"question":"Which of the following SQL statements for the table “ShipmentRecord” obtains the largest value?\n![](https://learn.viblo.asia/uploads/b/f/bfa5b2a9-3b6f-4fbd-b063-cf4b59a56eae.png)","answer_label":"SELECT COUNT(*) FROM ShipmentRecord","answer_id":8256},{"id":3459,"question":"Which of the following is the image processing technique that is used for pasting a two-dimensional image such as a pattern or design onto the surface of a modeled object?","answer_label":"Texture mapping","answer_id":14761},{"id":4346,"question":"Which of the following appropriately describes a domain (defined area), a term used for relational databases?","answer_label":"It is a set of values that attributes can hold.","answer_id":18246},{"id":5175,"question":"CPU utilization of a computer system can be improved by using multiprogramming. If there is one process in memory, the CPU utilization is (1 –p). Here, “p” is the fraction of time (e.g., I/O time) that a process spends away from the CPU. If there are “n” processes in memory, the probability of “n” processes waiting for an I/O is p*p...*p (n times). The CPU utilization is equal to (1 – p^n). When the system has enough main memory space to hold four processes and each process waits for I/O completion during 50% of the execution time, which of the following is the percentage of the CPU time wasted by waiting for I/O completion?","answer_label":"6.25","answer_id":21173},{"id":5115,"question":"As a security measure on the Internet, a type of challenge-response test called a CAPTCHA can be used to determine whether the client is a human or a computer program. Which of the following is an appropriate purpose of using such a measure?","answer_label":"To protect against automated spamming","answer_id":20935},{"id":2798,"question":"Which of the following is an appropriate description of network devices?","answer_label":"A repeater extends transmission distances by amplifying signals between the segments of the same type.","answer_id":12193},{"id":2197,"question":"When ordering data in the format below is entered, which of the following is an\nappropriate check to examine whether the value of the Order date field is on a business day\nequal to or prior to the entering date?\n\n![](https://learn.viblo.asia/uploads/f/b/fb3cfa78-5f9a-4c80-97db-64bb6a0b6de3.png)","answer_label":"Logical check","answer_id":9894},{"id":2801,"question":"In IPv6 networks, what is the length of an IP address in bits?","answer_label":"128","answer_id":12205},{"id":808,"question":"Which of the following is an appropriate explanation of clipping in 3D graphics processing?","answer_label":"It is a method to selectively enable or disable rendering operations within a defined region of interest.","answer_id":4878},{"id":6107,"question":"Which of the following is the appropriate SQL statement that is used to create Table A\nfrom Persons Table?\n\n![](https://learn.viblo.asia/uploads/9/6/96f315e1-f19b-41b5-af54-c173a2e19f2b.png)","answer_label":"SELECT name FROM Persons WHERE country LIKE '%Korea%'\r\nAND gender = 'F' OR age = 26","answer_id":24643},{"id":2938,"question":"After relations X and Y are joined, which of the following is (are) the relational algebra operation(s) to obtain relation Z?\n![](https://learn.viblo.asia/uploads/3/3/33e04fa4-ee2e-42cb-b9d1-f87b2298428e.png)","answer_label":"Projection and selection","answer_id":12737},{"id":612,"question":"Which of the following is the combination of processes that constitutes risk assessment?","answer_label":"Risk identification, risk analysis, and risk evaluation","answer_id":5420},{"id":6006,"question":"In the context of message authentication code, which of the following is the purpose of using message digests?","answer_label":"To confirm that no message has been tampered with","answer_id":24237},{"id":752,"question":"Which of the following is the technique of actually attempting an attack and intrusion on a system to detect the security-related vulnerabilities of a computer or network?","answer_label":"Penetration test","answer_id":5102},{"id":13801,"question":"Locations A and B, both on the ground, communicate via a geostationary satellite at an altitude of about 36,000 km. When the distance between each location and the satellite is 37,500 km, and the delay caused by the relay at the satellite is 10 milliseconds, what is the total delay in seconds for the data sent from A to arrive at B? Here, the propagation speed of radio waves is 3×10^8 m per second","answer_label":"0.26","answer_id":53455},{"id":3638,"question":"Which of the following is the appropriate description concerning exclusive control in a database?","answer_label":"When a shared lock is applied to a resource by a transaction, another shared lock can be applied to it by another transaction.","answer_id":15468},{"id":550,"question":"Which of the following is the purpose of using a message digest in a message authentication code?","answer_label":"To confirm that there is no falsification of a message","answer_id":5444},{"id":5102,"question":"As shown below, when the SQL statement is executed on the relational database table “Staff”, which of the following tables is created?\n![](https://learn.viblo.asia/uploads/b/c/bc999692-dd25-4cbe-97be-e26d6a316538.png)\n![](https://learn.viblo.asia/uploads/3/2/323cbf07-65ec-441c-bb32-c07997b72589.png)","answer_label":"b","answer_id":20882},{"id":2955,"question":"Which of the following is an appropriate description of honeypots?","answer_label":"Computer system designed to detect or counteract unauthorized access","answer_id":12806},{"id":1881,"question":"When Mr. A , who has a digital certificate, uses an e-mail to place an order with store B , he uses his own private key and digitally signs the e-mail. Store B then uses Mr. A ’s public key to confirm the signature. Which of the following can be achieved using this method? Here, only Mr. A can use his private key.","answer_label":"It can be confirmed that the order arriving at store B is an order from Mr. A.","answer_id":8732},{"id":3829,"question":"Which of the following is an appropriate explanation concerning the NAT function of a router used for Internet connection?","answer_label":"Conversion between private IP addresses and global IP addresses can be performed.","answer_id":16204},{"id":4490,"question":"![](https://learn.viblo.asia/uploads/2/d/2dbd8b6c-24e2-4910-8870-737ca310352e.png)","answer_label":"b","answer_id":18728},{"id":2810,"question":"Which of the following is a technique where a system is actually attacked and an intrusion attempt is made in order to detect security-related vulnerabilities of a computer or network?","answer_label":"Penetration test","answer_id":12239},{"id":13798,"question":"There arethree tables, EMPLOYEE, PROJECT, and WORK_PROJ for recording employees, projects, and working information of employees on projects respectively. When the SQL statement shown below is executed for these tables, which of the following is generated as the output? \n![](https://learn.viblo.asia/uploads/1/8/189842c1-71e7-4852-8ad9-c9d79d267b4b.png)","answer_label":"d","answer_id":53445},{"id":3341,"question":"Which of the following is an appropriate description of a directory traversal attack?","answer_label":"The attacker specifies files on the server by using a path that is unexpected by an\nadministrator, and gains unauthorized access to classified files.","answer_id":14301},{"id":5168,"question":"Which of the following is the configuration of distributed system where hierarchical or dependency relations exist between processors as with relationships between clients and servers?","answer_label":"Vertical function distribution","answer_id":21147},{"id":4611,"question":"Which of the following operations is performed on the packet header while the data\npacket moves from the lower to upper layers according to the OSI basic reference\nmodel?","answer_label":"Header deletion","answer_id":19160},{"id":742,"question":"In an IPv4 network with subnet mask 255.255.255.224, what is the maximum number of host addresses assigned?","answer_label":"30","answer_id":5145},{"id":1880,"question":"Which of the following is a technique that is classified as social engineering?","answer_label":"Acquiring a password by calling a user and pretending to be a system administrator","answer_id":8727},{"id":6044,"question":"An integer m is stored in a register as binary value. If this value is shifted to the left by three bits and m is added to the shifted value, how many as large as m is the resulting number? Here, no overflow occurs.","answer_label":"9","answer_id":24392},{"id":1872,"question":"Which of the following is an appropriate method used to remove data redundancy in relational database systems?","answer_label":"Normalization","answer_id":8698},{"id":1820,"question":"Which of the following is the function of a human interface that is used for reducing the number of operations of a user who frequently performs routine work?","answer_label":"A macro function by which a series of commands is grouped together","answer_id":8490},{"id":1830,"question":"A system administrator has a plan to monitor a network in order to evaluate which employees are using an excessive amount of bandwidth on peer-to-peer sharing services. Which of the following is the most appropriate technique for achieving such a purpose?","answer_label":"Packet sniffing","answer_id":8528},{"id":4595,"question":"Which of the following is an appropriate description concerning throughput?","answer_label":"Spooling in which the output to the printer is temporarily stored on a hard disk drive\nis helpful for increasing the throughput.","answer_id":19095},{"id":6417,"question":"Which of the following is an advantageous effect of encrypting e-mails?","answer_label":"It is possible to prevent the contents of e-mails from leaking out.","answer_id":25796},{"id":5977,"question":"Which of the following is the main purpose of optimization performed by a compiler?","answer_label":"To reduce program execution time","answer_id":24121},{"id":4795,"question":"Which of the following is the network topology that is used to connect one central node or hub with point-to-point links to several other nodes?","answer_label":"Star","answer_id":19817},{"id":547,"question":"In telecommunication, which of the following is a standard for wireless broadband communication for mobile devices and data terminals?","answer_label":"LTE","answer_id":5455},{"id":6106,"question":"In a database system employing incremental log with immediate updates, information in\nthe log is used in restoring the state of the system to a previous consistent state when a\ncrash occurs. A log record is generated upon execution of a write operation. Each\nlog record consists of the transaction name $T_i$, the data item name, the old value of the\ndata item, and the new value of the data item. The log record shown below is the normal\ntransaction sequence after the last checkpoint. Which of the following recovery\nactions should be performed after a restart of the system if a crash occurs just after <\n$T_2$ , C, 3000, 3500> and before < $T_2$ , commit>?\n\n![](https://learn.viblo.asia/uploads/f/8/f8ec0919-6ce7-447a-889a-f0157d7721e7.png)","answer_label":"d","answer_id":24641},{"id":6383,"question":"In order to make a multiplexing system with an availability of at least 0.999 by using devices with an availability of 0.9, how many of these devices need linking together in parallel?","answer_label":"3","answer_id":25659},{"id":2037,"question":"Which of the following is the addressing mode where the operand of an instruction is used to point to the memory address that contains the address of the data to be operated upon?","answer_label":"Indirect addressing","answer_id":9308},{"id":4347,"question":"Which of the following operations extracts specific columns from tables in a relational database?","answer_label":"Projection","answer_id":18250},{"id":6303,"question":"![](https://learn.viblo.asia/uploads/7/c/7c9930e8-3c98-4119-8711-3c2765a4b1b2.png)","answer_label":"b","answer_id":25360},{"id":2018,"question":"There is a network that is divided into three (3) segments, namely, an external segment, a demilitarized zone (DMZ), and an internal network by one (1) firewall. In the network, when a service for users is published on the Internet by using a system consisting of a Web server and a database (DB) server containing critical data, which of the following is the most appropriate method of server installation for protecting important data from unauthorized access from the Internet? Here, only a specific protocol is allowed for communication between the external segment and the DMZ, and between the DMZ and the internal network by the firewall, and communication between the external segment and the internal network is not allowed","answer_label":"The Web server is installed in the DMZ, and the DB server is installed in an internal\nnetwork","answer_id":9233},{"id":3825,"question":"In a relational database, which of the following is an appropriate definition of a composite key?","answer_label":"A primary or foreign key that consists of two or more attributes of a relation","answer_id":16188},{"id":6403,"question":"An IP address in IPv4 consists of two parts: the network address part and the host address part. Which of the following is the appropriate description concerning the network address and the host address? Here, n is the number of bits in the network address part, and h is the number of bits in the host address part. In addition, the special-purpose and ineffective addresses should not be counted as an effective address.","answer_label":"In classes A, B, and C, the maximum number of effective host addresses available to one network is defined as 2^h– 2.","answer_id":25738},{"id":1619,"question":"In TCP/IP networks, which command uses the ICMP “Echo”, “Echo Reply” and “Destination Unreachable” messages to test the reachability of the communication partner ?","answer_label":"ping","answer_id":7606},{"id":609,"question":"In ISO/IEC 27000:2018 (Information Security Management Systems – Overview and Vocabulary), which of the following is defined as the “property that an entity is what it claims to be”?","answer_label":"Authenticity","answer_id":5431},{"id":3465,"question":"Which of the following is an appropriate set of characteristics of a data warehouse in comparison with traditional databases?","answer_label":"Integrated, subject-oriented, non-volatile, and time-variant","answer_id":14783},{"id":543,"question":"Which of the following is an appropriate description of the lock operation that is used for the concurrency control of a transaction?","answer_label":"For a resource on which a shared lock is acquired, the acquisition of a new shared lock by another transaction is permitted.","answer_id":5474},{"id":5172,"question":"In a certain processor, a timer interrupt is generated at a clock frequency of 60 Hz on a “per clock tick” basis. It takes 2 milliseconds (including process switching overhead) to handle the interrupt. What is the percentage of the interrupt handling time in the processor?","answer_label":"12","answer_id":21162},{"id":6001,"question":"Which of the following is a non-updatable view?","answer_label":"A view including a “GROUP BY” clause in the view definition","answer_id":24216},{"id":4598,"question":"Which of the following appropriately describes a typical feature of ADSL?","answer_label":"By separating the frequency bands used by analog telephones and data\ncommunications, it allows both of these connections to be used simultaneously.","answer_id":19107},{"id":13800,"question":"Which device performs protocol conversion between different types of networks, functioning at the layers of transport and above in the OSI basic reference model?","answer_label":"Gateway","answer_id":53451},{"id":1835,"question":"Which of the following is the salami technique that is used in computer crime?","answer_label":"It is a technique where theft is performed in small increments from many assets so that this fraudulent behavior is not noticed.","answer_id":8550},{"id":3335,"question":"Which of the following is the unit of transmission that is handled in the data link layer of\nthe OSI basic reference model and includes a header (and possibly a trailer) along with\nsome number of units of upper-layer data?","answer_label":"Frame","answer_id":14275},{"id":458,"question":"Which of the following is an appropriate description of the mapping between the relational model and relational database as its implementation?","answer_label":"A relation is mapped to a table.","answer_id":5957},{"id":13794,"question":"Audio signals are recorded using 8-bit samples at a sampling rate of 11,000 times per second. When a flash memory of 512 × 10^6 bytes is used, what is the maximum recording time of such data in minutes?","answer_label":"775","answer_id":53428},{"id":551,"question":"Which of the following is a role that a PKI certification authority performs as a reliable third party?","answer_label":"Issuing a digital certificate that certifies the public key of a user or server","answer_id":5441},{"id":2038,"question":"Which of the following is an appropriate characteristic of Bluetooth?","answer_label":"The short range (up to about 100 m) of wireless voice/data communication is defined.","answer_id":9312},{"id":1871,"question":"Which of the following is more suitable for outline fonts than for bitmap fonts?","answer_label":"To enlarge characters by a given scale factor","answer_id":8694},{"id":5173,"question":"In a preemptive multitasking OS environment, when a process is preempted by another process with a higher priority, which of the following is the appropriate state where the former process is to be placed?","answer_label":"Ready","answer_id":21165},{"id":3468,"question":"Which of the following is the appropriate layer of the OSI basic reference model that provides RPC (Remote Procedure Call) support, maintains the integrity of the connection between nodes, and controls data exchange?","answer_label":"Session layer","answer_id":14797},{"id":1863,"question":"Which of the following is the mean time between failures (MTBF) value of the entire system where unit A and unit B are connected in series and both units operate as one system? The MTBF value of unit A and unit B is 200 and 300 hours, respectively.","answer_label":"250","answer_id":8660},{"id":4348,"question":"When a transaction fails, which of the following should be performed in order to abort it and to rebuild the previous state of the database?","answer_label":"Rollback","answer_id":18256},{"id":4792,"question":"When the subnet mask “255.255.255.0” is used in a “class A” network, how many host addresses can be assigned to network devices?","answer_label":"254","answer_id":19802},{"id":4794,"question":"Which of the following protocols is supported by the transport layer of the OSI basic reference model?","answer_label":"TCP","answer_id":19813},{"id":13811,"question":"Which of the following is the most appropriate countermeasure against cross-site scripting (XSS) attacks?","answer_label":"Filtering out the input that can be interpreted as a script","answer_id":53496},{"id":469,"question":"Which of the following is an appropriate terminology concerning the behavior that documents retrieved from distinct origins are isolated from each other?","answer_label":"Same-Origin Policy","answer_id":5903},{"id":5182,"question":"A publishing company produces textbooks for high school. Each book is written by an author who specializes in a subject. An editor is assigned to work with an author for a book. An editor can review several books while an author can write several books on the same subject. There are several authors on the same subject and several editors to choose from. The E-R diagram below shows the relationships between subject, author, book, and editor, but the relations between author and book and between author and editor are incomplete. Which of the following is the appropriate combination of relations that are applied to complete the E-R diagram? Here, 1______* indicates a one-to-many relation, *______* is a many-to-many relation.\n![](https://learn.viblo.asia/uploads/d/f/df589be0-3894-479b-9c84-8131f3b12cf9.png)","answer_label":"d","answer_id":21204},{"id":6416,"question":"Which of the following authentications can be realized with the information exchange between two communication actors X and Y according to the procedure below? \n[Procedure] \n(1) Y transmits a character string (challenge) including optional information to X. \n(2) X generates a new character string (response) from the received character string based on predetermined rules between X and Y, and sends back this character string (response) to Y. \n(3) Y confirms that the returned character string (response) is correct.","answer_label":"Y authenticates X.","answer_id":25792},{"id":13802,"question":"Which of the following is an appropriate characteristic of IPv6 addresses?","answer_label":"There are several address representations, one of which uses a hexadecimal string with every four digits (i.e., 16 bits) separated by a colon “ : ” .","answer_id":53460},{"id":2046,"question":"Which of the following is an explanation concerning the morphing technique in computer animation?","answer_label":"In order to represent the smooth transformation in appearance from an image to another image, multiple intermediate images are created.","answer_id":9344},{"id":4625,"question":"Which of the following is a method of phishing?","answer_label":"Someone sends e-mails to entice the recipients and to have them access fake Web\nsites that appear to be sites of actually existing companies etc. and steals personal\ninformation.","answer_id":19217},{"id":2049,"question":"In computer networking, which of the following is the most appropriate technical term that means the variation in packet delay that causes the degradation of the QoS (Quality of Service) of real-time audio or video streaming service such as VoIP?","answer_label":"Jitter","answer_id":9356},{"id":3644,"question":"Which of the following is a security feature that can allow network administrators to specify exactly which stations should have access to the wireless network?","answer_label":"MAC address filtering","answer_id":15492},{"id":4336,"question":"Computer font is an element in the user interface. Which of the following is the most appropriate explanation concerning the font?","answer_label":"A set of glyphs and associated information such as code points","answer_id":18206},{"id":4610,"question":"Which of the following is the appropriate protocol that is used to send e-mail\nmessages from one server to another over the Internet?","answer_label":"SMTP","answer_id":19158},{"id":750,"question":"Which of the following is an appropriate description of a botnet?","answer_label":"A collection of internet-connected devices, including IoT devices, infected and controlled by a common type of malware","answer_id":5110},{"id":2807,"question":"Biometric authentication includes a method of authentication by extracting physical characteristics, and a method of authentication by extracting behavior characteristics. Which of the following has behavior characteristics?","answer_label":"Performing authentication by extracting characteristics from the speed of and pressure on a pen when a signature is written","answer_id":12228},{"id":4615,"question":"Which of the following provides the function of mapping between domain names and\nIP addresses in a TCP/IP network?","answer_label":"DNS","answer_id":19176},{"id":2208,"question":"In a TCP/IP network hierarchical model, what is the name for Equipment A that\nconnects two LAN segments at the Internet Layer?\n![](https://learn.viblo.asia/uploads/6/2/62634953-9b7d-47d7-a4bd-ba32a26749d4.png)","answer_label":"Router","answer_id":9932},{"id":2948,"question":"An administrator captures network packets and discovers that hundreds of ICMP packets have been sent to the host. However, it is not a particularly busy time of the day. Which of the following is the most likely the attack executed against the computer in this situation?","answer_label":"Denial of service","answer_id":12777},{"id":5184,"question":"When the table below is used to design a relational database for managing a video-rental shop, which of the following can be a potential candidate key? Here, (X, Y) represents a tuple of attributes X and Y.\n![](https://learn.viblo.asia/uploads/0/f/0fd1c873-4bf8-4e87-ad47-e4c3f39c5e68.png)","answer_label":"(CID, VID, RDate)","answer_id":21210},{"id":1877,"question":"Which of the following is responsible for converting a domain name to a corresponding IP address?","answer_label":"DHCP server","answer_id":8715},{"id":738,"question":"Which of the following is the process that is executed periodically to prevent reducing the access efficiency of the database?","answer_label":"Reorganization","answer_id":5160},{"id":1623,"question":"Which of the following is a purpose of using message digest in a message authentication code?","answer_label":"To confirm that there is no falsification of a message","answer_id":7621},{"id":5166,"question":"When analog audio signals are converted into digital audio signals using the PCM method at a sampling rate of 44.1 kHz, which of the following determines the amount of the encoded digital data.","answer_label":"The quantization bit width of the audio data","answer_id":21140},{"id":5194,"question":"Which of the following is an appropriate description concerning a digital envelope?","answer_label":"The sender encrypts the message by using symmetric key cryptography and then encrypts the symmetric key by using public key cryptography.","answer_id":21251},{"id":6104,"question":"Which of the following is the correct table that is created by the “natural join” operation\nof two tables $T_1$ and $T_2$?\n![](https://learn.viblo.asia/uploads/c/a/ca3244d3-22a6-4117-b16d-facd8d11d8f0.png)\n![](https://learn.viblo.asia/uploads/a/a/aac7fd64-efc6-4466-a38f-74707bd09d42.png)","answer_label":"b","answer_id":24631},{"id":13804,"question":"Which of the following is an Internet standard that extends the format of email messages to support non-ASCII text as well as audio, video, and images","answer_label":"MIME","answer_id":53468},{"id":1841,"question":"Which of the following is an appropriate preventive measure against malware that is taken on a client PC?","answer_label":"In order that no virus exploits a vulnerability and infects a PC, revised software modules or patches are appropriately applied to the OS and applications.","answer_id":8574},{"id":6137,"question":"Which of the following protocols can be used to access e-mail messages that are stored on a remote, and possibly shared, mail server, and thereby are manipulated from a desktop computer at home, a workstation at the office, and a notebook computer while traveling, without the need to transfer messages back and forth between these computers?","answer_label":"IMAP","answer_id":24763},{"id":3836,"question":"Which of the following is the most appropriate explanation of a digital certificate that is authorized by a trusted third party known as a CA (Certification Authority)?","answer_label":"A document that verifiably associates a public key with a particular person or party","answer_id":16231},{"id":5111,"question":"A PKI involves two types of key pairs: signature key pairs, in which the private key is used for signing and the public key for checking; and exchange key pairs, in which the public key is used by an application to encrypt data, and the private key is used to decrypt the encrypted data. Which of the following is the key pair(s) that may be escrowed or backed up to prevent the loss of important data even when the corresponding key or keys are forgotten?","answer_label":"Exchange key pair","answer_id":20919},{"id":537,"question":"Which of the following is the most appropriate explanation of augmented reality (AR)?","answer_label":"By seamlessly interweaving a computer-generated information with the physical world, the viewer can perceive it as an immersive aspect of the real environment.","answer_id":5496},{"id":5190,"question":"In a URL (Uniform Resource Locator) specified to access a Web page through the Internet, which of the following is the appropriate sequence of four basic parts: the name of the Web page, directory and/or subdirectory which holds the Web page, access protocol, and host name?","answer_label":"protocol, host name, directory, page","answer_id":21235},{"id":5185,"question":"In the term “ACID”, which is the basic foundation that database transactions are built upon, what does the third character “ I ” stand for?","answer_label":"Isolation","answer_id":21216},{"id":13812,"question":"Which of the following is a method to prevent damage caused by an SQL injection attack?","answer_label":"Preventing input characters from being interpreted as characters that have a special meaning in querying or manipulating data in a database","answer_id":53498},{"id":5189,"question":"In the network shown below, the STP (Spanning Tree Protocol) is used on both S1 and S2 switches. When the link between two PCs A and C is established via L1, which of the following is the appropriate link that is used to transfer data between two PCs Band D?\n![](https://learn.viblo.asia/uploads/3/2/320a6cb8-1d47-4843-a9c0-5050e21a0710.png)","answer_label":"Always L1","answer_id":21229},{"id":6387,"question":"When large-scale websites are built, application servers are often used in addition to Web servers. Which of the following is an appropriate reason for this?","answer_label":"System modification or expansion is made easier in comparison with Web servers alone.","answer_id":25674},{"id":1824,"question":"Which of the following is an appropriate description of the ACID (Atomicity, Consistency, Isolation, and Durability) properties that are considered to be the key transaction processing features of a database management system (DBMS)?","answer_label":"Durability refers to the guarantee that once the user has been notified of success, the transaction persists, and is not undone.","answer_id":8505},{"id":6126,"question":"Which of the following is a user interface that enables frequently-used operations to be performed efficiently?","answer_label":"Shortcut key","answer_id":24720},{"id":2949,"question":"Which of the following is a description of spyware?","answer_label":"A program that is installed on a PC against the user’s intention and collects information such as the user’s personal information and access history","answer_id":12783},{"id":6414,"question":"Which of the following appropriately describes a group function of SQL?","answer_label":"A group function returns a single result row per group for a set of queried rows.","answer_id":25783},{"id":1902,"question":"Which of the following is a criminal act related to a computer virus according to the Convention on Cybercrime?","answer_label":"A person who found a virus that was created by a stranger stores the virus for the purpose that he/she can later run it on another person’s computer.","answer_id":8817},{"id":2811,"question":"Which of the following can be used to detect worms by using SHA-256 to calculate a hash value from a subject file, and then cross-checking this against a database of hash values from files containing specimens of known worms?","answer_label":"The same worm as a worm specimen","answer_id":12246},{"id":5171,"question":"Which of the following provides a job management function in OS that selects a program with the highest execution priority in the job queue and allocates resources required for the program?","answer_label":"Initiator","answer_id":21157},{"id":544,"question":"Which of the following is the device that operates only at the physical layer of the OSI model?","answer_label":"Repeater","answer_id":5471},{"id":4616,"question":"Which of the following is an appropriate purpose of installing a firewall in a computer\nnetwork?","answer_label":"To block and permit data traffic","answer_id":19180},{"id":538,"question":"Of the functions provided by a DBMS, which of the following is a means for achieving protection for data confidentiality?","answer_label":"Managing the data access rights of users","answer_id":5492},{"id":2051,"question":"Which of the following is a mechanism that enables a variety of information, such as still images, movies, and audio, to be sent via e-mail?","answer_label":"MIME","answer_id":9363},{"id":3830,"question":"Which of the following is the appropriate protocol that is used on top of UDP for delivering real-time audio and video streams over the Internet?","answer_label":"RTP","answer_id":16210},{"id":812,"question":"Among the phases of database design, which of the following phases involves the creation of an ER diagram?","answer_label":"Conceptual design of databases phase","answer_id":4862},{"id":5169,"question":"Which of the following is a framework or methodology of dividing the resources of a computer into multiple execution environments, by applying one or more concepts or technologies such as hardware and software partitioning, time-sharing, partial or complete machine simulation, emulation, quality of service, and many others?","answer_label":"Virtualization","answer_id":21152},{"id":1624,"question":"Which of the following is an attack that threatens the “integrity” in information security?","answer_label":"Falsification of a Web page","answer_id":7624},{"id":3837,"question":"Which of the following is a biometric recognition technique that is used for identifying a person by using the person’s own behavioral features as well as physiological features?","answer_label":"Voice recognition","answer_id":16238},{"id":3467,"question":"In an IPv4 environment, when the subnet mask “255.255.255.224” is used for a class C network, how many IP addresses including reserved or ineffective addresses can be assigned to subnets and hosts per subnet respectively?\n![](https://learn.viblo.asia/uploads/3/e/3e717488-98ad-4998-b536-bf35d15cbf29.png)","answer_label":"a","answer_id":14790},{"id":2017,"question":"Which of the following is an appropriate description of risk assessment?","answer_label":"The priority order of the response to risks is determined by the size of the risk based on\nthe expected amount of loss and occurrence probability.","answer_id":9229},{"id":737,"question":"Which of the following is a characteristic to guarantee that the result of an update transaction is either performed completely or canceled as if nothing happened?","answer_label":"Atomicity","answer_id":5162},{"id":820,"question":"A man-in-the-middle attack happens when an attacker intercepts communication and spoofs the identities of either of the two parties involved. How can such an attack be effectively countered?","answer_label":"Such an attack can be countered by having an authentication through a digital signature before accepting someone's public key.","answer_id":4827},{"id":5188,"question":"Which of the following is the data transmission technique that has features or characteristics shown below? \n- It is designed for cost-efficient data transmission for intermittent traffic between LANs and between end-points in a WAN. \n- Data is transmitted in a variable-size unit. \n- Error correction (i.e., retransmission of data is left up to the end-points. \n- It is based on the X.25 protocol, but it is faster because of a simplified X.25 protocol with minimal services. \n- It provides a mid-range service between ISDN and ATM.","answer_label":"Frame relay","answer_id":21226},{"id":13797,"question":"![](https://learn.viblo.asia/uploads/b/8/b89298e7-c2f0-4f11-9676-b462c9dbbbef.png)","answer_label":"b","answer_id":53439},{"id":3647,"question":"As shown in the figure, an application on a client has access to the database on a server via a pair of database connection programs. Which of the following is the appropriate measure for preventing the data transmitted and received between the database connection programs from being wiretapped on a communication line?\n![](https://learn.viblo.asia/uploads/7/8/78794de9-c5c1-42fa-813a-56041d51a4fa.png)","answer_label":"Encrypting the communication between the database connection programs on the client and server sides","answer_id":15504},{"id":2800,"question":"Concerning email protocols, which of the following descriptions is correct?","answer_label":"IMAP allows the message to remain on the server even after it is downloaded to a local PC.","answer_id":12199},{"id":1618,"question":"In OSI basic reference model, what devices are used for segmentation or coupling of Physical layer, Data Link layer and Network layer respectively?","answer_label":"Repeater, Bridge, Router","answer_id":7601},{"id":2805,"question":"Which of the following is an appropriate combination of the usage method of a signature key in a digital signature, and the purpose of a digital signature?","answer_label":"By the sender creating a digital signature with the signature key and attaching it to a message, the recipient can confirm the identity of the sender.","answer_id":12219},{"id":6135,"question":"What is the minimum number of communication cables that are needed to connect six network devices in a full mesh topology? Here, at least one communication cable is required to connect two network devices.","answer_label":"15","answer_id":24757},{"id":3641,"question":"Which of the following can be used to interconnect multiple LANs on the network layer (layer 3) of the OSI basic reference model and to relay packets of data?","answer_label":"Router","answer_id":15482},{"id":1821,"question":"Which of the following is a tag-based very flexible image file format that can be lossless or lossy, and is widely used for the interchange of digital image data among graphic artists, photographers, and the publishing industry?","answer_label":"TIFF","answer_id":8494}]