[{"id":13471,"question":"Lựa chọn nào sau đây là tên của cuộc tấn công mà hành vi được thực hiện nhằm đặt một trang web độc hại lên đầu của kết quả tìm kiếm của một trang web?","answer_label":"Nhiễm độc SEO","answer_id":52136},{"id":13500,"question":"Có một mạng mà được chia thành ba (3) phân đoạn, cụ thể là, phân đoạn bên ngoài, vùng phi quân sự (DMZ), và mạng nội bộ bên trong một (1) tường lửa. Trong mạng, khi một dịch vụ cho người dùng được công bố trên Internet bằng cách sử dụng một hệ thống gồm máy chủ web và máy chủ cơ sở dữ liệu (CSDL) có chứa dữ liệu quan trọng, lựa chọn nào sau đây là phương pháp cài đặt máy chủ thích hợp nhất để bảo vệ dữ liệu quan trọng khỏi việc truy cập trái phép từ Internet? Ở đây, chỉ có một giao thức cụ thể được tường lửa cho phép giao tiếp giữa các phân đoạn bên ngoài và DMZ, và giữa DMZ và mạng nội bộ, và giao tiếp giữa các phân đoạn bên ngoài và mạng nội bộ không được phép.","answer_label":"Máy chủ Web được cài đặt trong DMZ, và máy chủ CSDL được cài đặt trong một mạng bên trong","answer_id":52253},{"id":13496,"question":"Lựa chọn nào sau đây là một kỹ thuật mà được phân loại như là kỹ nghệ lừa đảo qua mạng xã hội?","answer_label":"Thu được mật khẩu bằng cách gọi người dùng và giả vờ là một quản trị viên hệ thống","answer_id":52234},{"id":13464,"question":"Giao thức TCP/IP nào sau đây được sử dụng để chỉ định địa chỉ IP động?","answer_label":"DHCP","answer_id":52107},{"id":13470,"question":"Lựa chọn nào sau đây là một cuộc tấn công đe dọa đến tính “toàn vẹn” của thông tin?","answer_label":"Giả mạo một trang web","answer_id":52131},{"id":13486,"question":"Đâu là mức độ tham gia thích hợp của quan hệ “Register” giữa thực thể “Customer” và thực thể “Car” mà khớp với biểu đồ bên dưới? Ở đây, “A..B” và “C..D” tương ứng chỉ ra mức độ tham gia liên kết tối đa và tối thiểu vào quan hệ.![](https://learn.viblo.asia/uploads/8/d/8df018d0-422c-48b8-b3f5-2ed48fbad3c8.jpg)","answer_label":"![](https://learn.viblo.asia/uploads/c/d/cd1af363-fb34-4f24-a811-be6f3bfb0a06.jpg)","answer_id":52195},{"id":13876,"question":"Lựa chọn nào sau đây là một dạng chuẩn hóa thích hợp (NF) được sử dụng trong cơ sở dữ liệu quan hệ trong đó mỗi thuộc tính không phải là khóa chỉ cần phụ thuộc vào khóa chính, và không có thuộc tính không phải là khóa nào phụ thuộc vào một thuộc tính không phải là khóa?","answer_label":"3NF","answer_id":53756},{"id":13483,"question":"Lựa chọn nào sau đây là giải thích về kỹ thuật tạo chất liệu?","answer_label":"Nó diễn tả các đặc điểm bề mặt nhờ việc dán một ảnh trên bề mặt của một vật thể ba chiều.","answer_id":52185},{"id":13490,"question":"TCP/IP là một tập hợp được phân tầng của các giao thức truyền thông bao gồm tầng Giao tiếp mạng, tầng Internet, tầng Giao vận, và tầng Ứng dụng. Lựa chọn nào sau đây là một sự kết hợp của các giao thức tầng Giao vận?","answer_label":"TCP, UDP","answer_id":52213},{"id":13484,"question":"Lựa chọn nào sau đây là mục đích thích hợp để chấp nhận một kiến trúc lược đồ ba-lớp của DBMS?","answer_label":"Để lấy được một bảng mới từ một bảng nguồn thông qua một thao tác quan hệ, nếu như bảng mới thực sự tồn tại","answer_id":52187},{"id":13489,"question":"Lựa chọn nào sau đây là chức năng tầng liên kết dữ liệu mà cho phép bên nhận điều khiển lượng dữ liệu sẽ được nhận từ bên gửi?","answer_label":"Điều khiển luồng","answer_id":52208},{"id":13888,"question":"Bob và Alice mã hoá mọi cuộc liên lạc của họ với nhau. Do mức độ nhạy cảm cao của các thông tin chia sẻ, họ đã thực hiện một cơ chế mã hóa để bảo mật các thông điệp của mình. Tuy nhiên, vấn đề của việc mã hóa này là Bob hay Alice không thể chắc chắn 100% rằng họ đang giao tiếp với nhau, họ cũng không thể chắc chắn 100% về sự toàn vẹn của nội dung các thông điệp. Phương pháp mã hóa nào sau đây là phương pháp mà Bob và Alice sử dụng?","answer_label":"Mật mã sổ tay dùng một lần","answer_id":53804},{"id":13472,"question":"Lựa chọn nào dưới đây là giải thích thích hợp cho một cuộc tấn công SQL injection?","answer_label":"Một cuộc tấn công mà nếu có một lỗi trong cách thức gọi cơ sở dữ liệu từ một ứng dụng web, kẻ tấn công có thể thực hiện truy xuất trái phép, sửa đổi và xóa dữ liệu trong cơ sở dữ liệu bằng cách nhập một chuỗi ký tự độc hại bằng ngôn ngữ thao tác dữ liệu của lời gọi","answer_id":52140},{"id":13885,"question":"Lựa chọn nào sau đây là một thuật ngữ thích hợp gắn với hành động gian lận mạo danh một người có thẩm quyền?","answer_label":"Giả mạo","answer_id":53792},{"id":13886,"question":"Một kẻ tấn công gọi tới bàn trợ giúp của công ty, giả mạo là một nhân viên đã bị mất mật khẩu của họ. Nhân viên trợ giúp thiết lập lại mật khẩu thành “password1” mặc định của công ty. Kẻ tấn công sau đó sử dụng mật khẩu này để truy cập vào mạng công ty và thông tin trong máy chủ. Kiểu tấn công này gọi là gì?","answer_label":"Kỹ nghệ xã hội","answer_id":53797},{"id":13482,"question":"Lựa chọn nào sau đây là thích hợp đối với các font outline hơn là các font bitmap?","answer_label":"Để làm lớn các ký tự theo một tỷ lệ cho trước","answer_id":52181},{"id":13473,"question":"Trong một giao dịch thương mại điện tử sử dụng mật mã khoá công khai, vai trò của cơ quan chứng nhận (CA) là gì?","answer_label":"Cấp chứng thư số cho khoá công khai của các bên tham gia giao dịch","answer_id":52143},{"id":13498,"question":"Lựa chọn nào sau đây là một mô tả thích hợp của đánh giá rủi ro?","answer_label":"Thứ tự ưu tiên của ứng phó với rủi ro được xác định bởi kích thước của các rủi ro dựa trên giá trị dự kiến bị mất và xác suất xảy ra","answer_id":52245},{"id":13494,"question":"Lựa chọn nào sau đây là một phương pháp thích hợp của việc xác thực người dùng nhờ dùng một mật khẩu?","answer_label":"Mật khẩu được chuyển đổi thành một giá trị băm và được đăng ký, và mật khẩu được nhập trong quá trình xác thực được chuyển đổi bởi hàm băm và được so sánh","answer_id":52228},{"id":13890,"question":"Một hệ thống sao lưu dữ liệu phải hỗ trợ khôi phục mọi giao dịch cho đến thời điểm 5 phút trước khi thảm họa xảy ra. Đây là kiểu mục tiêu gì?","answer_label":"Mục tiêu về thời điểm khôi phục","answer_id":53811},{"id":13477,"question":"Khi một ổ đĩa cứng hoạt động bình thường của một máy tính mà trên đó các tập tin bí mật được lưu trữ được chuyển giao cho một nhà cung cấp chất thải công nghiệp, đáp án nào sau đây là một biện pháp đối phó thích hợp để chống rò rỉ thông tin?","answer_label":"Ghi đè lên tất cả các vùng trên đĩa cứng với một chuỗi bit ngẫu nhiên nhiều lần","answer_id":52161},{"id":13497,"question":"Khi ông A, người có một chứng chỉ số, dùng một email để đặt hàng với cửa hàng B, ông ta dùng khóa riêng của mình và ký số email. Cửa hàng B sau đó dùng khóa công khai của ông A để xác nhận chữ ký. Lựa chọn nào sau đây có thể đạt được nhờ dùng phương pháp này? Ở đây, chỉ ông A có thể dùng khóa riêng của mình.","answer_label":"Nó được xác nhận rằng đơn hàng đang đến cửa hàng B là một đơn hàng từ ông A","answer_id":52239},{"id":13467,"question":"Mô hình phân phối nào sau đây sử dụng ARP?","answer_label":"Unicast","answer_id":52121},{"id":13503,"question":"Lựa chọn nào sau đây có thể được cài đặt với các chức năng của HTTPS (HTTP over SSL/TLS)?","answer_label":"Mã hóa giao tiếp giữa một máy chủ Web và một trình duyệt","answer_id":52263},{"id":13889,"question":"Một người dùng mới nhận được một tập tin có tên “image.jpg”. Khi kiểm tra chặt chẽ hơn, hóa ra tên tập tin thực sự là “image.jpg            .exe”, với các khoảng trống ở giữa hậu tố giả là .jpg và hậu tố thực là .exe. Thuật ngữ nào sau đây được dùng thích hợp nhất để mô tả kiểu tấn công này","answer_label":"Trojan horse","answer_id":53807},{"id":13461,"question":"Lựa chọn nào trong số các phương pháp kết hợp hai (2) bảng trong một RDBMS sau đây là mô tả của phương pháp nối hợp nhất sắp xếp?","answer_label":"Tất cả các hàng trong các bảng được sắp xếp lại theo các giá trị trong cột để được nối, và chúng được nối theo thứ tự từ trên xuống.","answer_id":52094},{"id":13485,"question":"Lựa chọn nào sau đây là một phương pháp phù hợp dùng để xóa bỏ dư thừa dữ liệu trong các hệ thống cơ sở dữ liệu quan hệ?","answer_label":"Chuẩn hóa","answer_id":52193},{"id":13879,"question":"Lựa chọn nào sau đây là một địa chỉ IP định tuyến trên mạng Internet?","answer_label":"172.40.77.4","answer_id":53767},{"id":13880,"question":"Trong bảy tầng của mô hình tham chiếu cơ bản OSI, tầng nào chịu trách nhiệm chuyển tiếp các gói tin, bao gồm việc định tuyến chúng qua các router trung gian?","answer_label":"Tầng mạng","answer_id":53771},{"id":13463,"question":"Trong một hệ thống cơ sở dữ liệu phân tán, lựa chọn nào sau đây là một phương pháp để hoàn thiện xử lý cập nhật khi một truy vấn được tạo cho nhiều trang thực hiện một chuỗi các xử lý giao dịch như việc hoàn thiện có khả thi hay không và việc hoàn thiện có thể thực hiện trên tất cả các trang hay không?","answer_label":"Xác nhận hai pha","answer_id":52105},{"id":13881,"question":"Trong một mạng IPv4, lựa chọn nào sau đây là tổ hợp đúng của một lớp địa chỉ IP, dải địa chỉ IP của nó, và một subnet mask?\n\n![](https://learn.viblo.asia/uploads/e/b/eb34b01f-9b61-4d5b-8d1f-9d49c232b8bd.png)","answer_label":"b","answer_id":53775},{"id":13458,"question":"Lựa chọn nào sau đây là một quá trình trong PCM để lấy các giá trị tương tự từ tín hiệu âm thanh trong một khoảng thời gian định kỳ?","answer_label":"Lấy mẫu","answer_id":52085},{"id":13469,"question":"Công nghệ nào sau đây là một công nghệ ngăn chặn việc nhập thông tin tự động từ một chương trình bằng cách yêu cầu nhập các ký tự từ một hình ảnh bị méo hoặc một hình ảnh mà một số phần của nó bị ẩn? Công nghệ này dựa trên sự khác biệt về nhận thức của những hình ảnh này giữa con người và các chương trình.","answer_label":"CAPTCHA","answer_id":52126},{"id":13495,"question":"Khi phần mềm độc hại mà thực hiện một xâm nhập thành công vào một máy tính giao tiếp với một máy chủ ra-lệnh-và-kiểm-soát trên Internet, lựa chọn nào sau đây là một lý do cho việc sử dụng cổng TCP 80 như là cổng đích cho hầu hết trường hợp?","answer_label":"Vì cổng này được sử dụng để duyệt các trang web, có một xác suất cao mà truyền thông được cho phép bởi tường lửa","answer_id":52230},{"id":13487,"question":"Trong một lược đồ quan hệ R = (A, B, C, D, E), cho các phụ thuộc hàm như sau:\nA→ BC\nCD→ E\nB → D\nE → A\nLựa chọn nào sau đây là một sự kết hợp của hai khóa dự tuyển của R?","answer_label":"A và E","answer_id":52198},{"id":13476,"question":"Khi phần mềm độc hại đã xâm nhập thành công vào máy PC giao tiếp với máy chủ điều khiển và kiểm soát trên Internet, điều nào sau đây là lý do để sử dụng số cổng TCP 80 là cổng đích trong hầu hết các trường hợp?","answer_label":"Trong trường hợp cổng này được sử dụng để duyệt các trang web, khả năng cao là việc truyền thông sẽ được tường lửa cho phép.","answer_id":52154},{"id":13875,"question":"Lựa chọn nào sau đây là một lời giải thích hợp lý về giản đồ (schema) trong RDBMS?","answer_label":"Đó là một tập định nghĩa dữ liệu, chẳng hạn như bản chất của dữ liệu, định dạng của dữ liệu, và các mối quan hệ với dữ liệu khác.","answer_id":53752},{"id":13462,"question":"Khi câu lệnh SQL được hiển thị bên dưới được thực hiện trên bảng “Employee” và bảng “Department”  đáp án nào là kết quả của câu lệnh? \n\nSELECT COUNT(*) FROM Employee, Department\n\n           WHERE Employee.Department = Department.Department_name AND \n\t\t\t\t\t \n           Department.Floor = 2\n![](https://learn.viblo.asia/uploads/b/1/b1d31d57-0e06-4785-9e52-fa857ec9341f.jpg)","answer_label":"3","answer_id":52100},{"id":13478,"question":"Lựa chọn nào sau đây là lý do VLAN được sử dụng?","answer_label":"Để giảm lưu lượng mạng","answer_id":52163},{"id":13878,"question":"Câu lệnh SQL nào sau đây đối với bảng \"ShipmentRecord\" cho giá trị lớn nhất?\n![](https://learn.viblo.asia/uploads/b/f/bfa5b2a9-3b6f-4fbd-b063-cf4b59a56eae.png)","answer_label":"SELECT COUNT(*) FROM ShipmentRecord","answer_id":53763},{"id":13887,"question":"Một cuộc tấn công trung gian xảy ra khi kẻ tấn công chặn đường liên lạc và giả mạo danh tính của một trong hai bên tham gia. Làm thế nào để có thể đề phòng hiệu quả với một cuộc tấn công như vậy?","answer_label":"Có thể đề phòng một cuộc tấn công như vậy bằng việc có sự chứng thực thông qua chữ ký số trước khi chấp nhận khóa công khai của ai đó.","answer_id":53799},{"id":13884,"question":"Alan muốn gửi một tin nhắn mã hóa cho Bob bằng cách sử dụng phương thức mã hóa không đồng bộ. Lựa chọn nào sau đây phải xảy ra trước khi Alan sẽ gửi tin nhắn mã hóa cho Bob? Ở đây, Alan đã chứng minh với Bob bằng chữ ký kỹ thuật số rằng Alan là người gửi tin nhắn cho Bob.","answer_label":"Bob cung cấp khóa công khai của mình cho Alan.","answer_id":53789},{"id":13493,"question":"Trên Internet, đôi khi một người cố tải một trang Web bằng cách chỉ rõ một URL kiểu: http://www.jitec.ipa.go.jp/, trang không thể hiển thị và trang lỗi xuất hiện thay vào đó. Tuy nhiên, người dùng có thể duyệt đúng trang bằng cách chỉ rõ địa chỉ IP kiểu: http://118.151.146.137/. Tầng TCP/IP nào sau đây chịu trách nhiệm về vấn đề này?","answer_label":"Tầng Ứng dụng","answer_id":52222},{"id":13499,"question":"Lựa chọn nào sau đây là một mô tả về các biện pháp chống rò rỉ thông tin?","answer_label":"Các nội dung của đĩa cứng của một máy tính xách tay được mã hóa","answer_id":52248},{"id":13468,"question":"Một máy tính cá nhân và một máy chủ web đang giao tiếp qua HTTP. Khi một gói tin yêu cầu được gửi từ máy tính tới máy chủ web, lựa chọn nào sau đây là kết hợp số cổng của gói phản hồi. Ở đây, số của cổng nguồn và cổng đích của gói tin yêu cầu là 50001 và 80 tương ứng","answer_label":"Số của cổng nguồn (Máy chủ web): 80\n\nSố của cổng đích (Máy tính cá nhân): 50001","answer_id":52122},{"id":13501,"question":"Lựa chọn nào sau đây là một mục tiêu của việc sử dụng một WAF (Tường lửa ứng dụng Web)?","answer_label":"Một tấn công dựa trên một lỗ hổng gây cho một máy chủ Web và một ứng dụng Web bị khóa lại.","answer_id":52254},{"id":13883,"question":"Lựa chọn nào sau đây là một mô tả phù hợp về tiện ích netstat?","answer_label":"Nó hiển thị các kết nối TCP đang hoạt động.","answer_id":53782},{"id":13459,"question":"Thuộc tính nào sau đây của giao dịch cơ sở dữ liệu đề cập đến khả năng hệ thống có thể khôi phục lại một giao dịch đã cam kết khi hệ thống hoặc phương tiện lưu trữ thất bại?","answer_label":"Độ bền","answer_id":52088},{"id":13474,"question":"Điều nào sau đây là mục đích thích hợp để sử dụng giá trị băm trong an ninh số?","answer_label":"Để chứng minh tính giống nhau giữa bản gốc và bản sao của dữ liệu có thể được sử dụng làm bằng chứng","answer_id":52147},{"id":13492,"question":"Lựa chọn nào sau đây là một mô tả thích hợp của Giao thức điều khiển truyền (TCP)?","answer_label":"Nó đảm bảo độ tin cậy bằng cách truyền lại các phân đoạn dữ liệu nếu bất kỳ trong chúng bị mất.","answer_id":52218},{"id":13882,"question":"Lựa chọn nào sau đây là dịch vụ Internet chuyển một tên miền như www.viblo.asia thành địa chỉ IP tương ứng của nó?","answer_label":"DNS","answer_id":53779},{"id":13457,"question":"Khi dữ liệu đặt hàng ở định dạng dưới đây được nhập, lựa chọn nào sau đây là một phép kiểm tra thích hợp để kiểm tra xem giá trị của trường Order date là vào ngày làm việc trùng hay trước ngày nhập?\n![](https://learn.viblo.asia/uploads/0/b/0b094680-67ed-4385-8990-3199e82b81f6.jpg)","answer_label":"Kiểm tra logic","answer_id":52081},{"id":13460,"question":"Có một bảng “Delivery” có sáu (6) bản ghi. Điều nào sau đây là sự phụ thuộc chức năng mà bảng này thỏa mãn? Ở đây, “X → Y”  chỉ ra rằng X quyết định chức năng Y.\n![](https://learn.viblo.asia/uploads/7/c/7cf1f7db-ba56-4c03-9985-128eed4dfb52.jpg)","answer_label":"Delivery_destination → Component_ID","answer_id":52091},{"id":13874,"question":"Cơ sở dữ liệu nào sau đây được thiết kế gồm nhiều bảng, với các dòng và các cột liên kết với nhau thông qua việc đối chiếu dữ liệu lưu trữ trong mỗi bảng?","answer_label":"Cơ sở dữ liệu quan hệ","answer_id":53749},{"id":13877,"question":"Trong các giai đoạn thiết kế cơ sở dữ liệu, giai đoạn nào sau đây liên quan đến việc tạo ra một sơ đồ ER?","answer_label":"Giai đoạn thiết kế khái niệm cơ sở dữ liệu","answer_id":53758},{"id":13873,"question":"Lựa chọn nào sau đây là một lời giải thích thích hợp về việc cắt ghép trong xử lý đồ họa 3D?","answer_label":"Đó là một phương pháp cho phép hoặc vô hiệu hóa một cách có chọn lọc các hoạt động dựng hình trong một vùng xác định.","answer_id":53742},{"id":13488,"question":"Lựa chọn nào sau đây là mục tiêu chính của hỗ trợ giao tác trong một hệ quản trị cơ sở dữ liệu?","answer_label":"Để đảm bảo rằng hoặc là tất cả các cập nhật tương ứng với một giao tác cho trước được làm hoặc không cập nhật nào cả","answer_id":52202},{"id":13465,"question":"Trong mô hình phân cấp mạng TCP/IP, tên của Thiết bị A kết nối hai phân đoạn LAN ở tầng Internet là gì?\n![](https://learn.viblo.asia/uploads/6/8/685fdcdf-46f4-415c-997f-53d4b613c232.jpg)","answer_label":"Router","answer_id":52112},{"id":13502,"question":"Lựa chọn nào sau đây là một giải thích của phương pháp so khớp mẫu được sử dụng bởi phần mềm chống virus?","answer_label":"Một virus bị phát hiện thông qua việc so sánh với chữ ký của một virus đã được biết.","answer_id":52261},{"id":13475,"question":"Lựa chọn nào sau đây là hoạt động thích hợp để xác thực người dùng sử dụng thẻ IC và mã PIN?","answer_label":"Khi phát hành thẻ IC, mã PIN không được đính kèm nhưng được thông báo cho người dùng thông qua kênh khác.","answer_id":52153}]